{"title":"A few questions about API usage","pubDate":"2016-01-09T01:14:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/A-few-questions-about-API-usage","comments":[{"pubDate":"2016-01-09T13:29:24.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/A-few-questions-about-API-usage/5906718","author":"StevenL.3761","body":"\n<p>See the Content Terms of Use for what you can or can’t do (<a href=\"https://www.guildwars2.com/en/legal/guild-wars-2-content-terms-of-use/\">https://www.guildwars2.com/en/legal/guild-wars-2-content-terms-of-use/</a>).</p>\n<p>I don’t see anything in the terms that prohibits storing icons offline. Which would be silly because your browser already does that automatically when it caches those images, and we would all be in violation.</p>\n<p>If you want to use the same colors that are used in-game then you’ll have to use a color sniffer tool. Run the game client in windowed mode for that.<br>\nAfter a quick google search: <a href=\"http://colorcop.net/\">http://colorcop.net/</a></p>","arenanet":false},{"pubDate":"2016-01-09T01:14:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/A-few-questions-about-API-usage/5905899","author":"bostrees.5306","body":"\n<p>I’m a novice-to-moderate programmer, mostly self taught in a few languages, and I’ve decided to give myself a side project as I start my actual programming classes for college in the next week (hooray for “non-traditional” students :P)</p>\n<p>Right now, I’m using HTML/JavaScript/CSS to handle my API calls and returns and keeping it as simple as I can so I can try to learn some new things as I go. I’ve saved copies of a few item icons to work with because I was having issues with getting a for loop to make repeated fetch()’s (Will I get in trouble if my final version uses these copies? Do I have to plug into the API for icons if I use them?).</p>\n<p>My next plan is to start making a mouseover effect for the icons I’m using, like you can see on dulfy and other sites, as well as in game. I figure that’s some CSS :hover related stuff to get the boxes showing up correctly (which I’ll be looking into more soon), but I’m wondering if there’s a specific set of fonts/color hex codes that are listed somewhere to replicate the game’s look as closely as possible?</p>","arenanet":false}]}