{"title":"Account number scraper","pubDate":"2014-05-03T11:43:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Account-number-scraper","comments":[{"pubDate":"2014-05-11T14:39:37.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Account-number-scraper/4012424","author":"StevenL.3761","body":"\n<p>I wouldn’t say <em>stolen</em>. Perhaps <em>inspired by</em>. The code is not similar enough to state that @Indy even knew this blog post existed before writing his own version.</p>\n<p>Regardless, we have little use for this stuff on these forums. I’d be much more interested to see what other sorts of cool stuff you can do with Node.js, but this time targeting the official APIs.</p>","arenanet":false},{"pubDate":"2014-05-09T17:12:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Account-number-scraper/4007090","author":"Samuirai.4561","body":"\n<p>seems to be stolen from here: <a href=\"http://blog.rce.fi/2013/04/guild-wars-2-and-four-digit-id.html\">http://blog.rce.fi/2013/04/guild-wars-2-and-four-digit-id.html</a></p>","arenanet":false},{"pubDate":"2014-05-04T21:36:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Account-number-scraper/3989238","author":"Drakma.1549","body":"\n<p>wut?</p>","arenanet":false},{"pubDate":"2014-05-03T11:43:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Account-number-scraper/3984823","author":"Indy.2718","body":"\n<p><i>This is probably off-topic for this subforum, but as there isn’t an off-topic subforum, I figured this’d be the best place. Please let me know if that isn’t the case.</i></p>\n<p>I bought the game today, and I was hoping to get the username <strong>Indy.1337</strong>, so I wrote a node.js script to do that. Unfortunately, I didn’t realize until after I wrote the script that the server would never return 1337, because it only returns codes without duplicate digits.</p>\n<p>This script uses the fact that many email providers (gmail in particular) will ignore any extra dots in email addresses, so script uses permutations of your email address (which will still end up leading to your inbox) while giving you many codes to choose from.</p>\n<p>The script accepts an array of codes, your email, your username, and scrapes the server in search of codes in the array.</p>\n<p><strong>Screenshot</strong>: \t<a href=\"https://cdn.mediacru.sh/3QrCt6IN7WLE.png\">https://cdn.mediacru.sh/3QrCt6IN7WLE.png</a><br>\n<strong>Code</strong>:\t\t\t<a href=\"http://pastebin.com/NynXvViT\">http://pastebin.com/NynXvViT</a></p>\n<p>The script is full of bugs, so feel free to add any patches~ I didn’t think I’d be releasing it, so the quality of the code probably shows that. Particularly, the permutations of emails are poorly written <em>(L49-76)</em>, but it’s a proof-of-concept, at least.</p>\n<p>After writing the script, I ended up using 2.718 (e) for my code, as 3.141 (pi) would have been impossible. (3.142 would have worked, though)</p>\n<p>Ehh… any thoughts will be appreciated.<br>\n<em>(perhaps an admin wants to give me Indy.1337 for effort?~)</em></p>","arenanet":false}]}