{"title":"Any good tutorials on how to use the API?","pubDate":"2016-02-12T00:56:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Any-good-tutorials-on-how-to-use-the-API","comments":[{"pubDate":"2016-07-13T18:33:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Any-good-tutorials-on-how-to-use-the-API/6242858","author":"Sariel V.7024","body":"\n<p>The API is essentially text data you access with a web connection, so Javascript should be fine.</p>","arenanet":false},{"pubDate":"2016-07-13T08:51:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Any-good-tutorials-on-how-to-use-the-API/6242152","author":"RobbyT.1925","body":"\n<p>I have a question maybe someone can answer.  If I wanted to create a website, say for a guild.  Does the API interface with Javascript?  I know the API is service based, so I honestly don’t see this being a problem.</p>","arenanet":false},{"pubDate":"2016-02-13T07:48:47.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Any-good-tutorials-on-how-to-use-the-API/5984191","author":"PBag.7450","body":"\n<p><a href=\"https://www.codecademy.com/en/courses/python-intermediate-en-6zbLp/0/1?curriculum_id=50ecbb9b71204640240001bf\">https://www.codecademy.com/en/courses/python-intermediate-en-6zbLp/0/1?curriculum_id=50ecbb9b71204640240001bf</a></p>\n<p>This might help. Most of the stuff I’ve made (ie grab info or check info) are just Python or PHP scripts. Here’s a breakdown of how you could teach yourself to manipulate the data in some interesting way. Once you are able to do this, you should be set.</p>\n<p>Build a function that grabs the achievement array from one of the categories in the <a href=\"https://api.guildwars2.com/v2/achievements/categories?ids=all\">achievement/categories endpoint.</a></p>\n<p>Build a function that takes an array of achievement ids and saves them into a txt file in the form ID =&gt; NameOfAchievement.</p>\n<p>Should be all downhill once you can do that in Python in a way where all you have to do is click run and it will create a file with achievements listed like that.</p>\n<p>Hope that helps. If you want help (try google first), message me and I’ll see what I can do.</p>","arenanet":false},{"pubDate":"2016-02-13T00:32:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Any-good-tutorials-on-how-to-use-the-API/5983806","author":"Dra Keln.2015","body":"\n<p>Alright yeah I poked around a bit and got the same certification error in Java. Glad to know it wasn’t just me messing up haha.</p>","arenanet":false},{"pubDate":"2016-02-12T18:22:26.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Any-good-tutorials-on-how-to-use-the-API/5983250","author":"Sariel V.7024","body":"\n<p>I did most of my poking about with Java. Currently there seems to be a problem with the API’s certificate not being recognized, or some such that I can’t resolve.</p>\n<p>In order to interface with the API, you’ll need to look into opening HTTP connections and download a library for managing JSON objects.</p>\n<p>You can look at the wiki entry for API to get an idea of the data and link formats you’ll be dealing with. You should use a non-IE browser for this. Chrome and Firefox handle it fine in-browser.</p>","arenanet":false},{"pubDate":"2016-02-12T00:56:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Any-good-tutorials-on-how-to-use-the-API/5981966","author":"Dra Keln.2015","body":"\n<p>Hi I would love to learn how to write my own simple apps for the API, I have some experience with Java and am currently learning Python and Javascript, if anyone could point me towards a good tutorial for one of those that would be great</p>","arenanet":false}]}