{"title":"[API Suggestion]Raid UI","pubDate":"2014-02-05T17:06:48.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Raid-UI","comments":[{"pubDate":"2014-04-05T00:21:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Raid-UI/3859011","author":"Anubis.9346","body":"\n<p>That would be wonderful<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2014-04-01T23:56:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Raid-UI/3845523","author":"DanScott.4839","body":"\n<p>This is a neat idea and I think a lot of players would actually be very very interested in functionality like this, but with the API in it’s current state, it does not offer any public information about Health bars for both players you own and players that you don’t. There have been a few people digging around the client and have found that the client itself stores damage numbers for DPS monitoring. If this information is kept client side then it’s totally possible that the client also stores information on health numbers client side that could be read from a third party application.</p>\n<p>So baring that in mind you could go from GW2 Client -&gt; Third Party Application -&gt; Post information to a server -&gt; Overlay Application displays information obtained from clients<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2014-03-09T01:54:29.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Raid-UI/3738021","author":"Naz.2607","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 05 2014 06:29PM\"><a href=\"/forum/community/api/API-Suggestion-Raid-UI/3598632\">Morhyn.8032:</a></cite></div><div class=\"quotey\"><p>What is the point?</p></div></blockquote>\n<p>Do you really have to ask?</p>","arenanet":false},{"pubDate":"2014-02-05T18:29:12.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Raid-UI/3598632","author":"Morhyn.8032","body":"\n<p>What is the point? And I think this is the wrong subforum for this topic.</p>","arenanet":false},{"pubDate":"2014-02-05T17:06:49.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Raid-UI/3598145","author":"DanyK.3842","body":"\n<p>First of all I have no idea if this is possible or not but I do hope it is because this would make it much easier for WvW players and guilds to play this game in general.<br>\nI have spent quite some time searching this forum section with no luck on anything that’s similar to what I need but the search function of this site seems flawed so if this has already been made I apologise.</p>\n<p>The idea:<br>\n<strong>A raid UI</strong> that could be a program which runs on top of GW2 and fits the current party UI in design or just placement, but has the option to add much more players to it, like an actual raid UI in games. Since I am not familiar with the GW2 API I don’t know how this could be achieved so I came up with this idea:</p>\n<p>If the game client receives the actual information about all the players’ health that are on the same map or in the proximity – this program could use that information and feed it to the UI panel that servers as the graphical interface for the app. This way the system would function exactly like the normal party system except the allied player would have no way to control whether you can monitor their health bar and conditions or not.</p>\n<p>Let me know if this seems possible or if it’s already been done.</p>","arenanet":false}]}