{"title":"API for item ingredient info","pubDate":"2016-09-16T17:28:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-for-item-ingredient-info","comments":[{"pubDate":"2016-09-24T05:18:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-for-item-ingredient-info/6339225","author":"Mystic.5934","body":"\n<p>I think Lawton is referring to my recipes:<br>\n<a href=\"http://www.gw2profits.com/json\">http://www.gw2profits.com/json</a><br>\nwe had a big discussion about it over <a href=\"https://forum-en.guildwars2.com/forum/community/api/Created-a-json-file-for-Mystic-Forge-recipes/first\">here</a> if you’re interested<br>\nAs far as I know it has all of the forge’s guaranteed-output recipes (it’s missing things like “4 rares = 1 rare with chance of exotic”).  It also has misc other recipes, like charging achievement items (very handy for the new legendaries) or buying items from vendors or promoting Evergreen Slivers.  It does not have the recipes available from GW2 API, but you can get those easily enough.<br>\nYou can refine the search and only get the recipes you want. That main page should explain all the options (and I change things occassionally, so check it for the latest version), if you’re just looking for all forge recipes, the link you want is probably this:<br>\n<a href=\"http://gw2profits.com/json/v3?disciplines=Mystic\">http://gw2profits.com/json/v3?disciplines=Mystic</a> Forge<br>\nIf you know of any recipes that are missing, I’d love to add them.  a compiled recipe, text, even just a wiki link is all I need.  I’ve steamlined the process pretty well so just knowing the recipe exists is my biggest hurdle – I add the new ones from patch notes within a couple days of release.</p>","arenanet":false},{"pubDate":"2016-09-17T11:53:07.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-for-item-ingredient-info/6329839","author":"Killerjo.3975","body":"\n<p>Ahh great thanks for this information, that is some really useful stuff there.</p>\n<p>Thanks</p>","arenanet":false},{"pubDate":"2016-09-16T18:18:14.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-for-item-ingredient-info/6329055","author":"Lawton Campbell.8517","body":"\n<p>For mystic forge recipes, no. There’s a community-maintained JSON document somewhere that has (probably) all of the mystic forge recipes.</p>\n<p>For discovered crafting recipes, if you know the item id (e.g., <a href=\"https://api.guildwars2.com/v2/items/15466\">15466</a>), you can use /v2/recipes/search to get <a href=\"https://api.guildwars2.com/v2/recipes/search?output=15466\">a list of all recipes that output the item</a>, which can <a href=\"https://api.guildwars2.com/v2/recipes/6002\">then be resolved against /v2/recipes</a> to get the inputs. The inputs can then be recursively put into /v2/recipes/search to get the entire crafting tree.</p>","arenanet":true},{"pubDate":"2016-09-16T17:28:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-for-item-ingredient-info/6329002","author":"Killerjo.3975","body":"\n<p>Hello,</p>\n<p>i am new to the GW2 API and i want to know how i can get a list of ingredients for a special item id.</p>\n<p>For example there is not a recipe for every weapon, but i want to get a list of item ids that are required to craft the weapon. For example a list of items i need to craft a legendary weapon in the mystic forge.</p>\n<p>Is there something like that ?</p>","arenanet":false}]}