{"title":"API documents to WIKI","pubDate":"2013-08-07T13:35:07.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-documents-to-WIKI","comments":[{"pubDate":"2013-08-07T19:02:46.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-documents-to-WIKI/2577830","author":"AdelphiA.9287","body":"\n<p>This seems fair to me and thank you for clearing it up.</p>","arenanet":false},{"pubDate":"2013-08-07T18:24:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-documents-to-WIKI/2577501","author":"Stephane Lo Presti.7258","body":"\n<p>Hi AdelphiA.9287,</p>\n<p>Thanks for letting us know here. I’ve modified my messages to be clearer, sorry for the confusion caused (I forgot to remove this bit when copying/pasting the text from other threads).</p>\n<p>This is why I mentioned a “progressive move to the wiki” as there’ll be things to clarify and also developers will have to get used to the wiki practices. The wiki is not a promotion tool, except for these specific areas where we allow it (such as the list of applications). You can see it as the equivalent of the set of stickies on this subforum, they work with their own rules. The only place where we’ll allow you to run your own promotion and feedback-gathering is in the “Fan-generated Content”.</p>\n<p>These rules are set so that we can preserve the specific tone and role of each media. I’ll summarize this here by emphasizing the key points:</p>\n<ul>\n\t<li>the API Development subforum is for <strong>technical discussions</strong></li>\n\t<li>the Fan-generated Content is for <strong>promotion and feedback-gathering</strong></li>\n\t<li>the wiki is for helping <strong>document</strong> the API and all API-related topics</li>\n</ul>\n<p>Feel free to share your views on this general organization, so that we can make it work for everyone. You’ll notice from Dr Ishmael’s post that we have an active and helpful community of wiki editors and administrators, they’ll be able to help you understand the wiki practices and tools.</p>\n<p>Let me know if you have questions or comments. Thank you.</p>","arenanet":true},{"pubDate":"2013-08-07T15:11:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-documents-to-WIKI/2575817","author":"AdelphiA.9287","body":"\n<p>I tried but couldn’t figure out how to as there’s no “respond” facility. Also wanted to make others aware so they didn’t do the same thing.</p>","arenanet":false},{"pubDate":"2013-08-07T15:06:29.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-documents-to-WIKI/2575783","author":"Dr Ishmael.9685","body":"\n<p>I left a comment on your talk page explaining this, you could have simply responded to me there.</p>","arenanet":false},{"pubDate":"2013-08-07T13:35:07.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-documents-to-WIKI/2575137","author":"AdelphiA.9287","body":"\n<p>Please could you amend the comment under <a href=\"https://forum-en.guildwars2.com/forum/community/api/API-Documentation/2571100\">https://forum-en.guildwars2.com/forum/community/api/API-Documentation/2571100</a></p>\n<p>“Feel free to join the API editor group on the wiki to add your own application or maintain the page above ! You can leave comments about this on the forum thread I lined above or directly get in touch with me via forum private messages. Thanks.”</p>\n<p>I understood this to mean we can add our own application to the wiki itself, not the API Application List so I did and it was deleted within 2 minutes!</p>\n<p>Please could these things be made a little clearer.</p>","arenanet":false}]}