{"title":"API:2/Achievements - Missing Achievement(s)","pubDate":"2016-06-14T15:26:40.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-2-Achievements-Missing-Achievement-s","comments":[{"pubDate":"2016-06-15T17:18:37.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-2-Achievements-Missing-Achievement-s/6203997","author":"Bandlero.6312","body":"\n<p>I can’t speak for other developers who use the API, but I would not be surprised if most first reference API:2/achievements/categories to first get the achievements Ids, instead of getting the achievements Ids from API:2/account/achievements first.  The difference between the two, especially against API keys from older accounts, is that there are 7+ achievements that will not show up in API:2/achievements/categories achievements array.</p>\n<p>The way I develop, I reference API:2/account/achievements first and resolve all pertinent data against the API:2/achievements/, API:2/achievements/categories, etc.  The order of operation does make a difference; bottom-up versus top-down.</p>","arenanet":false},{"pubDate":"2016-06-15T17:08:22.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-2-Achievements-Missing-Achievement-s/6203981","author":"Malediktus.9250","body":"\n<p>These orphaned achievements might explain why I have 1 more AP ingame than I can see via API. I am still wondering every day where it might come from.</p>","arenanet":false},{"pubDate":"2016-06-14T23:29:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-2-Achievements-Missing-Achievement-s/6202501","author":"Bandlero.6312","body":"\n<p>I do vaguely remember reading years back that when it was first decided to remove some achievements from complete-ability, that one achievement had been completely removed except for its points that counted toward total AP; I would assume that is the achievement that is missing all of its details except id and what was earned.</p>\n<p>All of the orphaned achievements do have their categories available (from API:2/achievements/categories), they’re just not in the achievements arrays on those respective categories.  All of these categories are also “historical,” which makes it odd they are not – now – in their categories (perhaps in the past their exclusion was necessary, but surely not now, now that it is all historical.)</p>\n<p>On a side note – this is only visible from API data and not visible in-game – there is a “typo” on the item description for each of the items relating to the bladed back item – the opening &lt;c=@flavor&gt; tags on those items are lacking their closing &lt;/c&gt; tag and instead have a &lt;c&gt; tag; the / is missing.  Only those of us that work with the API data are likely to ever see that typo/error.</p>","arenanet":false},{"pubDate":"2016-06-14T22:03:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-2-Achievements-Missing-Achievement-s/6202309","author":"Lawton Campbell.8517","body":"\n<p>The orphaned/empty achievements are content issues. They’re not displayed in the in-game achievements UI, but they are counted towards your total AP. I don’t have any insight into content changes, so I’m not sure why they’re not displayed or if/when they’ll be fixed, unfortunately.</p>","arenanet":true},{"pubDate":"2016-06-14T20:34:11.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-2-Achievements-Missing-Achievement-s/6202114","author":"Bandlero.6312","body":"\n<p>I missed 427.  I have also noticed there are at least 6 orphaned achievements that have no Achievement Categories containing them.  These achievements are historical (some are very historical), and are (sorry I don’t have the ids on-hand atm) named: “Get on the Good List”,  “Queen’s Gauntlet Chamber”, “Aftermath Emergency Response”, “Hobby Tinkerer”, “Mist Explorer”, and “Boss Week: Here Be Dragons!”.</p>\n<p>Also, there appears to be 1 historical achievement that is lacking an Achievement Category and it is also lacking a name, description, etc. (basically everything); except that this achievement does have an id and an icon (which looks like a leaf.)</p>","arenanet":false},{"pubDate":"2016-06-14T17:11:59.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-2-Achievements-Missing-Achievement-s/6201634","author":"Lawton Campbell.8517","body":"\n<p>For some reason that one and <a href=\"https://api.guildwars2.com/v2/achievements/427\">427</a> fell out of the whitelist. Not really sure how/why, but I added them back in.</p>","arenanet":true},{"pubDate":"2016-06-14T15:26:40.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-2-Achievements-Missing-Achievement-s/6201412","author":"Bandlero.6312","body":"\n<p>Not all items served by API:2/account/achievements have their “id” resolvable against API:2/achievements “id”.</p>\n<p>So far I have found the following “id” missing from API:2/achievements:<br>\n2811</p>","arenanet":false}]}