{"title":"[API Suggestion] Dungeons","pubDate":"2014-02-27T17:22:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Dungeons","comments":[{"pubDate":"2014-02-27T17:22:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Dungeons/3696123","author":"Zetsubo.2589","body":"\n<p>I haven’t seen any suggestion thread for this yet and it doesn’t really fit in any of the existing suggestion threads, so I’m creating a new one.</p>\n<p>I realize that other API’s might be higher on the to do list, but I still wanted to put my two cents in as to what API I would like to have access to in order to provide the community with some cool and handy apps.</p>\n<p>At this point, it is impossible to gather any kind of data concerning dungeons. That’s a shame, imo, because having a leaderboard for Dungeons might actually be cool to have as well as be an incentive for guilds to keep running dungeons. To that end, the following functionalities would be desired:</p>\n<p>- A way to see how many dungeon runs are going on, plus some basic characteristics (which dungeon, start time, …)<br>\n- A way to track the duration of a dungeon run. This is the most basic need: a simple begin and end timestamp is enough for speedrunning purposes.<br>\n- It would be very nice to have access to the combat log for the dungeon run only. A simple text dump of the combat log for the duration of the dungeon would suffice. This would allow for more data to be considered when determining whether a dungeon run was “better” than another. This would lead to more diverse competition instead of simply posting a better completion time.</p>\n<p>These are just some ideas on how the API could provide us with meaningful statistics concerning dungeons that would allow for the creation of apps that would increase the incentive to run dungeons for all players, through leaderboards and statistics.</p>\n<p>Anyone else interested in having some API support for dungeons or other instanced content?</p>","arenanet":false}]}