{"title":"[API Suggestion] Aera names","pubDate":"2013-06-06T19:45:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Aera-names","comments":[{"pubDate":"2013-06-06T22:43:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Aera-names/2168491","author":"Dr Ishmael.9685","body":"\n<p>The English term is “<a href=\"http://wiki.guildwars2.com/wiki/Region\">region</a>”, and it’s a static property of each zone. There’s really no need for this to be in the API.</p>\n<ul>\n\t<li>Ascalon:\n\t<ul>\n\t\t<li>Plains of Ashford</li>\n\t\t<li>Diessa Plateau</li>\n\t\t<li>Fields of Ruin</li>\n\t\t<li>Blazeridge Steppes</li>\n\t\t<li>Iron Marches</li>\n\t\t<li>Fireheart Rise</li>\n\t</ul></li>\n</ul>\n<ul>\n\t<li>Shiverpeak Mountains:\n\t<ul>\n\t\t<li>Wayfarer Foothills</li>\n\t\t<li>Snowden Drifts</li>\n\t\t<li>Lornar’s Pass</li>\n\t\t<li>Dredghaunt Cliffs</li>\n\t\t<li>Timberline Falls</li>\n\t\t<li>Frostgorge Sound</li>\n\t</ul></li>\n</ul>\n<ul>\n\t<li>Kryta:\n\t<ul>\n\t\t<li>Queensdale</li>\n\t\t<li>Kessex Hills</li>\n\t\t<li>Gendarran Fields</li>\n\t\t<li>Harathi Hinterlands</li>\n\t\t<li>Bloodtide Coast</li>\n\t\t<li>Southsun Cove</li>\n\t</ul></li>\n</ul>\n<ul>\n\t<li>Maguuma Jungle:\n\t<ul>\n\t\t<li>Caledon Forest</li>\n\t\t<li>Metrica Province</li>\n\t\t<li>Brisban Wildlands</li>\n\t\t<li>Sparkfly Fen</li>\n\t\t<li>Mount Maelstrom</li>\n\t</ul></li>\n</ul>\n<ul>\n\t<li>Ruins of Orr:\n\t<ul>\n\t\t<li>Straits of Devastation</li>\n\t\t<li>Malchor’s Leap</li>\n\t\t<li>Cursed Shore</li>\n\t</ul></li>\n</ul>","arenanet":false},{"pubDate":"2013-06-06T19:45:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Aera-names/2167531","author":"Moyennus.2168","body":"\n<p>Hi.</p>\n<p>First of all, what I call “Aera” are the different part of Tyrie. (eg. “Kryte”, “Maguuma’s Jungle” or whatever the name is in English )</p>\n<p>If I want to see those informations through the API it’s for two reasons:</p>\n<p>First : I don’t like the huge list of map names.<br>\nCurrently, there are 26 maps (less the towns and the WvW maps (whereas there are some events on those maps)).<br>\nAnd maybe more in the future if the world of Tyrie evolve with new areas or maps.<br>\nSo, if only 26 names are already inconvenient in one list, imagine more.</p>\n<p>Second : It allows to be more precise on our search.<br>\nSome tasks, like Daily quest, ask for some events on some area.<br>\nSo I think it’s really usefull to select the area first, and then a specific map.<br>\nAnd the precision will be on the language too.<br>\nAll the APIs allow to gather the informations in four language (EN, FR,DE,ES). And this is really usefull, and I try to work on this, with a complet website for each server.</p>\n<p>And yes, actually I can manually type all the areas and use them as I wish, and it’s what I currently do. (In my native language of course, for the translation it will be a little funny.)<br>\nBut an upgrade of the worldmap, with new map in a new area will not allow any auto-upgrade. (Or maybe just a name who will change?)</p>\n<p>Maybe some persons will answer with a “You already have the map names, it’s enough”.</p>\n<p>Yes, it’s enough, but I think we can do more with a little more informations.<br>\nAnd as I said before, I’d like to be precise on the search, and not to have a huge list.<br>\nFor me, two smaller lists are more user friendly than a huge list.</p>\n<p>I apologize for my spelling errors (as English is not my native language)  and if this is a repost, but I don’t found anything on the forum about this.</p>\n<p>PS : An example that can help to make a choice between only map names or adding area names is currently Maguuma’s Jungle which is composed of : Mount Maelstrom and Sparkfly Fen.<br>\nThose maps actually seems to be part of Kryte since that Bloodtide Coast is in Kryte.</p>","arenanet":false}]}