{"title":"[API Suggestion]Waypoints API","pubDate":"2013-06-12T15:37:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Waypoints-API","comments":[{"pubDate":"2013-06-16T20:31:24.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Waypoints-API/2224234","author":"zwei.9073","body":"\n<p>There should be map api returning locations/ids of all map completion items (waypoints, but also hearts, pois)…</p>\n<p>And events should return more info (map markers and their locations).</p>\n<p>Pairing up this information should be left as exercise by reader :-)</p>","arenanet":false},{"pubDate":"2013-06-14T13:55:36.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Waypoints-API/2212459","author":"vitl.2306","body":"\n<p>Yes … this feature would be very very cool<img src=\"/include/images/smilies/smile.png\">.</p>","arenanet":false},{"pubDate":"2013-06-13T21:59:28.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Waypoints-API/2209205","author":"Lil Puppy.5216","body":"\n<p>While it is a very easy calculation, it is something best handled by the client, it is much less intensive to simply send data and that seems to be what Anet is focusing on with the API’s, just the raw data and that is perfect.</p>","arenanet":false},{"pubDate":"2013-06-13T21:31:45.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Waypoints-API/2209037","author":"Snowreap.5174","body":"\n<p>sounds unlikely.  it requires the server to do too much calculation, rather than having it simply report facts that it can look up in a database.</p>\n<p>what might be more reasonable, however, would be to add map coordinates for each event, and to also have an API that lists the map coordinates of all the waypoints, portals, points of interest, etc. for each map.</p>\n<p>then an application could calculate the distances to each waypoint on its own and show the user the waypoint with the smallest distance.  “advanced” applications could even calculate shortest paths that span maps by having you waypoint to an adjacent map then take a portal.</p>\n<p>-ken</p>","arenanet":false},{"pubDate":"2013-06-12T15:37:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Waypoints-API/2200638","author":"Polonium.4725","body":"\n<p>To improve the event API, it would be nice to know the closest Waypoint to the event.</p>\n<p>We would need a new API Waypoint_names, that gives the waypoint_id and the name (in the language passed as argument). And we would need a new waypoint_id in the event API that would link to the closest Waypoint.</p>\n<p>Events that move (like “escort a NPC”) would return the closest waypoint of their current position if the event is active and the closest one from the beggining if not.</p>\n<p>This API could also be used by the suggested Vendor API.</p>","arenanet":false}]}