{"title":"[API Suggestion] Node Locations","pubDate":"2013-06-04T09:16:46.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Node-Locations","comments":[{"pubDate":"2013-06-04T15:34:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Node-Locations/2153276","author":"Healix.5819","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on June 04 2013 02:44PM\"><a href=\"/forum/community/api/API-Suggestion-Node-Locations/2153001\">gotkitten ed.5318:</a></cite></div><div class=\"quotey\"><p>And the raw data from events isn’t useless to anyone besides devs?</p></div></blockquote>\n<p>I said the raw data (x,y,z coordinates) by itself would be useless to almost everyone. Specifically, only those that understand how the coordinates work in GW2 would be able to actually show you where on the map that point was and even then, they would have to have to know a starting point to work with. The only people that legitimately has that information is ArenaNet. They don’t give this data for events, and since unlike nodes they always occur in the same place, API users don’t have to figure it out.</p>\n<p>The example I gave is the location of an actual orichalcum node. Without any other information, you won’t be able to point it out on the map.</p>\n<p>So first, they would have to give you this information, which would be rather difficult to do since it would change based on what picture of the map you’re looking at and it’s not something they explain with words. Because of that, they would have to supply a picture to work with because you need to know the boundaries of the map. For example, I could tell you the coordinate 0,0,0 occurs at the direct center of the map, but without knowing the exact boundaries, you’re going to have to guess where the center is on the picture.</p>\n<p>Considering this, I doubt they’ll ever supply coordinates since they would also need to offer all that information and for every single map.</p>","arenanet":false},{"pubDate":"2013-06-04T14:44:22.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Node-Locations/2153001","author":"Odd Magnet.3970","body":"\n<p>what would be the difference between having<br>\na) a automatically update website showing the nodes<br>\nand<br>\nb) a manually updated website showing the nodes<br>\non a second monitor? I don’t see one, except that the later takes longer to get the most recent ones after an update</p>\n<p>@Healix:<br>\nAnd the raw data from events isn’t useless to anyone besides devs?<br>\nThe API is FOR Developers, not for the gamers.<br>\nBut if a dev could get that infos, he could make a website tracking the nodes.<br>\n(like gw2stuff, selecting server, map, node types and let them be displayed on a map on a second monitor)</p>\n<p>@Snowcub:<br>\nWhy’d that go against their rules? The nodes are random, but the reason (if there is one ) is already defeated since many servers already offer maps with node. Maybe not the exact postitions, but you don’t need the exact positions to find them anyway.<br>\nand for the bot part, it doesn’t make any difference if the botters take 10-20 minutes after each update to get the new locations or could get them directly</p>","arenanet":false},{"pubDate":"2013-06-04T13:44:37.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Node-Locations/2152688","author":"Rawrfaec.6412","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on June 04 2013 10:13AM\"><a href=\"/forum/community/api/API-Suggestion-Node-Locations/2151900\">Snowcub.3206:</a></cite></div><div class=\"quotey\"><p>Also you would make farming easy again for bots.</p></div></blockquote>\n<p>It wouldn’t affect bots (they teleport anyway) but on the other accounts you’re right. I essentially expect ArenaNet to not release enough information to construct a real-time map in a third-party application and will be disappointed if they do.</p>","arenanet":false},{"pubDate":"2013-06-04T10:13:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Node-Locations/2151900","author":"Snowcub.3206","body":"\n<p>I doubt they will introduce this, because it would go against their rule to give something thorugh the API that isnt apparent in-game. They made the nodes random for a reason, which the API would defeat. Also you would make farming easy again for bots.</p>","arenanet":false},{"pubDate":"2013-06-04T09:58:02.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Node-Locations/2151853","author":"Healix.5819","body":"\n<p>If such an API existed, the raw data would most likely be useless to almost everyone. The response would also be rather large, where querying an entire server would be about equal to pulling all items from the TP.</p>\n<p>Here’s an example node:</p>\n<blockquote><div class=\"quotey\"><pre><code>node\n{\n    map_id: 30,\n    node_id: 19701,\n    coords: { 19834.5, 10915.2, -901.512 },\n}</code></pre></div></blockquote>\n<p>This is an orichalcum node just south of the vendor near Jormag in Frostgorge. Without knowing how to map the coordinates however, the data is useless to you. To make it useful, they would first have to tell you how to map the coordinates along with providing additional data on that.</p>\n<p>Since the original extended experience, the pre-API project, was live maps, node data just might be an API option in the future. That said, I doubt they will since there are a lot of negatives to it, but the same can be said for events. It would certainly reduce the amount of work I still have to do though.</p>","arenanet":false},{"pubDate":"2013-06-04T09:16:46.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Node-Locations/2151730","author":"Odd Magnet.3970","body":"\n<p>Would be great if we could get an API for that.</p>\n<p>After each update the locations change and even though we do have some sites to track them (community based), not each server has such a site so many players always have to search on their own.<br>\nIf there’d be an API for that, every player can (if he wants) easily get all the locations of X (X = Ori, Omnom, etc..)</p>","arenanet":false}]}