{"title":"API that allows you to see Character","pubDate":"2015-08-28T02:23:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-that-allows-you-to-see-Character","comments":[{"pubDate":"2015-08-28T18:02:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-that-allows-you-to-see-Character/5427031","author":"Sol Solus.3167","body":"\n<p>All the models can be datamined from Gw2.dat, so what you’re asking for is already possible. There isn’t a need for an API to provide those large files.</p>\n<p><a href=\"https://www.youtube.com/watch?v=oPjYGw_k7h8&index=1&list=PLmLd4Sy0btZDuEqEaZA5Mo1cCeeoDmds2\">See that_shaman’s datamined model renders.</a></p>","arenanet":false},{"pubDate":"2015-08-28T05:03:13.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-that-allows-you-to-see-Character/5424992","author":"Eearslya.6309","body":"\n<p>Right now, the API can provide bank and inventory. Soon, it will provide equipped specializations/traits. The 3D model, however…It’s been discussed that we might get a static image of our character, like what we see on the character select screen, but I’m doubtful a full 3D model would be made available by the API.</p>","arenanet":false},{"pubDate":"2015-08-28T02:23:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-that-allows-you-to-see-Character/5424675","author":"Tyrantis.8640","body":"\n<p>I’m sure this has been brought up before but here is what I’d love out of an app. I am sure alot of us would love it too.</p>\n<ul>\n\t<li>I pretty much want to view my character, a 3d model with their equipment that they are wearing.</li>\n</ul>\n<ul>\n\t<li>I would like to see my build and traits. All items should allow hover over tips.</li>\n</ul>\n<ul>\n\t<li>Inventory tab displaying inventory and bank tab as well.</li>\n</ul>\n<p>I believe some of these are already possible with current APIs but I think that others couldn’t provide this.</p>\n<p>Also, I’m worried that for an app like this ANET would need to provide the models and all skins to be implemented into the app somehow.</p>\n<p>Knowing this concern how likely is my dream gw2 app ever to happen?</p>\n<p>I’m not saying ANet has to dev the app, it would be like it is currently but what is the likelihood of 3D models and such being able to be pulled via API?</p>\n<p>Thanks<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false}]}