{"title":"API Permission System","pubDate":"2015-10-26T02:40:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Permission-System","comments":[{"pubDate":"2015-10-26T18:05:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Permission-System/5663279","author":"Pat Cavit.9234","body":"\n<p>We were asked to discontinue OAuth2 due to phishing concerns. It won’t be coming back in the foreseeable future.</p>","arenanet":true},{"pubDate":"2015-10-26T12:57:55.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Permission-System/5661346","author":"I Am Dansker.7105","body":"\n<p>Funny you should mention OAuth<br>\nThis was originally how the authenticated API was accessed and it was amazing from a ease of use standpoint</p>\n<p>However ArenaNet didn’t want community websites to use it as a replacement for their own login system (like you can do with google, facebook, etc), so they unfortunately decided to switch to the system we have now.</p>\n<p>So the probably answer to your question is most likely no.</p>\n<p>I started a related topic <a href=\"https://forum-en.guildwars2.com/forum/community/api/API-Creation-Page-Input-Insertion/first#post5527857\">https://forum-en.guildwars2.com/forum/community/api/API-Creation-Page-Input-Insertion/first#post5527857</a> to this some time ago that would help reduce some of the steps a user has to go through, however it seems, at the moment, the devs see the added steps as a security feature rather than an annoyance (e.g. the user has to both name the key and select the permissions)</p>","arenanet":false},{"pubDate":"2015-10-26T02:40:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Permission-System/5658639","author":"Xellow.3589","body":"\n<p>Why don’t we have access to Oauth or a similar system for 3rd party apps requesting API permissions? I’d love to make an app that provides details of the users characters, stats, builds, etc., but asking each user to go to the Guild Wars site and setup an API key then enter it into the app isn’t very intuitive. Ideally the developer could create a single API key for their application with each user approving that keys permissions on initial access. Users could view what apps are currently approved on their account and choose to revoke access at anytime.</p>\n<p>Is there any intention to eventually move towards this kind of authentication / permission system? Right now the /characters endpoint feels extremely useless due to the hoops a normal user would have to jump through for an app to display their character data.</p>","arenanet":false}]}