{"title":"[API Suggestion] Map Coordinate System","pubDate":"2013-05-25T02:48:00.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Map-Coordinate-System","comments":[{"pubDate":"2013-05-26T19:07:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Map-Coordinate-System/2095651","author":"Primal Zed.9714","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 25 2013 02:30PM\"><a href=\"/forum/community/api/API-Suggestion-Map-Coordinate-System/2090251\">Dauni.8290:</a></cite></div><div class=\"quotey\"><p>This+Playerinformation API (+ x, y,y z pos of the player) – There is my Map on 2nd Monitor!<img src=\"/include/images/smilies/colondee.png\"></p></div></blockquote>\n<p>That sort of thing is the ultimate benefit of this, yes.  It’d be possible to have on this map everything that is on the map in-game (POIs, renown hearts, vendors) plus more besides (all events across the zone, gathering nodes, etc).  Other than player location and which POIs, etc have been completed by the character, all of this information can be included before they take the step into services using OAuth2.</p>\n<p>Of course, it wouldn’t be entirely live – it’d have to run with about a ~10 second refresh time (don’t want to overwhelm their services with constant requests by a large number of people), but that’d still be plenty sufficient.</p>","arenanet":false},{"pubDate":"2013-05-25T16:47:40.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Map-Coordinate-System/2090761","author":"Healix.5819","body":"\n<p>I’ve been working on a mapping project on and off as I get side tracked by other things for months. Coordinate tracking is one thing I did, so I have very accurate coordinates for everything I’ve added, including events. If I was full time working on it, it would have been done a few months ago and I would most likely have the best “active events” map available, since I also have data like how events operate and paths they take.</p>\n<p>My original goal was to create a map that you could use to find out how to get somewhere, since that was my original issue at the start of the game (finding a dungeon for the first time when you’ve never been to the surrounding zones and don’t know where the zone portals are can be quite difficult). As a feature, and due to coordinate tracking, I can calculate real paths you would use to walk somewhere.</p>\n<p>As of now, I’ve only fully mapped Frostgorge, Orr and Southsun and have mostly mapped Wayfarer and Snowden. It takes about 1-3 days for me to fully map a zone depending on it’s size. I also map all gathering nodes, which takes about another week, since I have to play through the zone over and over on different servers/resets. If they ever release an API for that, so much wasted effort.</p>\n<p>For game coordinates, they’re measured with what you see on tooltips for the range. Each zone starts with x,y,z 0 at the center of the zone’s region, where z 0 is sea level.</p>\n<p>Coordinate positioning for your party was an original function shown in the extended experience, so they might add it, but I kind of doubt it.</p>","arenanet":false},{"pubDate":"2013-05-25T14:30:26.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Map-Coordinate-System/2090251","author":"Dauni.8290","body":"\n<p>This+Playerinformation API (+ x, y,y z pos of the player) – There is my Map on 2nd Monitor!<img src=\"/include/images/smilies/colondee.png\"></p>","arenanet":false},{"pubDate":"2013-05-25T14:16:29.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Map-Coordinate-System/2090198","author":"FourthVariety.5463","body":"\n<p>You can use the Wiki to get a more specific location for each event and then combine it with their maps.</p>\n<p><a href=\"http://wiki.guildwars2.com/images/3/34/Malchor%27s_Leap_map.jpg\">http://wiki.guildwars2.com/images/3/34/Malchor%27s_Leap_map.jpg</a></p>\n<p>But that only gets you so far depending on what you are trying to do. I decided to solve that problem manually, feel free to pitch in, I only started today.</p>\n<p><a href=\"http://www.mediafire.com/download/ebe908e20rdneha/Gebiete+mit+Raster.zip\">http://www.mediafire.com/download/ebe908e20rdneha/Gebiete+mit+Raster.zip</a></p>","arenanet":false},{"pubDate":"2013-05-25T09:35:15.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Map-Coordinate-System/2089376","author":"Yoone.9461","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 25 2013 09:13AM\"><a href=\"/forum/community/api/API-Suggestion-Map-Coordinate-System/2089327\">zeeZ.5713:</a></cite></div><div class=\"quotey\"><p>And as a bonus, geotag screenshots<img src=\"/include/images/smilies/wink.png\"></p></div></blockquote>\n<p>I don’t think they will do that, but it would actually be really nice<img src=\"/include/images/smilies/smile.png\"></p>\n<p>Though once you have the coordinates, I think you can create your own screenshots by using gw2cartographers work! All their tiles are available on their github.</p>","arenanet":false},{"pubDate":"2013-05-25T09:13:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Map-Coordinate-System/2089327","author":"zeeZ.5713","body":"\n<p>And as a bonus, geotag screenshots<img src=\"/include/images/smilies/wink.png\"></p>","arenanet":false},{"pubDate":"2013-05-25T02:48:00.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Map-Coordinate-System/2088269","author":"Primal Zed.9714","body":"\n<p>I would like to see an official coordinate system to work with the maps.  This would be a huge boon not only to go with the events API, but also to provide a way to describe a precise location in the game for waypoints, points of interest, and so on (for things like the wiki and potentially for future APIs).</p>\n<p>(Might need a z-coordinate for map depth in addition to the obvious x and y coordinates.)</p>","arenanet":false}]}