{"title":"API Status","pubDate":"2016-06-23T14:29:04.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Status","comments":[{"pubDate":"2016-06-25T10:12:46.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Status/6219033","author":"Reincarnated.1754","body":"\n<p>Thank you very much for the information, It makes more sense to me now when looking on the Issues page<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2016-06-23T17:17:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Status/6216838","author":"Lawton Campbell.8517","body":"\n<p>The tags are basically for a kanban view that I use: <a href=\"https://waffle.io/arenanet/api-cdi\">waffle.io</a>.</p>\n<ul>\n\t<li>“ready” means that the issue has enough information to begin work on.</li>\n</ul>\n<ul>\n\t<li>“in progress” means that some work has been done on the issue. The ones that are there are mostly stalled.</li>\n</ul>\n<ul>\n\t<li>“needs deploy” means that the work is done, but pending either a game update or an API backend deploy. With some exceptions, an issue in the “needs deploy” state will be completed the release after the next release.</li>\n</ul>\n<p>The sticky is a reasonable idea; I’ll see about setting one up next week or so. For the most part, I rarely make backwards-incompatible changes — the goal is to keep applications working without needing any changes to their code.</p>","arenanet":true},{"pubDate":"2016-06-23T14:29:05.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Status/6216638","author":"Reincarnated.1754","body":"\n<p>You can call me a moron if you like, I don’t mind, I am with some things<img src=\"/include/images/smilies/smile.png\"></p>\n<p>Basically I am looking to see when changes have been made to the API’s, what additions, corrections have been made?</p>\n<p>I look on: <a href=\"https://github.com/arenanet/api-cdi/issues\">api-cdi/issues</a> <br>\nan I see labels on the each issue.</p>\n<p>Could you give a bit more info on what the labels mean?<br>\nFor example does “ready” or “needs deploy” mean they are going to be active the next time we have a game update?</p>\n<p>It there any where that indicates when something will be active?</p>\n<p>Perhaps we could a Sticky that is updated when an API is added, updated, is imminent.<br>\nSomething to say, now’s the time for you to go and check your code, you can do this now guys, go to it.<img src=\"/include/images/smilies/smile.png\"><br>\n <br>\nA place to look 1st to see the status of this exhalent work you are doing<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false}]}