{"title":"Application development","pubDate":"2014-04-15T14:41:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-development","comments":[{"pubDate":"2014-04-15T20:33:04.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-development/3899994","author":"StevenL.3761","body":"\n<p>Well the owners might have requested explicit permission to use these icons. Or the use of these icons might be defended as being “fair use” (see <a href=\"https://en.wikipedia.org/wiki/Fair_use\">wikipedia</a>).</p>\n<p>There’s also the <a href=\"https://www.guildwars2.com/en/media/asset-kit/\">Guild Wars 2 Asset Kit</a>. As far as I know, that’s the only source of media for which you have explicit permission to use it in your own product.</p>","arenanet":false},{"pubDate":"2014-04-15T16:45:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-development/3899033","author":"Kurotsuki.5364","body":"\n<p>Unauthorized use of graphics…would that include Professions, items, skills,… icons? Cause a lot of apps and websites use those.</p>","arenanet":false},{"pubDate":"2014-04-15T16:02:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-development/3898762","author":"Kurotsuki.5364","body":"\n<p>Gonna take a good look at all this. Didn’t have in mind to use the API though.</p>\n<p>Thank you for your answer.</p>","arenanet":false},{"pubDate":"2014-04-15T15:51:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-development/3898711","author":"StevenL.3761","body":"\n<p>From the wiki:</p>\n<p><em>These APIs are wholly owned by ArenaNet, LLC (“ArenaNet”). Any use of the APIs must comply with the Website Terms of Use and Content Terms of Use, however you may use the APIs to make commercial products so long as they are otherwise compliant and do not compete with ArenaNet. ArenaNet may revoke your right to use the APIs at any time. In addition, ArenaNet may create and/or amend any terms or conditions applicable to the APIs or their use at any time and from time to time. You understand and agree that ArenaNet is in the process of developing a full license agreement for these APIs and ArenaNet will publish it when it is complete. Your continued use of the APIs constitutes acceptance of the full license agreement and any related terms or conditions when they are posted.</em></p>\n<p>Regardless, you shouldn’t violate copyright laws (*) no matter whether you are getting paid.</p>\n<p>(*): unauthorized use of graphics, music tracks, …</p>\n<p>With all that in mind, my personal advice for someone who’s new to programming is to not turn greedy. Build an app for the fun of it, and let it be a learning experience. That’s worth so much more than the couple of cents you’ll make by charging for your app.</p>\n<p>Perhaps you could mention that you accept Black Lion Trading Company gifts somewhere in the “About” page of your app. That way, you indirectly support Anet.</p>","arenanet":false},{"pubDate":"2014-04-15T14:41:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-development/3898356","author":"Kurotsuki.5364","body":"\n<p>Hello everyone, I’m studying computer sciences (so programming of course among others) and I thought about an app I could create (for Android devices most probably) related to the game.</p>\n<p>Now the question: is it possible to make a paying app or does it have to be free or have a donation option? Could making a paying app cause some problems with the game copyrights or any of that stuff?</p>\n<p>Thank you</p>","arenanet":false}]}