{"title":"Automated TODO list","pubDate":"2017-08-19T10:33:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Automated-TODO-list","comments":[{"pubDate":"2017-08-19T10:33:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Automated-TODO-list/6706967","author":"Killerassel.2197","body":"\n<p>Hi.</p>\n<p>I’m thinking of creating a checklist that gets automatically updated (crossed out) using data from the API. But I quickly noticed that most of the needed data seems to be unavailable.</p>\n<p>My entries on the list fall into a few categories:</p>\n<ul>\n\t<li>daily achievements<br>\n  * general (any 3 for 2 gold) -&gt; there’s already a ticket for that<br>\n  * sometimes fractals -&gt; there’s a ticket for that, too<br>\n  * a selection of LS3 dailies -&gt; i hope above tickets solve this, too</li>\n\t<li>harvesting<br>\n  * 2 guild halls<br>\n  * home instance nodes<br>\n  * certain fixed nodes or fields, e.g. rich platinum in Rata Pten or seaweed in Ember Bay</li>\n\t<li>specific world bosses, e.g. Wyvern Matriarch in Verdant Brink</li>\n\t<li>black lion key for level 10 story (weekly reset)</li>\n</ul>\n<p>How much of these information could realistically become part of the API? Are there any workarounds or data that indirectly give me needed information?</p>\n<p>Most of fixed nodes farming happens on characters parked there. So a last logged in timestamp per character could be a workaround. On the other hand I have a character parked at a T5 wood farm spot in Orr. I think respawn times there are per map instance and thus never going to be available from the API.</p>\n<p>I wouldn’t even necessarily need a catalog of all possibilities in the API for my needs. After seeing once that character X has harvested rich node 42 I’d know to check (X, 42). Likewise observing the list of actually harvested guild and home instance nodes would be good enough. I’m not sure if it makes a difference that rich nodes are per character and guild hall / home instance nodes are per account.</p>\n<p>A boss endpoint could be extended to include name, spawn times and position, but as with nodes just knowing an unresolvable ID number is enough to check.</p>","arenanet":false}]}