{"title":"Challenge - crafting profits calculation","pubDate":"2015-02-28T05:15:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Challenge-crafting-profits-calculation","comments":[{"pubDate":"2015-03-01T22:08:45.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Challenge-crafting-profits-calculation/4840232","author":"DarkSpirit.7046","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on March 01 2015 02:21PM\"><a href=\"/forum/community/api/Challenge-crafting-profits-calculation/4839425\">StevenL.3761:</a></cite></div><div class=\"quotey\"><p>I think it would be more interesting if you could punch in the number of items that you are planning to craft. It should then give you detailed instructions and statistics for the first, the second, the third,… all the way to the last item. If instructions and statistics remain the same for several items in a row, then they should be grouped together.</p>\n<p>For bonus point: plot the overall returns on a graph</p></div></blockquote>\n<p>Sure, we can do all that for bonus points.  We can input the number of items to craft and have the profits returned.</p>\n<p>This is an interesting problem for recursion and gives a much more useful result, if your goal is to maximize profits through crafting, than the single min cost tree from gw2spidy, which strictly speaking, only applies to crafting 1 item.</p>","arenanet":false},{"pubDate":"2015-03-01T14:21:44.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Challenge-crafting-profits-calculation/4839425","author":"StevenL.3761","body":"\n<p>I think it would be more interesting if you could punch in the number of items that you are planning to craft. It should then give you detailed instructions and statistics for the first, the second, the third,… all the way to the last item. If instructions and statistics remain the same for several items in a row, then they should be grouped together.</p>\n<p>For bonus point: plot the overall returns on a graph</p>","arenanet":false},{"pubDate":"2015-03-01T00:04:16.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Challenge-crafting-profits-calculation/4838285","author":"DarkSpirit.7046","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 28 2015 12:39PM\"><a href=\"/forum/community/api/Challenge-crafting-profits-calculation/4837007\">quenoz.3859:</a></cite></div><div class=\"quotey\"><p>it has been done more effectively by someone, yup.</p>\n<p><a href=\"http://www.gw2craftgold.com/\">http://www.gw2craftgold.com/</a></p></div></blockquote>\n<p>Not really.</p>\n<p>I don’t see a a minimum cost tree on how to craft an item (assuming it is cheaper to craft than to buy).  Which ingredients should you buy and which ingredients should you craft?  If buy, then how many ingredients can you buy at such a price?  Which would determine how many final items you can craft at such a profit.</p>","arenanet":false},{"pubDate":"2015-02-28T12:39:22.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Challenge-crafting-profits-calculation/4837007","author":"quenoz.3859","body":"\n<p>it has been done more effectively by someone, yup.</p>\n<p><a href=\"http://www.gw2craftgold.com/\">http://www.gw2craftgold.com/</a></p>","arenanet":false},{"pubDate":"2015-02-28T05:15:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Challenge-crafting-profits-calculation/4836550","author":"DarkSpirit.7046","body":"\n<p>I admit, I was first inspired by what gw2spidy has in their website.  For example:</p>\n<p><a href=\"http://www.gw2spidy.com/recipe/9269\">http://www.gw2spidy.com/recipe/9269</a></p>\n<p>There are problems with that calculation though:</p>\n<p>1.  How updated are the prices?  Prices change all the time.  What can be profitable to craft one minute may not be profitable anymore in the next minute.</p>\n<p>2.  Those recipes do not include mystic forge recipes.  For example, certain ingredients can be obtained more cheaply through the MF than the TP.</p>\n<p>3.  That most-profitable-path-to-craft tree is only guaranteed good for ONE craft.  It doesn’t tell you how many of its ingredients can be bought at those prices by looking at the sale offer queue or how many intermediate ingredient or final product you can craft and still remain profitable.</p>\n<p>If you want to do this right, the algorithm would have to be smarter than what they have in gw2spidy.  Some less profitable items may turn out to be even more profitable considering the total amount of offers that are higher than the crafting cost.  And how many you can actually craft based on the recommended crafting tree would depends on the number of ingredients you can get at those prices.</p>\n<p>Am I the only one that finds this problem interesting?   Has anyone wrote an algorithm to come up with profitable crafting trees for each stage quantity of output to sell to offer prices and find out how many you can actually craft in order to be profitable and total profit?</p>\n<p>I am thinking what a nice interview programming question this would be, if I ever do get a chance to be an interviewer again next time.  Write a recursive algorithm to print out most-profitable-crafting tree and calculate total profit from offer prices.  Am I evil?</p>","arenanet":false}]}