{"title":"Chat Link 0x03 Codes","pubDate":"2013-09-17T21:59:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Chat-Link-0x03-Codes","comments":[{"pubDate":"2013-09-18T12:52:27.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Chat-Link-0x03-Codes/2864292","author":"Dr Ishmael.9685","body":"\n<p>It was the 0×02 chat codes (for items) that were used for text coloring, not 0×03.  I didn’t notice the error in your thread title until just now.</p>\n<p>They modified the functionality of the 0×03 (dialogue) codes a few months ago.  Instead of being shown in the chat box, they now only make the dialogue bubble appear over your character (see the talk page of the article you linked).</p>","arenanet":false},{"pubDate":"2013-09-18T09:42:36.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Chat-Link-0x03-Codes/2863395","author":"AdelphiA.9287","body":"\n<p>So, basically, all the information regarding chat link codes on the Wiki is now obsolete/incorrect? I mean, I can’t get any of these to work either in Guild Chat anymore… <a href=\"http://wiki.guildwars2.com/wiki/Chat_link_format/0x03_codes\">http://wiki.guildwars2.com/wiki/Chat_link_format/0x03_codes</a></p>\n<p>Mine weren’t so much “adverts” as “informative” as they were only sent to Guild Chat (well, occasionally sent to local) but it was nice to see PRE-EVENT in yellow and ACTIVE in green but now I guess just plain old chat colour.</p>","arenanet":false},{"pubDate":"2013-09-18T00:28:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Chat-Link-0x03-Codes/2860158","author":"Dr Ishmael.9685","body":"\n<p>They altered the item links so that they no longer include the encryption key within them.  This is what allowed for the links to be corrupted in the past, so without that part of the link, the days of candy-colored guild adverts are finally over!</p>","arenanet":false},{"pubDate":"2013-09-17T21:59:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Chat-Link-0x03-Codes/2858681","author":"AdelphiA.9287","body":"\n<p>Since todays patch (17th Sept), it appears the colour codes no longer work as they did. Has anyone come across an alternate method yet or deciphered how the codes have changed? If not, I guess I’ll have to revert to plain old gold text in guild chat to make my announcements of events.</p>","arenanet":false}]}