{"title":"Confusion about Confusion","pubDate":"2015-10-07T17:27:08.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Confusion-about-Confusion","comments":[{"pubDate":"2015-10-07T22:10:28.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Confusion-about-Confusion/5585623","author":"Cookiezz.5261","body":"\n<p>Thanks for the reply’s! I can handle the parsing on my end, I just wanted to make sure I wasn’t doing more work than I had to. One day hopefully it’ll get cleaned up.</p>\n<p>Thanks again!</p>","arenanet":false},{"pubDate":"2015-10-07T20:41:15.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Confusion-about-Confusion/5585292","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on October 07 2015 07:18PM\"><a href=\"/forum/community/api/Confusion-about-Confusion/5584950\">Eearslya.6309:</a></cite></div><div class=\"quotey\"><p>All this data is simply what is used to render the tooltip, not actually what goes in to calculating the skill.</p></div></blockquote>\n<p>Pretty much this. That’s the closest we have to a normalized form for skill details. Unfortunately it isn’t very normalized at all — in the stun case it does the “right” thing in the primary use-case and displays a stun icon with the text “Stun” and a duration.</p>\n<p>It’s not ideal for machine-readability, but it’s the best thing we have at the moment.</p>","arenanet":true},{"pubDate":"2015-10-07T19:18:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Confusion-about-Confusion/5584950","author":"Eearslya.6309","body":"\n<p>The traits/skills API is..unintuitive, and the devs have admitted this. It was never structured to be crawled through programmatically. All this data is simply what is used to render the tooltip, not actually what goes in to calculating the skill.</p>\n<p>However, in those two cases I’d simply check the <strong>status</strong> field for Buff/Condition, and the <strong>text</strong> field for Stun/Daze. It may not work 100% of the time unfortunately, but there’s really no better option right now.</p>","arenanet":false},{"pubDate":"2015-10-07T17:27:08.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Confusion-about-Confusion/5584525","author":"Cookiezz.5261","body":"\n<p>I was looking at the trait “Mistrust” (<a href=\"https://api.guildwars2.com/v2/traits/1950\">API Link</a>) for Mesmers as an example earlier, just playing around with the API, and the Confusion portion … confused me.</p>\n<p>It refers to it (Confusion) as a type of “Buff”, is that correct? Also the description doesn’t reflect that it does damage over time now.</p>\n<p>I then switched to Blinding Dissipation (<a href=\"https://api.guildwars2.com/v2/traits/1889\">API Link</a>) since it applies Blind. This one also came back as a type of Buff.</p>\n<p>I then wanted to look for CC effects so I used Confounding Suggestions (<a href=\"https://api.guildwars2.com/v2/traits/686\">API Link</a>) for the daze, which is defined as a “Time” type.</p>\n<p>I had hoped to look for conditions (among other things) in the traits, however it does not appear the Type column is what I had expected it to be. Is this to be expected? I figured I would ask before I start building a dictionary to define conditions / buffs / CC / etc.</p>\n<p>Thanks!</p>","arenanet":false}]}