{"title":"Container Drops (Not Rates)","pubDate":"2015-04-18T14:19:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Container-Drops-Not-Rates","comments":[{"pubDate":"2015-04-22T22:10:27.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Container-Drops-Not-Rates/4994347","author":"Illconceived Was Na.9781","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on April 22 2015 06:56PM\"><a href=\"/forum/community/api/Container-Drops-Not-Rates/4993941\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p>The rule-of-thumb I use for determining on whether an API would be appropriate is “is this information already available in-game?”. This isn’t really a hard-and-fast rule, but for the time being, partial drop tables aren’t something I think we can expose.</p></div></blockquote>\n<p>From a player’s perspective, it’s “in the game” as much as whether an item can be used in pvp/wvw or salvageable (these things aren’t known until you ‘test’ the item), but I take your point.</p>\n<p>Thanks for responding so quickly (even if I would have preferred a different answer).</p>","arenanet":false},{"pubDate":"2015-04-22T18:56:00.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Container-Drops-Not-Rates/4993941","author":"Lawton Campbell.8517","body":"\n<p>The rule-of-thumb I use for determining on whether an API would be appropriate is “is this information already available in-game?”. This isn’t really a hard-and-fast rule, but for the time being, partial drop tables aren’t something I think we can expose.</p>","arenanet":true},{"pubDate":"2015-04-22T00:48:49.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Container-Drops-Not-Rates/4992016","author":"Illconceived Was Na.9781","body":"\n<p>The exploration is in finding the drop rates. Just discovering what might drop doesn’t provide much value.</p>\n<p>Further, I think this would be consistent with ANet’s philosophy of removing PvP from open world content; free markets are only free if everyone has access to the same information. The spread of that information is hampered by the current system, since there are sometimes financial incentives to hoarding details.</p>","arenanet":false},{"pubDate":"2015-04-18T15:52:49.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Container-Drops-Not-Rates/4984279","author":"Thuron.5648","body":"\n<p>I think adding such info would have quite a negative influence on the exploration in the game, similar to a different discussion about the mystic forge recipes and the possibility of having an API for retrieving them.</p>","arenanet":false},{"pubDate":"2015-04-18T14:19:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Container-Drops-Not-Rates/4984138","author":"Illconceived Was Na.9781","body":"\n<p>I am hoping that the API will eventually identify the contents of containers in the game. Containers are those items which, when ‘used’, drop something else. For example, Trick or Treat bags, various champ bags, etc.</p>\n<p>The wiki gurus have developed a number of methods to collect drop rate data, but they are usually hampered by not being able to event identify the possible drops. For example, many of the articles about limited-edition dye packs (e.g. Taimi’s dyes) still don’t have confirmation of the 25 colors that could drop from each. This makes it difficult to crowd source data collection.</p>\n<p>It also makes it harder for the average player to make any attempt at deciding whether it’s better to open, sell, or save the container.</p>\n<p>I can see potential problems with containers that have generic drops, such as Gift of Mawdrey, Gift of Generosity, or Bag of Gear — each of these has 100s or 1,000s of potential drops, that might even change as new items are added to the game. However, most containers have a defined set of potential drops, such as Trick or Treat bags, Wintersday gifts, etc.</p>\n<p>tl;dr recommend adding a mechanism that the API can list the items that might drop from any container.</p>","arenanet":false}]}