{"title":"Development Related - NonAPI","pubDate":"2014-08-10T05:10:08.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Development-Related-NonAPI","comments":[{"pubDate":"2014-08-10T10:12:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Development-Related-NonAPI/4279625","author":"StevenL.3761","body":"\n<p>I think this would be categorized as an accessibility feature, similar to screen narrators or magnifiers. So it should be fine.</p>","arenanet":false},{"pubDate":"2014-08-10T05:10:09.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Development-Related-NonAPI/4279280","author":"Prometheus.6781","body":"\n<p>Couldn’t find the best place to ask this really.<br>\nI’d like some clarification on what is allowed with the game.</p>\n<p>My Guild has recently moved to a German server to get better matchups during WvW, and being English speakers, communication is now not ideal (but the gameplay is better<img src=\"/include/images/smilies/smile.png\"> )</p>\n<p>I have just (past 30 minutes) thrown together a pretty simply application in C# which Translates the text via google translate, Sets it as the current clipboard text entry, then PInvokes the C++ postMessage class to auto post this into the chat box in the game.</p>\n<p>I’d like to know if this is allowed.<br>\nThe last thing I want is for my account to be banned as I plan on using this next week in map chat.</p>\n<p>There are 3 actions, Enter Key press, Control + V Paste, And Enter Key Press.</p>\n<p>It gives a player no extra advantage over another, just makes it faster to communicate without having to alt tab / copy and paste of a second screen.</p>\n<p>The Source is available here: <a href=\"https://github.com/prom3theu5/GW2Translator/tree/master/Translator\">https://github.com/prom3theu5/GW2Translator/tree/master/Translator</a></p>\n<p>Also, I have attached the keypress, mainwindow and translation classes to this post.<br>\nThanks in advanced.</p>","arenanet":false}]}