{"title":"event_details.json documentation","pubDate":"2014-01-17T20:12:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/event-details-json-documentation","comments":[{"pubDate":"2014-01-18T13:08:02.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/event-details-json-documentation/3513803","author":"Kegsay.7068","body":"\n<p>The z-axis measurements would be more useful if your projections were on a 3d map, but in all probability it isn’t. You can only partly represent depth on the current map via the “floor” of the map. You could potentially work out the z-value of each floor (e.g. -1500 to -500 for floor 3, -500 to +500 for floor 2) and then correctly display the events which are designed to still be visible on different floors. Of course, you have to be careful with this because AN seem to use some floors to mean completely different maps.</p>\n<p>For the most part though, this is overly complex for extremely little gain, and it’s far easier to just ignore the concept of floors / z values given in the response.</p>","arenanet":false},{"pubDate":"2014-01-18T12:28:02.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/event-details-json-documentation/3513697","author":"StevenL.3761","body":"\n<p>I still don’t understand what’s the significance of the z-axis in relation to a flat world map. Am I missing the point, or does it have other uses?</p>","arenanet":false},{"pubDate":"2014-01-18T01:19:10.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/event-details-json-documentation/3511776","author":"Kegsay.7068","body":"\n<p>I believe they are used to show you the area you must be inside in order for the event to display on screen. They are formed as 3D shapes (which I guess you could maybe utilise the z-axis for checking if the event is visible on multiple floors?).</p>\n<p>From what I can see:<br>\ntype = a hint on how to generate the the 3d box<br>\ncenter = the center of the event as [x, y, z]<br>\nradius = how far out from the center it goes (sphere/cylin only)<br>\nheight = z length of the event, can probably be ignored if you don’t care about depth, though bear in mind this is the height wrt the center z coord.<br>\nz-range = the literal z-min and z-max coords as [min, max]<br>\npoints = a series of xy coords which make a polygon, as [x, y]<br>\nrotation = No clue, as I have no idea on what axis it is rotated around (which I assume it must be axis rotated else a rotation key for a sphere is meaningless)</p>\n<p>Basically, if you’re just projecting this onto a 2d map, you can probably get away with:<br>\nif sphere or cyl then:<br>\n  event range is a circle around key ‘center’ with radius ‘radius’.<br>\nelse if polygon then:<br>\n  join the dots on the list of ‘points’ and be done with it.</p>\n<p>Hope this helps.</p>","arenanet":false},{"pubDate":"2014-01-17T20:12:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/event-details-json-documentation/3509954","author":"StevenL.3761","body":"\n<p>Hi there</p>\n<p>Generally speaking, I’m pretty happy with the API documentation. But what is going on with the <a href=\"http://wiki.guildwars2.com/wiki/API:1/event_details\">event_details</a> page? The documentation cuts off right in the middle of the interesting part.</p>\n<p>Can someone please explain what the different types of <em>location</em> object are for? Perhaps with some (C#) code samples of what the entities should look like?</p>\n<p>Thanks!</p>","arenanet":false}]}