{"title":"External Map using Mumble Link[BETA]","pubDate":"2014-03-01T21:33:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/External-Map-using-Mumble-Link-BETA","comments":[{"pubDate":"2017-01-30T10:26:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/External-Map-using-Mumble-Link-BETA/6478630","author":"ProperDave.7425","body":"\n<p>Shameless opportunistic plug time, but if you want a working MumbleLink mapping tool, I’ve had Plotty online for over a year and it does just that ~ you can use my mapping server on <a href=\"http://gw2maps.com\">http://gw2maps.com</a> or have Plotty target your own mapping server by changing the program settings.<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2017-01-29T20:42:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/External-Map-using-Mumble-Link-BETA/6478065","author":"SlippyCheeze.5483","body":"\n<p>FWIW, this is the same approach used by the gw2timer.com overlay, and that works quite well.<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2017-01-29T15:04:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/External-Map-using-Mumble-Link-BETA/6477797","author":"Lucas Broenner.1835","body":"\n<p>I dont know it this is still vialble or if you have moved on from this, and tbh it seams pretty dead anyway (the download link itself is for sale, but the paste still seems to work) but since this code is still working i’d like to ask some questions:</p>\n<p>- there is an unused object: ‘JObject o = JObject.Parse(data);’ what was the intention for that?</p>\n<p>- GlobalVars.CurrentMap is never changed, what was the intention for that?</p>\n<p>- why use pastebin (ever heard of github xD), and why only link the form1.cs? ppl who are not used to visual studio cant do anything without the other files ://</p>\n<p>but all in all not too bad of a code snippet, unfortunatly the “<a href=\"http://mshelley.net/gw2\">http://mshelley.net/gw2</a>” website is down so i cant say anything bout that</p>\n<p>and as a final note … nice one with the :1337 unfortunatly i already have a webserver running on that port xD</p>\n<p>oh… and sorry for al the typos and other mistakes ^^</p>","arenanet":false},{"pubDate":"2014-03-01T21:33:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/External-Map-using-Mumble-Link-BETA/3704230","author":"Retardeted.9315","body":"\n<p>Hi everyone,</p>\n<p>I’ve recently been working on a C# application to track user position on an external map on a website using the Mumble Link API. I mainly made it for myself to help with world completion by keeping my map up and showing me everywhere I need to go, as well as where I’ve been. I’ve got it running nicely for myself, but I need testers to help me with it to try and release it to public (if it’s good enough)</p>\n<p>It basically takes the idea from <a href=\"https://github.com/Blaaguuu/GW2Link\">Gw2Link</a> and uses C# instead. It also improves it by adding avatar and camera rotation positioning, as well as player trailing.</p>\n<p>This works by hooking into the Mumble Link coordinate memory file and converts it to continent coordinates. The Gw2MappingLink program runs a local webserver which posts that position information in JSON format. Then i grab that information in Javascript from the website by referencing the local JSON from the link program, and plotting those coordinates on the map.</p>\n<p>I would extremely appreciate anyone who would be willing to test this with me. I’ve read this forum a billion times and really would love to start getting more into development.Thanks a lot.</p>\n<p>Site: <a href=\"http://mshelley.net/gw2\"></a><a href=\"http://mshelley.net/gw2\">http://mshelley.net/gw2</a><br>\n<a href=\"http://mshelley.net/gw2/gw2mappinglink.zip\">Gw2MappingLink Download</a></p>\n<p><a href=\"http://pastebin.com/ALhcnNJR\">Source</a><br>\nThis is one of my first ‘big’ projects in C#, so I know my code is messy and not best practices (too many global  variables for sure)…any constructive criticism on how to improve it would be awesome!</p>\n<p>To use this just open up and log into a map in gw2, open the Gw2MappingLink program, and launch the website.</p>\n<p>Also, your browser my flag it as dangerous (the .zip)…I assume that’s because I haven’t yet signed it with an EV or CA certificate? Anyone else have any experience with that and SmartScreen? If you’re still worried about it I can provide the full package so you can compile it yourself.</p>","arenanet":false}]}