{"title":"Getting minimal character data","pubDate":"2016-05-01T00:43:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Getting-minimal-character-data","comments":[{"pubDate":"2016-05-02T20:36:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Getting-minimal-character-data/6133893","author":"JaxomNC.5381","body":"\n<p>Thanks, it makes more sense that for displaying things such as what shows in the attached image we do not need the full character data (here only 9 profession are showing but the amount of extra data would be quite large for accounts with 20+ characters).</p>","arenanet":false},{"pubDate":"2016-05-02T17:26:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Getting-minimal-character-data/6133561","author":"Lawton Campbell.8517","body":"\n<p>Adding the missing subendpoints seems reasonable; added a <a href=\"https://github.com/arenanet/api-cdi/issues/301\">tracking issue</a>.</p>\n<p>Specialization icons that override the profession icon are in <a href=\"https://api.guildwars2.com/v2/specializations/27\">/v2/specializations</a> for ease-of-use (and the default profession icons are in <a href=\"https://api.guildwars2.com/v2/professions/Guardian\">/v2/professions</a>). Made a bit more sense to me to do it that way.</p>","arenanet":true},{"pubDate":"2016-05-01T00:43:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Getting-minimal-character-data/6130824","author":"JaxomNC.5381","body":"\n<p>I think we’ve reached the point where the character endpoint is way more too bloated with features than the similar other endpoints (ie: account or guild). Here we get everything cramed into 1 single huge object (equipment, inventory, specilizations, crafting, recipes and in the future skills, etc.). Part of those can be quering using separate sub-endpoints, parts cannot (unless the wiki is missing some info) and there is no way to get only the core data without having the addional info. Also the more permission your appkey gets the more heavy this objects becomes as you get more and more info…<br>\nIf we ever get the point where we have portrait or 3D model and texture it’ll get even worse.</p>\n<p>There should be a way to retrieve a ligther version of the character that only contains the “core” data (profession, sex, age, level, etc.) without retrieving all the rest. For example if I want to display a character in a list or a drop down box I would usually only need those base info to get some rich decoration. Additional info (ie: inventory content) can be query using the sub-endpoint when switching to the next screen.<br>\nSo the endpoint should have an option or a sub-end point whihc allow you get only the core data.</p>\n<p>Also even though it’s depending on the gamemode; there is currently no direct/easy way to retrieve a specialization (ie : dh) without going through both the character’s specialization and then querying the global specialization endpoint. It would be easier to display the DragonHunter icon/tag on my character instead of the Guardian one if the specialization of the character would somehow return an enum value similar to the profession’s.</p>\n<p>PS: also specialization and other HoT icons still missing from v2/files :P</p>","arenanet":false}]}