{"title":"Guaranteed Wardrobe Unlock content manifest","pubDate":"2016-11-05T05:26:36.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest","comments":[{"pubDate":"2016-11-12T01:32:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6397527","author":"Immortius.4537","body":"\n<p>Mail Carrier, Outfit and Glider items ids have been added to the file now. The content listing is now complete.</p>\n<p>I will probably put up source code in a little for anyone interested, just need to do a little more tidy up.</p>","arenanet":false},{"pubDate":"2016-11-11T03:09:16.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6396590","author":"Immortius.4537","body":"\n<p>The question was more whether it was possible to work out the contents by image matching, not whether you can get them.</p>\n<p>I’ve added dyes to the content file now. That completes all the “useful” information that can be checked against account unlocks via the api. I could still match the remaining content against items, but it isn’t as useful for that usage.</p>","arenanet":false},{"pubDate":"2016-11-11T02:07:47.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6396553","author":"Mystic.5934","body":"\n<p>I got a mini unlocked (some random masterwork, worth about 1g), so those are definitely possible</p>","arenanet":false},{"pubDate":"2016-11-10T08:10:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6395788","author":"Immortius.4537","body":"\n<p>That is somewhat true except (a) I’ld still have to write something to crawl the wiki – I am not going to gather ids by hand (b) it has inaccuracies and simplifications and © it leaves updated information to a manual, potentially erroneous and relatively slow human process.</p>\n<p>An example of an inaccuracy: did you know only the aquatic and staff skins of the wolfborn set are available from the guaranteed wardrobe unlock? The wiki just lists the Wolfborn weapon set, which could result in someone wasting karma purchasing terrestrial Wolfborn weapon skins.</p>\n<p>Yes, I know, I can add that information to the wiki, but it is laborious manually checking every entry in the Wardrobe Unlock by hand and entering them by hand.  Which explains why someone just linked to whole armor and weapon sets in the first place.</p>\n<p>On the contrary, at this point all I need to do to get an up-to-date set of the contents of the Wardrobe Unlock is to take screenshots scrolling down the preview panel, run a script to crop the screenshots to the panel, split the screenshots by content, and then run the main generation code to take care of the rest, including reporting anything requiring manual attention such as unmatched icons.</p>\n<p>Perhaps the wiki updaters could use the results to generate content information next time around.</p>\n<p>… Admittedly, I also just wanted to see if I could. Programming something to match up images was an interesting challenge.</p>\n<p>:)</p>\n<p>Yeah, there are some very odd inclusions and exclusions in the possible unlock list. Some of the weapon skin lists are very spotty, like the Wolfborn set. There are no Dark Steel/Elder Wood/Mirthil/Hard Wood crafted weapon skins for no discernible reason. Cultural armor isn’t, but perhaps understandable. The inclusion of the Clockwork Mossheart is bizarre given that it is an achievement award.</p>","arenanet":false},{"pubDate":"2016-11-10T06:53:26.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6395767","author":"Konig Des Todes.2086","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on November 05 2016 05:26AM\"><a href=\"/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6390812\">Immortius.4537:</a></cite></div><div class=\"quotey\"><p><em>How this list was produced</em></p>\n<p>I’ve written some scripts that compare screenshots of the preview panel to skin icons retrieved from the API in order to create a mapping, and then manually addressed the problem cases (skins which share icons and duplicate skin icons mostly).</p></div></blockquote>\n<p>Or you can just go <a href=\"https://wiki.guildwars2.com/wiki/Guaranteed_Wardrobe_Unlock\">onto the wiki,</a> where I and others added all unlocks from a brand new F2P account (which, yes, showed gliders too). Which was determined by scrolling over the icon, thus getting the name and icon (rarely the name of the skin in the unlock did not match the item that unlocks it), and you could just pull <em>those</em> API ids. (armor/weapons may still be incomplete – I never got to that but I think others did and just forgot to remove the stub tag?)</p>\n<p>:)</p>\n<p>Not all skins/minis/gliders/outfits can be discovered via the guaranteed unlock, interestingly. And that’s ignoring the exotic/ascended/legendary skins.</p>\n<p>For example, no Hexed Outfit, but there’s there Royal Guard Outfit (which was meant to be for only owners of the game prior to HoT’s pre-release sale). And no 2015 Halloween minis are in there, despite being from pre-Sept 2016.</p>","arenanet":false},{"pubDate":"2016-11-08T08:10:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6393670","author":"Immortius.4537","body":"\n<p>Update: minis and finishers are now included, with the exception of the Mini Mushroom Stomper as it is not currently listed in the API, and thus doesn’t have a discoverable mini id that I am aware.</p>","arenanet":false},{"pubDate":"2016-11-07T13:15:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6392819","author":"Psientist.6437","body":"\n<p>Forgive me if this is the wrong thread for this, I am not a programmer.</p>\n<p>The other day I started thinking about what tools would help players maximize the value of the Guaranteed Wardrobe Unlock. What you are trying to build sounds like the first needed step. Keep up the effort and don’t doubt the value to players of such an app.</p>\n<p>edit:  Arenanet studio, a tool that helps players maximize the value of the Guaranteed Wardrobe Unlock would also be a powerful economic driver, since the only way to maximize value is to produce.</p>","arenanet":false},{"pubDate":"2016-11-06T02:13:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6391563","author":"Malediktus.3740","body":"\n<p>Well good luck, that seems like more effort than it is worth (to me). But I am pretty sure outfits, gliders and mail carriers are also in the API, so there should be nothing stopping you from completing your goal.</p>","arenanet":false},{"pubDate":"2016-11-05T23:07:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6391466","author":"Immortius.4537","body":"\n<p>Easier? Sure. Ideal? Definitely.<br>\nQuicker? No. Dependable? No.</p>\n<p>If we can have an API for it – great! But there is no guarantee that if the API will ever be available, or when.  So rather than depending on busy ANet devs (who probably have more important things to do, like fixing the bank api) if I can set up something to do this now I think it is good to do so.</p>\n<p>If the content does change, I can just take screenshots again and rerun my code, and get an updated list.</p>\n<p>Also I would kind of like to see Wardrobe Unlocker related apps now, not in an eventual future.<img src=\"/include/images/smilies/smile.png\"> Will make one myself if need be.</p>","arenanet":false},{"pubDate":"2016-11-05T15:15:11.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6391120","author":"Malediktus.3740","body":"\n<p>Considering that the contents of the unlocker will probably get expanded and modified over time, would it not be easier to ask for implementing API access to container preview?</p>","arenanet":false},{"pubDate":"2016-11-05T05:26:36.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guaranteed-Wardrobe-Unlock-content-manifest/6390812","author":"Immortius.4537","body":"\n<p>I’ve put together a listing of the content of Guaranteed Wardrobe Unlock, available here:</p>\n<p><a href=\"http://immortius.net.au/guaranteed-wardrobe-unlock/data/guaranteed-wardrobe-unlock-content.json\">http://immortius.net.au/guaranteed-wardrobe-unlock/data/guaranteed-wardrobe-unlock-content.json</a></p>\n<p><em>How this list was produced</em></p>\n<p>I’ve written some scripts that compare screenshots of the preview panel to icons retrieved from the API in order to create a mapping, and then manually addressed the problem cases (skins which share icons and duplicate skin icons mostly). For Outfits, Gliders and Mail Carriers this was done against the items api, while the rest was done against the specific wardrobe apis (skins, colors, minis).</p>\n<p><em>Known Issues</em></p>\n<p>The Mushroom Stomper mini is not in the api, so not included.</p>","arenanet":false}]}