{"title":"Guild Wars 2 World Event Tracker","pubDate":"2013-07-07T22:02:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Wars-2-World-Event-Tracker","comments":[{"pubDate":"2013-08-30T08:13:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Wars-2-World-Event-Tracker/2731974","author":"backsnap.1937","body":"\n<p><a href=\"http://www.gw2eventstate.com\">gw2eventstate</a>.</p>\n<p>It shows the status of every event in your zone. pretty nice</p>","arenanet":false},{"pubDate":"2013-07-17T11:58:59.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Wars-2-World-Event-Tracker/2429506","author":"Danface.3671","body":"\n<p>Dem notifications &lt;3 being able to run the game full-screen sets it above the others for me for sure! All it needs now is an audio cue to accompany them, and some prettying up mebe ^^</p>\n<p>Functionally, feels like it’s mostly there<img src=\"/include/images/smilies/smile.png\"> ‘tis especially dandy being able to turn off tracking for events I’ve already completed. Suppose timers would make it far more convenient to plan around any final few events left to complete, though considering it’s still in beta<img src=\"/include/images/smilies/lion.png\"> nomnomnom ^^ I’m already converted!</p>","arenanet":false},{"pubDate":"2013-07-12T13:07:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Wars-2-World-Event-Tracker/2399401","author":"Yahti.9321","body":"\n<p>Wow I’ve been looking everywhere for something like this.<br>\nThe notification feature is spot on.<br>\nThanks a lot<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2013-07-07T22:02:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Wars-2-World-Event-Tracker/2366169","author":"David.8541","body":"\n<p>I recently developed a small application for myself and a few friends that alerted me to when a <em>Daily Bonus Chest</em> event started so I could easily farm it without having to alt-tab to a webpage. I also needed a way to track which ones I had already done if I had limited game time.</p>\n<p>It runs in the background leaving you to game and will show a <del>pop-up</del> notification as soon as a tracked event starts. You need to be running in Windowed/Windowed Full-screen mode for it to work.</p>\n<p>As it uses the direct API from GW2 it immediately alerts when a tracked event starts but currently doesn’t have a timer.</p>\n<p>It is still in <strong><em>BETA</em></strong> with more features to be added on later but it was suggested to me that quite a few people would benefit from me releasing it.</p>\n<p>Any suggestions or feedback would be greatly appreciated.</p>\n<p>UPDATE 15/7:<br>\nMuch closer to a final version. Fixed a lot of bugs. Running much smoother now with an effective notification system.</p>\n<p>UPDATE 12/7:<br>\nOverhauled the notification system and added an events logger. Should now be more streamlined with the game. Still working on a proper UI. Added screenshots and instructions to the project page.</p>\n<p>UPDATE 10/7:<br>\nAdded pre-event tracking for an early warning towards the main event. Should be much more useful now.</p>\n<p><a href=\"https://sourceforge.net/projects/gw2tracker/\">Guild Wars 2 World Event Tracker</a></p>","arenanet":false}]}