{"title":"Guild Chat API","pubDate":"2015-11-22T17:19:04.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API","comments":[{"pubDate":"2016-09-13T14:18:26.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/6325119","author":"pikkunana.7495","body":"\n<p>There is a game that you can have Twitter inside the actual game.  \"Inside game layout there is option to connect your “twitter account” and chat with people outside the game. While you are playing the game, chat them in game chat \"twitter box \".<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2016-08-04T20:01:20.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/6274956","author":"Elrey.5472","body":"\n<p>Question regarding this. Since it’s only suppose to be for Guild chat. Would it be possible to allow a Bot to use that chat from outside the game?</p>\n<p>For example, my guild is a very closed and small guild that uses a very powerful TeamSpeak chat bot with our API keys stored in its internal database and it can give us some very useful stuff like the next commands in the TeamSpeak Chat.<br>\n<strong>user:</strong> !api fractal level<br>\n<strong>bot:</strong> Your fractal level is X<br>\n<strong>user:</strong> !api build &lt;character&gt;<br>\n<strong>bot:</strong> That character traits are X, skills are Y, gear is Z.<br>\n<strong>user:</strong> !drop<br>\n<strong>bot:</strong> You won a X (level 45 exotic greatsword, for example)</p>\n<p>We use this kind of commands all the time, because some of them are even minigames like the !drop one. The cons of this is that we’re always in need to minimize the game and stay in the TeamSpeak chat for it.</p>\n<p>If the chat integration with the API would be possible as a real-time thing, more or less, my teamspeak bot could maybe monitore the guild chat and answer for commands inside the game. That way we could create some useful in-game commands like:<br>\n<strong>user:</strong> !tequatl<br>\n<strong>bot:</strong> Tequatls appears in 4 minutes at &lt;links waypoint&gt;</p>\n<p>This would be an enormous QoL change for our guild, since the bot could link us items, find stuff in the wiki for us, use the API to give us detailed crafting information about something, etc. I’m sure more other guilds would also benefit from it.</p>\n<p>The Cons is that malicious players would code bots for gold selling or stuff like that. However, if the API integration is only for guild chat, it shouldn’t be an issue. Guild leaders should know who to invite to their guilds, and they can kick people out if there’s such a problem. And let’s face it, gold sellers are already gold selling in map chats and whispers even before the API chat integration is done.</p>\n<p>So now the question is: Will this be allowed, or it would be a bannable action?</p>","arenanet":false},{"pubDate":"2016-08-04T06:03:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/6274145","author":"Lithril Ashwalker.6230","body":"\n<p>Why not have messages copied from your guild chats respectively then relayed to an IRC type chat to parrot them and request your account credentials in order to log in and SEE and reply to whats going on. doing so could relay back to guild chats as if you WERE ingame? a mirror image if you will.</p>","arenanet":false},{"pubDate":"2016-07-25T18:22:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/6255832","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on July 25 2016 11:37AM\"><a href=\"/forum/community/api/Guild-Chat-API/6255346\">Rod.6581:</a></cite></div><div class=\"quotey\"><p>Any update on this?</p></div></blockquote>\n<p>Not yet ;__;</p>","arenanet":true},{"pubDate":"2016-07-25T17:29:00.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/6255743","author":"Aidan Savage.2078","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on November 23 2015 03:36PM\"><a href=\"/forum/community/api/Guild-Chat-API/5789781\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p>The other major issue is that the game side of the chat bits only expects interaction from the game client; I’m not sure what the game will do when it sees your own guild chats sent to your game client from your phone.</p>\n<p>Lemmie get all the easy stuff out of the way first, then I’ll work on chat and character portraits and stuff  ;__;</p></div></blockquote>\n<p>Too bad they cant make what amounts a gutted client for iOS and Android that’s basically just the client wrappings and guild/chat interface. That might get around the problems quite nicely.</p>","arenanet":false},{"pubDate":"2016-07-25T11:37:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/6255346","author":"Rod.6581","body":"\n<p>Any update on this?</p>","arenanet":false},{"pubDate":"2015-11-24T02:44:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/5791807","author":"stress level zero.4907","body":"\n<p>Lawton the man.</p>","arenanet":false},{"pubDate":"2015-11-24T00:53:10.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/5791526","author":"Keneth.6490","body":"\n<p>Well, as long as the answer isn’t “not happening”, I’m fairly satisfied.<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2015-11-23T15:36:33.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/5789781","author":"Lawton Campbell.8517","body":"\n<p>So, one of the big blockers is that our API’s HTTP backend is 100% stateless and only supports request/response (not websockets, etc) and doesn’t handle long-polling well. We’ll probably also need to write a protocol implementation for whatever protocol we settle on (my bets are on IRC) since existing libraries probably won’t play nicely with our stack.</p>\n<p>The other major issue is that the game side of the chat bits only expects interaction from the game client; I’m not sure what the game will do when it sees your own guild chats sent to your game client from your phone.</p>\n<p>Lemmie get all the easy stuff out of the way first, then I’ll work on chat and character portraits and stuff  ;__;</p>","arenanet":true},{"pubDate":"2015-11-23T14:28:36.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/5789611","author":"Keneth.6490","body":"\n<p>If I recall correctly, the app was just not something they could devote substantial resources to. Understandable, considering what state the original release was in.</p>\n<p>That said, I think many of us are still hopeful that some of those features will eventually see the light of day, guild chat being the foremost among them.</p>\n<p>I don’t think the task would present an insurmountable challenge (reading logs and pushing messages to the chat servers through an API is fairly basic stuff), but it is my understanding that the chat system is a pretty horrible mess considering the amount of issues it has had since the game came out, so it might be harder than it’s supposed to be.</p>","arenanet":false},{"pubDate":"2015-11-22T19:42:59.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/5787392","author":"Special K.8143","body":"\n<p>Holy crap. I had just typed up a post and was about to post it here about this same thing. Was gonna put in it “general discussion” but my spidey sense told me to click here first and this post was right on top.</p>\n<p>my post was: \"So i was letting my mind wander a bit and all of a sudden i remembered way back before any of the Guild War2 beta’s were out, and ANET was hype-training GW2. I remembered one of the features they were going to make was an APP for PC’s and tablets that would let you logged into your account and chat with people IN GAME. I believe they also said you’d be able to have access to the World Map and be able to see where all your Guildies are and what they might be doing (Kinda just like with the HoT expansion where we see the yellow dots everywhere).</p>\n<p>While having the map tool would be cool, i would LOVE to be able to have access to chat with Guildies while i’m outside the game, kinda like an in-house GW2 IRC program. This would be great for socialization when you just dont want to be in-game, but still participate and help others, or just hang out.</p>\n<p>Any way this could happen?\"<br>\n————————</p>\n<p>i can’t remember if any reason was given as to why that GW2 program was never made or finished, or if they just let it fade away. But i too would like to have a nice IRC type chat window to talk with people who are in the game.</p>","arenanet":false},{"pubDate":"2015-11-22T17:19:05.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Guild-Chat-API/5787061","author":"Keneth.6490","body":"\n<p>I know Lawton is working on a whole bunch of endpoints for guilds and I’m still waiting patiently for those, but what I’ve really been interested in since before the release of the game is a way to interact with guild chat channels externally.</p>\n<p>I’m well aware that this is a much bigger challenge than something as simple as exposing basic (static) info, but I’m just curious if it’s something that the team is looking into or intends to in the future.</p>\n<p>Between in-game chat, TS, forums, twitter, reddit, IRC channels, and whatever else we use to communicate with each other, things have always felt a bit disconnected. Being able to interact with your guild without having to run the game would improve the growth  and integration of third-party communities considerably. Of course, that extends to other forms of interaction with the game, but I’ve always felt that chat should be the first and most important step in that direction.</p>","arenanet":false}]}