{"title":"GW2 Event Viewer for Android","pubDate":"2013-05-23T18:07:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/GW2-Event-Viewer-for-Android","comments":[{"pubDate":"2013-05-23T18:09:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/GW2-Event-Viewer-for-Android/2079750","author":"Kuang Eleven.9781","body":"\n<p>I’d like to post this on a more general purpose sub-forum as well, but I’m not sure where would be appropriate. Possibly General Discussion, to show people who are not developers?</p>","arenanet":false},{"pubDate":"2013-05-23T18:07:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/GW2-Event-Viewer-for-Android/2079741","author":"Kuang Eleven.9781","body":"\n<p>I just released a new update for my Guild Wars 2 Event Viewer!<br>\n<a href=\"https://play.google.com/store/apps/details?id=k11.guildwars2eventviewer\">https://play.google.com/store/apps/details?id=k11.guildwars2eventviewer</a></p>\n<p>This operates in two main screens:<br>\nMajor Events: The bonus chests you know and love. This lists all bonus chests Dynamic Events, showing on white if currently active, yellow if in preparation or if a pre-event is active and in red if inactive. (Temple of Grenth isn’t showing up on the APIs though, if that is fixed, I am already searching for it.)<br>\nSelect Zone: Select the zone you are currently leveling, farming or getting a tan in and the app will list all active events.</p>\n<p>Make sure to select your home world from the main menu first!</p>\n<p>Clicking on any event will open the corresponding Wiki page. Both pages auto refresh every 30 sec by default, this can be changed in the Options.</p>\n<p>This is the same app I posted the day of the API release as a proof-of-concept, if you downloaded that app, it will automatically update to this new version.</p>\n<p>Upcoming Changes (Next week or so): I will be backing the static API calls to a local database which will dramatically speed up the app and reduce the amount of API calls I have to make.</p>\n<p>This will additionally enable daily bonus chest tracking, event favorites and proper alphabetic ordering.</p>\n<p>For those of a programming mind, this whole app is released under the GPLv3 at Github: <a href=\"https://github.com/KuangEleven/GuildWars2EventViewer\">https://github.com/KuangEleven/GuildWars2EventViewer</a> Some of the code is a bit hairy now, but the caching update I mentioned above will clean things up substantially.</p>","arenanet":false}]}