{"title":"Is the API just a side project?","pubDate":"2014-07-21T08:13:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-the-API-just-a-side-project","comments":[{"pubDate":"2014-07-21T13:28:10.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-the-API-just-a-side-project/4223936","author":"Killer Rhino.6794","body":"\n<p>I don’t have any inside knowledge, but the primary developer who was leading the API project, Cliff, left ArenaNet for SpaceX soon after the APIs got released.</p>\n<p>My guess is there was a lot domain knowledge about getting info from the game’s servers into a safe and public form that left with Cliff, and this info needed to be rediscovered when new staff took over.</p>\n<p>Furthermore, I suspect that the APIs started off internally under the assumption that it would take a backseat to the core game development life cycle. To that end, it would, and probably still, takes a lot of persuading by the employees who maintain the project now to justify the time needed to work on them. The APIs make no money for the company, and only directly serves a community of probably 100-200 people. Once OAuth2 support is added, it could potentially increase the customer service support strain on the company from gamers who are logging into third-party services developed by you and me.</p>\n<p>When v2 is released, and when it sees a concerted effort of support by ArenaNet, it will probably be because they found a solid enough business reason to do so. At current, that may not exist.</p>","arenanet":false},{"pubDate":"2014-07-21T08:13:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-the-API-just-a-side-project/4223275","author":"Lone Wolf.4129","body":"\n<p>I was wondering if there where actualy people non stop working on the API’s or if it was just a side project that they do when they have time?</p>\n<p>I think that like 98% of us actually stopt developing their app’s, websites, etc etc due to the fact we are (still) waiting for V2, and thats already some (long) time now.</p>","arenanet":false}]}