{"title":"Items API and Feature Pack","pubDate":"2014-09-17T20:27:54.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Items-API-and-Feature-Pack","comments":[{"pubDate":"2014-09-22T12:35:05.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Items-API-and-Feature-Pack/4435421","author":"Dr Ishmael.9685","body":"\n<p>At least half of that is the new leveling items.  By my calculations, there should be <del>nearly 4,000</del> 3,136 variants of the loot-dropped leveling weapons – taking all combinations of skin, level, and prefix into account (see <a href=\"http://wiki.guildwars2.com/wiki/User:Dr_ishmael/leveling_weapons#Loot_containers\">here</a>).  That’s not even counting the containers (the actual drop that contains the weapons), but I can’t really estimate how many of them there should be.</p>\n<p>Currently there are 1,696 of the weapons, or ~54%, discovered in the API.  A major factor in this is that players are showing a strong preference for the Power prefixes (Mighty, Vagabond, and Forsaken), so the non-Power prefixes are under-represented.</p>\n<p>[sorry, I keep editing this only because there have been no further responses :P ]</p>","arenanet":false},{"pubDate":"2014-09-17T20:49:08.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Items-API-and-Feature-Pack/4423019","author":"darthmaim.6017","body":"\n<p>Its not the first time we get that many items. Checking my records we got roughly 1100 items on 2014-04-16 and 2000 items on 2014-02-18.</p>","arenanet":false},{"pubDate":"2014-09-17T20:27:54.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Items-API-and-Feature-Pack/4422951","author":"Alcarin.9024","body":"\n<p>I’ve noticed a huge increase in items after the 9/9 update. Is this normal? Does some API bug been fixed in this update that may justify such amount of new items (seems finally we have “Journeyman’s Salvage Kit” and  “Fine Salvage Kit”, but not yet “Master’s Salvage Kit”)? Are there bugs that (just a guess) have changed item_id of some items effectively duplicating them? Have you collected some data about this item update?</p>\n<p><a href=\"https://docs.google.com/spreadsheets/d/1eMSLZyUCTqa2TpHx4NiM1UjQ9C4N8Uu3QB2NYkkwSbU/pubhtml\">This is a spreadsheet</a> with new/updated items each day, we are talking about 3600 new items and 1200 modified items.</p>","arenanet":false}]}