{"title":"Java  Event Timer","pubDate":"2013-05-30T09:40:27.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Java-Event-Timer","comments":[{"pubDate":"2013-05-30T09:40:28.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Java-Event-Timer/2119913","author":"ifoxe.4890","body":"\n<p>Hello,</p>\n<p>Just created a  new APP since i didnt found something  for my taste. Its just an Event Timer for the 9 events that drop chests. U will be notified by sound when a pre-event spawns on your server.</p>\n<p>The code isn’t perfect and it will work only on java 1.6 &gt; .  The functionality to work behind proxy is beeing implemented … so don’t expect it to work out of the box.</p>\n<p>Fixed on 0_5 &gt; \" Atm you only can choose server and the events r alrdy defined. In next releases you will be able to turnoff notifications for the events you already done or change the sound Volume.\"</p>\n<p>To Execute it just double-click the Jar or if u prefer go to CMD&gt; and type:<br>\njava -jar gw2dt.jar.</p>\n<p>The app drop some output so if u  have troubles with it , execute it throught CMD and send me the log.</p>\n<p>You can find the JAR here:<br>\n<a href=\"https://code.google.com/p/gw2dt/\">https://code.google.com/p/gw2dt/</a></p>\n<p>The source is on SRC Folder.</p>\n<p>If have any problem just email me to xifoxex@gmail.com.</p>\n<p>Rev_0_4:</p>\n\n\t<ul>\n\t\t<li>Enabled Bar on Swing Frame With Events and File Items.</li>\n\t\t<li>Enable or Disable Sound Notifications within this Items.</li>\n\t\t<li>Elemental Timer Fixed.</li>\n\t</ul><p>Rev_0_5:</p>\n\n\t<ul>\n\t\t<li>Added Visual Notifications to events. Now if a PRE-Event is Active a Visual Notification on left side will appears. ( Only works on Full-Screen Windowed or Windowed ).</li>\n\t\t<li>Clicking this Notification Will Disable future notifications for this event. Closing the Notification will just Close the Tab. ( working on a better solution ).</li>\n\t\t<li>Added Karka Queen Event to the list.</li>\n\t</ul><p>Rev_0_6:</p>\n\n\t<ul>\n\t\t<li>Improved Notifications.</li>\n\t\t<li>Button is now displayed on right corner.</li>\n\t\t<li>Closing the Tab with the X Button will just Close the notification. It will pop-up next time you recive a warning for the event.</li>\n\t\t<li>Clicking inside the Notification will disable Sound and Visual notifications for the event.</li>\n\t\t<li>Multiple Visual Notifications can appear at the same time.</li>\n\t</ul>","arenanet":false}]}