{"title":"LF Team for Overwolf App Challenge","pubDate":"2015-02-26T13:32:13.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/LF-Team-for-Overwolf-App-Challenge","comments":[{"pubDate":"2015-03-01T02:51:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/LF-Team-for-Overwolf-App-Challenge/4838575","author":"Hrod Ruck.2691","body":"\n<p>Hello Couch Commando,<br>\nI am a programmer, but I honestly don’t have much experience. I am on 4th college year and have done some simple things like a game, a chrome extension, a quantum circuit simulator (it IS simple). The good news is I’m on vacation, so I’ll have lots of free time in these initial weeks. I’m best with HTML5, but I am very interested in learning new technologies as well</p>","arenanet":false},{"pubDate":"2015-02-26T17:42:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/LF-Team-for-Overwolf-App-Challenge/4832067","author":"java.4798","body":"\n<p>Hey Couch Commando,</p>\n<p>I am not a programmer, but rather a professional voice over artist. When I saw this challenge, I thought an app could really shine with some good narration to complement the program’s function; perhaps verbal updates on when certain keeps are taken, etc.</p>\n<p>If you have any desire for free high-quality voice over work as you get into development, send me a message and we can chat.</p>","arenanet":false},{"pubDate":"2015-02-26T14:14:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/LF-Team-for-Overwolf-App-Challenge/4831525","author":"sluntchop.1067","body":"\n<p>Hi Couch Commando,</p>\n<p>This is actually my first forum post!</p>\n<p>I’m interested but am not a developer. I am a full-time freelance graphic and web designer. I’ve been freelancing full-time since 2009. I have also worked a few contracts doing various user experience design for a handful of websites.</p>\n<p>I’m not entirely sure if you need a designer, my opinion is everything on earth needs one<img src=\"/include/images/smilies/wink.png\"> , but my job as a designer is mostly organizing elements to where they “should be” or where a user is likely to use them based on multiple factors. The second part of what I do is creating graphical assets that are either low file size or hopefully done with code or svg.</p>\n<p>Let me know if I can help!</p>\n<p>portfolio is at www.thingorilla.com and <a href=\"https://www.behance.net/thingorilla\">https://www.behance.net/thingorilla</a></p>","arenanet":false},{"pubDate":"2015-02-26T13:32:13.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/LF-Team-for-Overwolf-App-Challenge/4831442","author":"couchcommando.9841","body":"\n<p>Hi everyone!</p>\n<p>I’m a software engineer looking for a team for the Overwolf App Challenge! I’ve got a strong background in full-stack web development. My specialties are back-end development and databases. As far as languages go, I’m best with C#, PHP, and java, but I have a decent amount of experience with ruby, scala, and C. I’m a very quick and very dedicated learner. So, picking up new things for the project is no problem. Let me know if you’re interested!</p>\n<p>I also posted this in the “Looking For…” section of the forums; however, I figured it might be appropriate to also post in a place where other developers are going to see it!<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false}]}