{"title":"Lightweight request to a floor","pubDate":"2015-11-26T14:47:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Lightweight-request-to-a-floor","comments":[{"pubDate":"2015-12-01T15:26:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Lightweight-request-to-a-floor/5813065","author":"Lawton Campbell.8517","body":"\n<p>Makes sense to me; I’ll stick it onto the backlog.</p>","arenanet":true},{"pubDate":"2015-11-26T14:47:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Lightweight-request-to-a-floor/5799431","author":"SippiTheCarry.3275","body":"\n<p>Hello,</p>\n<p>with the new /continents API some things have been made impossible:</p>\n<p>Get a single floor info with only the region-IDs for that floor, not the whole region-infos<br>\nGet a single region info with only the map-IDs for that region, not the whole map-infos<br>\nGet a single map info with only the task/poi/sector IDs, not with the whole infos.</p>\n<p>I get that the new API is a nice way to pull e.g. information for a live-map with one single request, but it has problems in a system that works in a more “progressive” way searching its data node by node.</p>\n<p>When I only want region info (e.g. just the name), I have to pull the complete region info, even when I just want the name and map-IDs.</p>\n<p>I’d suggest you  add an “expand”-query-value that allows to you specify how many levels deep the request should expand the contents of child elements.</p>\n<p>e.g.<br>\n/continents/1/floors/1/regions/1?expand=0 = Expand nothing. Only IDs will be returned<br>\n/continents/1/floors/1/regions/1?expand=1 = Expand only the maps, not POIs, Sectors and Tasks<br>\n/continents/1/floors/1/regions/1?expand=2 = Expand two levels deep (POIs, Sectors and tasks in this case)<br>\n/continents/1/floors/1/regions/1?expand=all = Expand every level recursively</p>\n<p>Right now I have to pull like 200.000 Bytes to get the ~40 Bytes I’m actually interested in and there is no way around it.</p>\n<p>Thank you in advance</p>\n<p>Torben</p>","arenanet":false}]}