{"title":"Looking to learn API! Suggestions?","pubDate":"2015-08-24T01:20:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Looking-to-learn-API-Suggestions","comments":[{"pubDate":"2015-08-27T08:47:04.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Looking-to-learn-API-Suggestions/5420924","author":"Misa.6908","body":"\n<p>I would suggest using visual studio 2015 Community since it’s free, you can do C#, html and javascript with this <a href=\"https://www.visualstudio.com/en-us/downloads/download-visual-studio-vs.aspx\">https://www.visualstudio.com/en-us/downloads/download-visual-studio-vs.aspx</a></p>","arenanet":false},{"pubDate":"2015-08-24T06:55:22.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Looking-to-learn-API-Suggestions/5409940","author":"Chokapik.3741","body":"\n<p>Hello!</p>\n<p>I think the best place to start would be Javascript. You don’t need any programs to create applications, even Windows’s Notepad should do (I don’t recommend it though<img src=\"/include/images/smilies/colondee.png\">).</p>\n<p>I made a quick JSFiddle (it’s a website that allows you create HTML and Javascript code,  quite handy for showing examples to people and stuff). <br>\nI put a lot of comments on it, hopefully it will be understandable enough!<br>\n<a href=\"http://jsfiddle.net/3gs5wcw7/1\">http://jsfiddle.net/3gs5wcw7/1</a></p>\n<p>Basically, it shows how to do a simple request to the v2/build API endpoint, but feel free to have fun with it, change the code, try out other things, …</p>\n<p>I would recommend <a href=\"https://developer.mozilla.org/en-US/Learn/Getting_started_with_the_web/JavaScript_basics\">this tutorial</a> for getting started with Javascript.</p>\n<p>Have fun!</p>","arenanet":false},{"pubDate":"2015-08-24T03:35:04.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Looking-to-learn-API-Suggestions/5409729","author":"Archomeda.6472","body":"\n<p>Not to shatter your dream, but there isn’t something like “a program” or “a particular programming language” you have to use in order to create an application to use the GW2 API.</p>\n<p>The GW2 API is a RESTful API. You can use whatever language you want. However, GW2’s API relies on JSON encoded strings. This is heavily favored towards Javascript and web development. Still, JSON has become pretty popular over time, and you can use JSON in almost every programming language you can imagine (provided that there are libraries for it). This means C++, C#, VB.NET, Java, Javascript, PHP, Ruby, Python, Node.js, Go, and the list goes on and on.</p>\n<p>This means that I can’t give you a recommendation for a programming language you’ll want to use. You have to find a language that you like yourself.</p>\n<p>Regarding <strong>implementing</strong> an API wrapper, it really depends on the language. But note that the GW2 API is a RESTful API (at least version 2 is). Some languages already provide a wrapper for something like that, but sometimes you have to implement it yourself.<br>\nRegarding <strong>reading</strong> the API, there’s the <a href=\"http://wiki.guildwars2.com/wiki/API\">wiki</a> for that.</p>\n<p>My advice is, once you’ve settled what kind of application you want to create, look for programming languages that support you with that. Some examples: PHP/Javascript for web applications, C#/Java for standalone applications. There are more options, but I think that these languages are used the most currently, which means that you’re guaranteed to find tutorials etc. on the internet. Then after you’ve found your combination you can worry about interfacing with the API.</p>\n<p>Also, HTML is not a programming language <img src=\"/include/images/smilies/wink.png\">. It’s like saying that the formatting options on the forums is a programming language.</p>\n<p>Good luck!</p>","arenanet":false},{"pubDate":"2015-08-24T01:20:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Looking-to-learn-API-Suggestions/5409543","author":"Exikar.7581","body":"\n<p>Hello!</p>\n<p>I’ve been looking for a guide that will help teach me the fundamentals in learning how to utilize the API system ArenaNet has presented. I don’t have much coding experience beyond <em>very, very light</em> HTML.</p>\n<p>While the endgame is to create some kind of web-based or stand-alone application, the initial goal is simply to find the tools to get started.</p>\n<p>Do you have any recommendations (guides, tools, tips, etc.) on <strong>how to get started in learning how to code with API</strong> for software/web-based applications, to someone who is new to coding?</p>\n<p><strong>Questions that I have, without any prior experience:</strong></p>\n<ol>\n\t<li>What kind of program do I need to use to “create an application”?</li>\n\t<li>What coding/programming languages can I use, or which languages are recommended?</li>\n\t<li>Any guides on where to begin learning this language?</li>\n\t<li>How does one implement these applications into a website and/or stand-alone program?</li>\n</ol>\n<p>Any help would be much appreciated!</p>","arenanet":false}]}