{"title":"Method for querying multiple access_token?","pubDate":"2015-11-22T08:07:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Method-for-querying-multiple-access-token","comments":[{"pubDate":"2015-11-23T15:05:14.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Method-for-querying-multiple-access-token/5789689","author":"Lawton Campbell.8517","body":"\n<p>There isn’t a way to request multiple character blobs, nor will there probably be in the future (the backend that the API talks to for character data also follows a request/response protocol and only supports one blob/request).</p>\n<p>I’m not sure if our HTTP implementation supports <a href=\"https://en.wikipedia.org/wiki/HTTP_pipelining\">pipelining</a>, but pipelining the HTTP requests across a handful of persistent connections would be the fastest way to get the data out. Not sure if your HTTP library supports it, but I know <a href=\"http://curl.haxx.se/libcurl/c/CURLMOPT_PIPELINING.html\">cURL does</a>, at least.</p>\n<p>The main latency overhead from sending multiple requests is going to be the SSL handshake though, so even without pipelining re-using the connections is going to be a significant difference over using a connection/request.</p>","arenanet":true},{"pubDate":"2015-11-22T08:07:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Method-for-querying-multiple-access-token/5786052","author":"Glyph.7805","body":"\n<p>I have a large database of users where there will be multiple ?access_token requests and I am trying to avoid sending and receiving <em>alot</em> of http requests to and from our servers.</p>\n<p>is there a way to retrieve the JSON data formatted by “user” per access token? in a bulk request? e.g. by header or GET? (?access_token=“xx1”&amp;“xx2”&amp;“xx3”&amp;“xx4”)</p>\n<p>My idea is to create a cron job that will send a request of 200 users at a time every x minutes. so that the data is requested in chunks.</p>\n<p>What is the recommended method here?</p>","arenanet":false}]}