{"title":"Mumble Link for node tracking, etc.","pubDate":"2014-05-06T21:14:13.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mumble-Link-for-node-tracking-etc","comments":[{"pubDate":"2014-05-07T00:35:29.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mumble-Link-for-node-tracking-etc/3997428","author":"smiley.1438","body":"\n<p>We have already an app like this: <a href=\"https://forum-en.guildwars2.com/forum/community/api/Gw2-Location-Tracker/first#post2379754\">https://forum-en.guildwars2.com/forum/community/api/Gw2-Location-Tracker/first#post2379754</a></p>\n<p>Since the code is all open source it’s completely up to you how you use the data. The only problem might be the new Megaserver setup – i haven’t tested the app with that, so i don’t know how reliable the shard_id is.</p>","arenanet":false},{"pubDate":"2014-05-07T00:05:36.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mumble-Link-for-node-tracking-etc/3997362","author":"Aerodin.2795","body":"\n<p>Great idea, but unfortunately I’m not sure this is possible right now due to the Megaserver setup. As far as I know, there’s no way of knowing which megaserver “instance” a player is on, and I would expect that things like node locations would be different for different “instances” of a map. If the API is ever updated to communicate that information, this would work just fine.</p>","arenanet":false},{"pubDate":"2014-05-06T21:14:13.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mumble-Link-for-node-tracking-etc/3996917","author":"Dingle.2743","body":"\n<p>Hi all,</p>\n<p>I’m not a particularly great coder and couldn’t make this happen, but I just wanted to bring it up to see if it seems feasible.</p>\n<p><a href=\"https://forum-en.guildwars2.com/forum/community/api/GW2-s-Mumble-Link-context-data-format/2388565\">As described here,</a> the mumble link API contains the following information, which may be able to uniquely identify a map instance:</p>\n<p>// uniquely identifies a map instance for mumble<br>\nstruct MumbleContext {<br>\n    byte serverAddress<sup class=\"footnote\"><a href=\"#fn28\">28</a></sup>; // contains sockaddr_in or sockaddr_in6<br>\n    unsigned mapId;<br>\n    unsigned mapType;<br>\n    unsigned shardId;<br>\n    unsigned instance;<br>\n    unsigned buildId;<br>\n};</p>\n<p>Topic of discussion: Would it be possible to have a program extract this information to be used for the purposes of things like node tracking?</p>\n<p>I’m thinking:</p>\n<p>1) App gets mumble link data to identify map instance<br>\n2) Communicates with some central server, loads node info, map, etc<br>\n3) User can tab to the app when they’re at the location of a node, and upload information about that node (could be as simple as selecting the node type from a list, with the app reading the location of the character to place it)<br>\n4) Other users in that map instance running the app can then see that node on the map displayed within the app</p>\n<p>Obviously this would need systems for determining if a map instance has been reset; the build value could be used to purge data every time a new build has been released, but aside from that I don’t know if an instance’s nodes would be randomised if it’s got the same identifying values as one that previously existed and was destroyed due to not having any players in it – that could be a problem if it’s the case.</p>\n<p>However, would it have any potential as a system for node tracking? Does the events api provide enough information (i.e. which map instances are running specific events) that you could use it for event tracking?</p>","arenanet":false}]}