{"title":"Mystic Forge Recipes?","pubDate":"2015-02-05T23:12:11.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1","comments":[{"pubDate":"2015-04-07T22:14:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4958668","author":"AfterXII.2761","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on April 05 2015 05:54PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4952785\">Don Zardeone.8730:</a></cite></div><div class=\"quotey\"><p>What about making it so that after 50 000 forgings, or any other number deemed appropriate, the item enters the API?</p>\n<p>If 50k or 100k of these items have been made, they’re hardly a secret any more, unless they were made by a mere handful of people. Maybe have unique crafters as a criterium too.</p></div></blockquote>\n<p>I disagree because the 50k times it was forged could have been by 2 or 3 people.</p>","arenanet":false},{"pubDate":"2015-04-05T17:54:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4952785","author":"Don Zardeone.8730","body":"\n<p>What about making it so that after 50 000 forgings, or any other number deemed appropriate, the item enters the API?</p>\n<p>If 50k or 100k of these items have been made, they’re hardly a secret any more, unless they were made by a mere handful of people. Maybe have unique crafters as a criterium too.</p>","arenanet":false},{"pubDate":"2015-04-02T16:26:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4945002","author":"AfterXII.2761","body":"\n<p>Offering free services is always the best move to make when providing tools for the  gaming community. You’ll find that in most cases, ads will pay for your maintenance costs (assuming your app is semi popular).</p>","arenanet":false},{"pubDate":"2015-04-01T21:12:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4942586","author":"Sariel V.7024","body":"\n<p>With gw2spidy being free and popular, said app had better be superior.</p>","arenanet":false},{"pubDate":"2015-03-30T21:24:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4932476","author":"DarkSpirit.7046","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on March 20 2015 07:43PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4902175\">Sariel V.7024:</a></cite></div><div class=\"quotey\"><p>I’m still against it ;D</p></div></blockquote>\n<p>Actually it doesn’t really matter even if AreaNet doesn’t implement it.  If players really want their apps to support the discovered MF recipes then they would spend time to create it from the wiki one way or another.  (ahem…some people already have but they are not going to make it public).</p>\n<p>What this amounts to is that, those who take the time and effort to create these recipes for their apps would gain the advantage over those who don’t.</p>\n<p>Taking gw2spidy example again:</p>\n<p><a href=\"http://www.gw2spidy.com/recipe/9269\">http://www.gw2spidy.com/recipe/9269</a></p>\n<p>I can create a better minimum acquisition cost for an item by including other forms of acquiring said item or its ingredients.  These other forms for acquiring ingredients would include MF upgrading/crafting.  But of course that would mean creating the discovered MF recipes by hand and giving an average or user-inputted value for the number of output items.</p>\n<p>This just means I would probably decide to charge some money on the App Store for my app since it takes me longer to write such an app without ArenaNet providing the MF recipes.</p>","arenanet":false},{"pubDate":"2015-03-20T19:43:13.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4902175","author":"Sariel V.7024","body":"\n<p>I’m still against it ;D</p>","arenanet":false},{"pubDate":"2015-03-17T18:51:09.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4890173","author":"Illconceived Was Na.9781","body":"\n<p>tl;dr I think it’s perfectly fine to “hamper the <strong>financial</strong> incentives behind the forge puzzles.” So, I hope you won’t “stand by [your] guns” and consider finding some other sort of way to reward those who discover a recipe.</p>\n<hr>\n<p>A wiki-trigger would be better, but doesn’t address my concern that asymmetric distribution of data goes against the implementation of the game’s philosophy elsewhere. A ‘free market’ requires that all the players have the same information. I see ‘discovery’ of MF recipes as fundamentally similar to discovering chef’s recipes: the first to find has an advantage, but it’s only temporary.</p>\n<p>If John Smith et al feel that this is an important incentive <em>and</em> still want to balance with the cooperative spirit that distinguishes GW2 from other MMOs, a time delay is ok, but I wonder if ‘supply’ would make a better trigger. That is, hide the recipe until there is a supply of at least e.g. 5 units. That allows the first people to discover a recipe more time, as long as they don’t get (too) greedy. Theoretically, the recipe could be hidden if the supply ever drops (“5” is a completely arbitrary number).</p>\n<p>To me, the incentive behind the forge puzzle should be similar to the incentive behind jumping puzzles: it’s a puzzle and solving it is its own reward. I understand the idea behind also wanting a financial incentive, but should that really mean an additional element of PvP in the marketplace?</p>\n<p>Disparity in availability of data already leads to player dissatisfaction. Witness the number of complaints each time there’s a market disruption: accusations of “insider trading” or despair over being unable to logon in time to profit from the market frenzy. I see these gripes as evidence that the community <em>feels</em> disadvantaged, even though I know that many of the plaintiffs are misunderstanding basic economic principles. My feeling is that design choices should limit this type of frustration, all else being equal.</p>\n<hr>\n<p>Thanks for taking the time to respond thoughtfully and offer a reasonable compromise. While it’s clear I strongly prefer a different outcome, the choice of  using tangible rewards to ‘solve’ a “bartle’s spades” problems in gaming is tried &amp; true. The number of ‘hidden’ forge recipes will be relatively small, so the overall economic impact will be tiny. I’m sure your time (and that of others) would be better spent other API issues/features, so I’m okay with letting this drop after reading your response (if any).</p>","arenanet":false},{"pubDate":"2015-03-17T18:46:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4890148","author":"Quantum.7041","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on March 17 2015 05:54PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4889871\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p>In my opinion, the discovery process is for <a href=\"http://en.wikipedia.org/wiki/Bartle_Test#Explorers\">Bartle’s spades</a> and the only reward is temporary control over the use of the discovered recipe.</p></div></blockquote>\n<p>Those in favor of the API change seem to be suggesting that the discovery process <strong><em>is</em></strong> the reward. If profiting from information asymmetry was the reward, this change would not be in their interest, and they’d have no rational reason to advocate for it.</p>\n<p>In any case, the change might reduce asymmetry, but won’t remove it entirely. Most players I encounter aren’t programmers, and won’t ever touch an API endpoint (let alone tell you what that is). Just as many seem unaware of the wiki, or at the very least too lazy to type /wiki and look something up.</p>","arenanet":false},{"pubDate":"2015-03-17T18:36:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4890098","author":"RoyHarmon.5398","body":"\n<p>I just want to go on record expressing my profound disappointment at what happens when you forge one of each of the totems of the four Spirits of the Wild (the accessories available from their respective Task NPCs/karma vendors).</p>\n<p>You really missed an opportunity there, folks.</p>","arenanet":false},{"pubDate":"2015-03-17T17:54:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4889871","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on March 17 2015 01:41AM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4886506\">Illconceived Was Na.9781:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on February 08 2015 04:01AM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4775264\">Dr Ishmael.9685:</a></cite></div><div class=\"quotey\"><p>You’re reading too much into how the wiki treats the MF recipes.</p></div></blockquote>\n<p>Therefore, I again urge ANet to change the design decision and to publish standardized MF outputs via the API, so that they are more universally available to the community as a whole.</p></div></blockquote>\n<p>How would you feel about an API endpoint that effectively was just a wrapper around the wiki’s semantic search?</p>\n<p>I’m standing by my guns on not automatically revealing new recipes upon or after discovery. In my opinion, the discovery process is for <a href=\"http://en.wikipedia.org/wiki/Bartle_Test#Explorers\">Bartle’s spades</a> and the only reward is temporary control over the use of the discovered recipe. An API, even with an arbitrary delay, would severely hamper the incentives behind the forge puzzles.</p>","arenanet":true},{"pubDate":"2015-03-17T01:41:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4886506","author":"Illconceived Was Na.9781","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 08 2015 04:01AM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4775264\">Dr Ishmael.9685:</a></cite></div><div class=\"quotey\"><p>You’re reading too much into how the wiki treats the MF recipes.</p></div></blockquote>\n<p>Then you’ve missed my point entirely.</p>\n<p>It doesn’t matter if there’s a technical distinction between how the wiki treats the functions. The wiki publishes recipes for both the MF and crafting and sometimes doesn’t distinguish between them. That is a design decision, not a technical one.</p>\n<p>Similarly the decision to publish the MF output in the API is a design decision, even if it requires doing something different behind the scenes, where the typical player wouldn’t see it.</p>\n<p>So I reiterate: continuing to ‘hide’ the MF outputs after they have been discovered is something that benefits that tiny of fraction of players that have access to such information. It gives them a competitive advantage in converting materials into sellable goods and into pricing such goods on the trading post.</p>\n<p>Therefore, I again urge ANet to change the design decision and to publish standardized MF outputs via the API, so that they are more universally available to the community as a whole.</p>\n<p>Full disclosure: this decision would likely hurt me financially. I already spend time researching recipes, experimenting with MF inputs, and have my own tools to calculate profitability. I’m also a relatively patient producer/consumer of goods. So, the status quo allows me to take advantage of the uneven distribution of data. I’m happy to keep profiting off this. But I’d prefer the playing field to be level.</p>\n<p><em>edit: late reply; I just noticed because this was referenced recently in another post</em></p>","arenanet":false},{"pubDate":"2015-03-05T20:39:45.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4851117","author":"AfterXII.2761","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 28 2015 05:27AM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4836563\">DarkSpirit.7046:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on February 27 2015 07:52PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4835412\">AfterXII.2761:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on February 27 2015 07:06PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4835276\">Sariel V.7024:</a></cite></div><div class=\"quotey\"><p>All the known combinations are already on the wiki. What are you REALLY looking for in terms of an interface?</p></div></blockquote>\n<p>To enhance a tool I just made.</p>\n<p><a href=\"http://gw2shinies.com/alchemy\">http://gw2shinies.com/alchemy</a></p></div></blockquote>\n<p>Good job on gw2shinies.  I like that website.  Do you have the MF recipes in JSON format that we can download?</p>\n<p>My feedback:</p>\n<p>Would be even better if you can show the crafting tree like in gw2spidy if I click on a line of item:</p>\n<p><a href=\"http://www.gw2spidy.com/recipe/9269\">http://www.gw2spidy.com/recipe/9269</a></p>\n<p>So that I know which ingredient to buy and which ingredient to craft to maximize profit.</p></div></blockquote>\n<p>Yep crafting designs are in the works, but wont be available for a while. Working on some optimizations first. As for creating Mystic Forge recipes as an API. If you can get enough people onboard, interested in that feature, I will certainly provide it.</p>","arenanet":false},{"pubDate":"2015-03-02T18:30:00.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4842246","author":"Sariel V.7024","body":"\n<p>Things are becoming clearer. I have to admit, for your site, that would be handy.</p>\n<p>I’m not sure you’ll be able to compete head to head with gw2spidy, but I figure what they use for this is a database filled by hand. You’ll have to do the same for now :/</p>","arenanet":false},{"pubDate":"2015-02-28T05:27:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4836563","author":"DarkSpirit.7046","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 27 2015 07:52PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4835412\">AfterXII.2761:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on February 27 2015 07:06PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4835276\">Sariel V.7024:</a></cite></div><div class=\"quotey\"><p>All the known combinations are already on the wiki. What are you REALLY looking for in terms of an interface?</p></div></blockquote>\n<p>To enhance a tool I just made.</p>\n<p><a href=\"http://gw2shinies.com/alchemy\">http://gw2shinies.com/alchemy</a></p></div></blockquote>\n<p>Good job on gw2shinies.  I like that website.  Do you have the MF recipes in JSON format that we can download?</p>\n<p>My feedback:</p>\n<p>Would be even better if you can show the crafting tree like in gw2spidy if I click on a line of item:</p>\n<p><a href=\"http://www.gw2spidy.com/recipe/9269\">http://www.gw2spidy.com/recipe/9269</a></p>\n<p>So that I know which ingredient to buy and which ingredient to craft to maximize profit.</p>","arenanet":false},{"pubDate":"2015-02-27T19:52:54.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4835412","author":"AfterXII.2761","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 27 2015 07:06PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4835276\">Sariel V.7024:</a></cite></div><div class=\"quotey\"><p>All the known combinations are already on the wiki. What are you REALLY looking for in terms of an interface?</p></div></blockquote>\n<p>To enhance a tool I just made.</p>\n<p><a href=\"http://gw2shinies.com/alchemy\">http://gw2shinies.com/alchemy</a></p>","arenanet":false},{"pubDate":"2015-02-27T19:06:29.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4835276","author":"Sariel V.7024","body":"\n<p>All the known combinations are already on the wiki. What are you REALLY looking for in terms of an interface?</p>","arenanet":false},{"pubDate":"2015-02-25T07:54:09.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4827409","author":"DarkSpirit.7046","body":"\n<p>If they don’t release the MF recipe, that just means there would be greater demand for apps that has the known MF recipes built in.</p>\n<p>Otherwise someone else would have to go through the pain to do it, then give it away for free.  Any volunteers?<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2015-02-11T20:13:29.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4786840","author":"Sariel V.7024","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 07 2015 05:46AM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4773112\">Illconceived Was Na.9781:</a></cite></div><div class=\"quotey\"><p>They might be intended to be a puzzle, but they certainly aren’t. They get documented on the wiki. The ones that don’t get documented allow a few people to control a niche in the market, which seems unfair to me.</p>\n<p>So, I’d argue that it’s ok to hide undiscovered recipes from the API, but the greater good to the community is to expose known recipes to everyone.</p></div></blockquote>\n<p>I didn’t respond to this earlier, but I think it’s worth commenting on.</p>\n<p>Combinations are documented on the wiki <em>by players</em>. Like everything else on the wiki, it is a sum total of knowledge that has been freely shared, generally elsewhere (guildwars2guru, reddit, armor-soft, these forums) and inscribed by people that are dedicated to getting it out into other people’s hands. The devs do not maintain the wiki.</p>\n<p>Effectively, the wiki is a massive collection of spoilers, much like you would find on a message board. It provides shortcuts for just about any process in the game, including things you haven’t considered like discovery, exploration, and practice. People turn to it for a quick fix of knowledge, but either don’t realize (or, likely, don’t care) that it sucks a lot of the fun out things.</p>\n<p>The early period of forge experimentation was a fun one, but with everyone recording the combinations for posterity, it can only happen once. John Smith revived this with his own little treasure hunt story. The spirit of discovery, exploration, and most of all, collaboration made it interesting and exciting; the only in-game experience that paralleled it was the hunt for Mad Memoires. And that was gone before he even finished the story. Someone figured out the last component without the last hint, and so ended the era of forge discoveries.</p>\n<p>I say all this as an unabashed fan of the Atelier series, which uses a similar system. Do I think that we need to reinvent the wheel every time we want to make Infinite Light? Of course not. But there is a reason for the process as it is and I don’t advocate rushing it. This includes revealing the magicians’ secrets.</p>","arenanet":false},{"pubDate":"2015-02-11T18:47:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4786500","author":"AfterXII.2761","body":"\n<p>Well and I don’t have to get all of the recipes, just the ones that stay the same, ones that are well known (and well used) by the public.</p>","arenanet":false},{"pubDate":"2015-02-11T18:38:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4786461","author":"Sariel V.7024","body":"\n<p>I will freely admit my reasoning harbors ulterior motives. With the wardrobe work I’d been doing, I determined Reaper of Souls was forgeable (around mid-September) and worked every night to figure out its combination. I don’t have much in the way of in-game resources, so I codified a method and adhered to it. The amount of note-taking I put in was ridiculous.</p>\n<p>I was somewhat irked when the combination was indirectly revealed by John Smith – a month’s work down the drain. I’d always steeled myself for the possibility of someone else finding it before I did, but not with the help of a developer breaking the usual pattern of silence ;D</p>\n<p>So, yeah, this one is personal ;D</p>","arenanet":false},{"pubDate":"2015-02-08T06:29:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4775472","author":"smiley.1438","body":"\n<p>I stand with the people who want the <strong>discovered</strong> MF recipes in the API. There’s actually no reason to disclose them, since these are (mostly) documented in the Wiki anyway.</p>","arenanet":false},{"pubDate":"2015-02-08T04:01:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4775264","author":"Dr Ishmael.9685","body":"\n<p>You’re reading too much into how the wiki treats the MF recipes.</p>\n<p>The only MF recipes that we document through the Semantic MediaWiki system are those that have fixed inputs and outputs (other than variable quantities, e.g. material promotion – the output <em>item</em> is still fixed).  These types of MF recipes <em>look</em> very similar to crafting recipes, so instead of developing two separate frameworks (one for crafting, one for MF) that would look nearly identical, we decided to use the same framework for both.</p>\n<p>MF recipes with variable inputs/random outputs, on the other hand, look nothing like crafting recipes, so we can’t document them in the same framework.  That’s why on pages like <a href=\"http://wiki.guildwars2.com/wiki/Carnelian_Nugget\">Carnelian Nugget</a>, for example, you only see Jeweler recipes in the list, and you <em>don’t</em> see the variable-input/random-output MF recipe for combining gemstones.</p>\n<p><strong>That</strong> is why the wiki documents (some) MF recipes the same as crafting recipes, not because we think they’re actually equivalent.</p>","arenanet":false},{"pubDate":"2015-02-08T03:33:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4775222","author":"Illconceived Was Na.9781","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 07 2015 06:47AM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4773176\">orenwolf.1953:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on February 07 2015 05:46AM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4773112\">Illconceived Was Na.9781:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on February 07 2015 01:58AM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4772788\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on February 06 2015 11:54PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4772520\">Sariel V.7024:</a></cite></div><div class=\"quotey\"><p>Unlike crafting recipes, which are often bought as sheets and remain forever documented in your UI after you learn them, the combinations of the forge are intended to be a puzzle. They are a secret, and their revelation to the world at large remains at the discretion of the players that discover them. Or, in a single case, at the discretion of John Smith ;D</p></div></blockquote>\n<p>FWIW, I share this sentiment.</p></div></blockquote>\n<p>They might be intended to be a puzzle, but they certainly aren’t. They get documented on the wiki. The ones that don’t get documented allow a few people to control a niche in the market, which seems unfair to me.</p>\n<p>So, I’d argue that it’s ok to hide undiscovered recipes from the API, but the greater good to the community is to expose known recipes to everyone.</p></div></blockquote>\n<p>No way. Nothing is stopping others from discovering these recipies, so it isn’t about fairness at all. If I farm and dump 50k of item X into the forge in various combinations and find a recipe you don’t have, NOTHING prevents you from doing the exact same thing.</p>\n<p>Just as if I find a new way to combine my skills to be more effective in my class, I am not suddenly obligated to tell the world, because anyone else could do the exact same thing.</p>\n<p>“Fair” == equal access to opportunity.</p></div></blockquote>\n<p>I apologize for confusing the issue by using the word, “unfair.” I stand by the intent of my post, which is to point out that:</p>\n<ul>\n\t<li>The recipes are only a puzzle until they are discovered by <em>someone</em> .</li>\n\t<li>Hiding the recipes after discovery benefits the few at the expense of the many.</li>\n</ul>\n<p>I’d add the following idea: distinguishing forge from craft recipes is a design decision, not an intrinsic one.</p>\n<ul>\n\t<li>The wiki treats them the same, combining all recipes together on an article, except to make things more legible (usually when there are a dozen plus associated formulas).</li>\n\t<li>There’s a difference between hiding the <em>discovery</em> of new recipes from the API and hiding established recipes from all but the few lucky enough to have the time to experiment.</li>\n</ul>\n<p>I like the fact that there are hidden recipes and that some of us (including myself) are able to experiment and occasionally uncover new ones. However, once those recipes are discovered, I don’t see the benefit to continuing to hide them from the API.</p>","arenanet":false},{"pubDate":"2015-02-07T07:14:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4773208","author":"tevoro.1587","body":"\n<p>Can John Smith be recruited to the story team again some time? I loved that story, checking the forums every day looking to see what people had come up with, what people thought it might be, was a lot of fun!</p>","arenanet":false},{"pubDate":"2015-02-07T06:47:47.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4773176","author":"orenwolf.1953","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 07 2015 05:46AM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4773112\">Illconceived Was Na.9781:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on February 07 2015 01:58AM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4772788\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on February 06 2015 11:54PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4772520\">Sariel V.7024:</a></cite></div><div class=\"quotey\"><p>Unlike crafting recipes, which are often bought as sheets and remain forever documented in your UI after you learn them, the combinations of the forge are intended to be a puzzle. They are a secret, and their revelation to the world at large remains at the discretion of the players that discover them. Or, in a single case, at the discretion of John Smith ;D</p></div></blockquote>\n<p>FWIW, I share this sentiment.</p></div></blockquote>\n<p>They might be intended to be a puzzle, but they certainly aren’t. They get documented on the wiki. The ones that don’t get documented allow a few people to control a niche in the market, which seems unfair to me.</p>\n<p>So, I’d argue that it’s ok to hide undiscovered recipes from the API, but the greater good to the community is to expose known recipes to everyone.</p></div></blockquote>\n<p>No way. Nothing is stopping others from discovering these recipies, so it isn’t about fairness at all. If I farm and dump 50k of item X into the forge in various combinations and find a recipe you don’t have, NOTHING prevents you from doing the exact same thing.</p>\n<p>Just as if I find a new way to combine my skills to be more effective in my class, I am not suddenly obligated to tell the world, because anyone else could do the exact same thing.</p>\n<p>“Fair” == equal access to opportunity.</p>","arenanet":false},{"pubDate":"2015-02-07T05:47:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4773116","author":"AfterXII.2761","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 06 2015 11:54PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4772520\">Sariel V.7024:</a></cite></div><div class=\"quotey\"><p>I opposed earlier. I’m still opposing.</p>\n<p>Unlike crafting recipes, which are often bought as sheets and remain forever documented in your UI after you learn them, the combinations of the forge are intended to be a puzzle. They are a secret, and their revelation to the world at large remains at the discretion of the players that discover them. Or, in a single case, at the discretion of John Smith ;D</p>\n<p>Like dungeon exotic recipes, the products of forge combinations can be real money makers. But that only works while the combination remains a secret. If one person can work out something at the forge, there’s a very good chance that someone else will be able to replicate the discovery. But that doesn’t mean that the first person shouldn’t get to benefit in the interim.</p>\n<p>At least, that’s the purpose I assume you are concerned with making an API for – to ensure that all discoveries immediately go public. In real terms, it would be functionally impossible to document every combination that could go in to and come out from the forge. The reason for this is because of the possibility to input random combinations of gear or upgrades in and get a random one back out. There’s about 30000^5 combinations to cover here just from weapons and armor alone.</p></div></blockquote>\n<p>That actually makes alot of sense. I didn’t even think about all possible combinations in the forge, just the popular combinations. Thanks for the clarification. I guess building by hand it is!</p>","arenanet":false},{"pubDate":"2015-02-07T05:46:04.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4773112","author":"Illconceived Was Na.9781","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 07 2015 01:58AM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4772788\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on February 06 2015 11:54PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4772520\">Sariel V.7024:</a></cite></div><div class=\"quotey\"><p>Unlike crafting recipes, which are often bought as sheets and remain forever documented in your UI after you learn them, the combinations of the forge are intended to be a puzzle. They are a secret, and their revelation to the world at large remains at the discretion of the players that discover them. Or, in a single case, at the discretion of John Smith ;D</p></div></blockquote>\n<p>FWIW, I share this sentiment.</p></div></blockquote>\n<p>They might be intended to be a puzzle, but they certainly aren’t. They get documented on the wiki. The ones that don’t get documented allow a few people to control a niche in the market, which seems unfair to me.</p>\n<p>So, I’d argue that it’s ok to hide undiscovered recipes from the API, but the greater good to the community is to expose known recipes to everyone.</p>","arenanet":false},{"pubDate":"2015-02-07T01:58:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4772788","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 06 2015 11:54PM\"><a href=\"/forum/community/api/Mystic-Forge-Recipes-1/4772520\">Sariel V.7024:</a></cite></div><div class=\"quotey\"><p>Unlike crafting recipes, which are often bought as sheets and remain forever documented in your UI after you learn them, the combinations of the forge are intended to be a puzzle. They are a secret, and their revelation to the world at large remains at the discretion of the players that discover them. Or, in a single case, at the discretion of John Smith ;D</p></div></blockquote>\n<p>FWIW, I share this sentiment.</p>","arenanet":true},{"pubDate":"2015-02-06T23:54:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4772520","author":"Sariel V.7024","body":"\n<p>I opposed earlier. I’m still opposing.</p>\n<p>Unlike crafting recipes, which are often bought as sheets and remain forever documented in your UI after you learn them, the combinations of the forge are intended to be a puzzle. They are a secret, and their revelation to the world at large remains at the discretion of the players that discover them. Or, in a single case, at the discretion of John Smith ;D</p>\n<p>Like dungeon exotic recipes, the products of forge combinations can be real money makers. But that only works while the combination remains a secret. If one person can work out something at the forge, there’s a very good chance that someone else will be able to replicate the discovery. But that doesn’t mean that the first person shouldn’t get to benefit in the interim.</p>\n<p>At least, that’s the purpose I assume you are concerned with making an API for – to ensure that all discoveries immediately go public. In real terms, it would be functionally impossible to document every combination that could go in to and come out from the forge. The reason for this is because of the possibility to input random combinations of gear or upgrades in and get a random one back out. There’s about 30000^5 combinations to cover here just from weapons and armor alone.</p>","arenanet":false},{"pubDate":"2015-02-06T19:30:14.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4771685","author":"Lawton Campbell.8517","body":"\n<p>Since there’s not a response in the linked thread, I’ll go ahead and say a Mystic Forge recipe API is unlikely to happen in the near future.</p>","arenanet":true},{"pubDate":"2015-02-06T00:46:22.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4769399","author":"smiley.1438","body":"\n<p><a href=\"https://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Items-Recipes-and-Crafting/2827638\">https://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Items-Recipes-and-Crafting/2827638</a></p>","arenanet":false},{"pubDate":"2015-02-05T23:12:11.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mystic-Forge-Recipes-1/4769179","author":"AfterXII.2761","body":"\n<p>So someone may/may not have asked this before so I apologize in advance…</p>\n<p>Anet, you have a recipes API, but why not a Mystic Forge recipes API? Compiling a list of all known MF recipes becomes obselete/outdated with every new patch that introduces both new recipes and changes old ones for the Mystic Forge.</p>\n<p>Unfortunately I don’t have that kind of time, but I have great ideas to make use of a MF Recipe API. Anyone else feel this way?</p>","arenanet":false}]}