{"title":"New System Option?","pubDate":"2014-10-17T20:07:00.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-System-Option","comments":[{"pubDate":"2014-10-23T17:19:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-System-Option/4509839","author":"Dr Ishmael.9685","body":"\n<p>The relevant acronym here is UI, user interface.  APIs are typically accessed by other programs, not directly by users.</p>","arenanet":false},{"pubDate":"2014-10-22T12:43:38.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-System-Option/4505416","author":"Jytix.5438","body":"\n<p>Aw, thank man.  I honestly didn’t know what API meant so I looked up the definition and google said that it was the application program interface, which sounded like it was how you interact with the program.  Thanks for pointing this out to me.  I was honestly trying to put this in the correct area.  Thanks again! <img src=\"/include/images/smilies/carethappy.png\"></p>","arenanet":false},{"pubDate":"2014-10-18T02:07:24.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-System-Option/4494141","author":"Dr Ishmael.9685","body":"\n<p>This has nothing to do with the API, not sure why you thought it did.  I’ve reported the thread, so a moderator should be along soon to move it to a more appropriate location.</p>\n<p>On-topic, though, I agree with you.</p>","arenanet":false},{"pubDate":"2014-10-17T20:07:00.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-System-Option/4493452","author":"Jytix.5438","body":"\n<p>So currently, if the right mouse button is held down then the controls become similar to third person over the shoulder shooter or similar to other MMORPGs such as Terra. This control set is extremely useful. I would like to know if there is a way to make this a pseudo-permanent option. So basically I would like an option to reverse the right mouse button controls. To make it to where the screen always acts as if you held the button down but without the button actually being held down and when you do hold the right mouse button your cursor appears on screen and you can use it as normal.</p>\n<p>I envision this being an option that you can toggle through the system options so each player can play the way they prefer.</p>","arenanet":false}]}