{"title":"New Overwolf apps for GW2 - looking for ideas","pubDate":"2014-02-17T07:33:07.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas","comments":[{"pubDate":"2014-05-13T13:34:44.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/4018496","author":"Raif.9507","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on April 01 2014 06:49PM\"><a href=\"/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3844229\">Naz.2607:</a></cite></div><div class=\"quotey\"><p>New apps would be nice but, I’d rather see a <em>completed</em> TeamSpeak overlay.</p>\n<p>Atm, I can only see who is in the channel that I am currently in. As a Guild Officer, I need to be able to see the entire TS Panel just like the old TS overlay showed…<br>\nComing from the TS overlay, I’m so disappointed that you did it this way. <br>\nAm I missing something?</p>\n<p>Also, why in the world cant I change the font color??? Hard to see against a lot of the GW2 backgrounds.<br>\nOh, and another thing, I shouldn’t have to alt-tab &amp; to see how many ppl are in channel with me…</p></div></blockquote>\n<p>My apologies for the late reply, but you can bring the whole whole TS into your game without tabbing out. On the TS app you have the option for “Full TS3” which brings the whole TS3 window into your game or the “Channel” button which gives you just your channel.</p>\n<p>As far as I remember, the TS overlay made by the TS guys only showed the current channel not the whole TS (remember please we are 2 different companies).</p>\n<p>As for seeing how many people are in your channel do you mean a number? Or a list of people as that can be shown by the “Channel” button. If you are looking for a number then that is something different.</p>\n<p>The font color is something I can pass on to the devs and see if we can implement something like that, but the main reason it is white is due to the black background of the overlay itself as a lot of other colors are very difficult to see on that color background.</p>","arenanet":false},{"pubDate":"2014-04-01T23:44:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3845491","author":"DanScott.4839","body":"\n<p>I think a lot of the things that can be done with the current API have already been done, or some obscene hacks like third party applications (as smiley has already stated) have been made to over come some hurdles. More information from the Guild Wars 2 backend would probably have to be exposed before you can start doing some cool kitten with overwolf that hasn’t been done already.</p>","arenanet":false},{"pubDate":"2014-04-01T18:49:40.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3844229","author":"Naz.2607","body":"\n<p>New apps would be nice but, I’d rather see a <em>completed</em> TeamSpeak overlay.</p>\n<p>Atm, I can only see who is in the channel that I am currently in. As a Guild Officer, I need to be able to see the entire TS Panel just like the old TS overlay showed…<br>\nComing from the TS overlay, I’m so disappointed that you did it this way. <br>\nAm I missing something?</p>\n<p>Also, why in the world cant I change the font color??? Hard to see against a lot of the GW2 backgrounds.<br>\nOh, and another thing, I shouldn’t have to alt-tab &amp; to see how many ppl are in channel with me…</p>","arenanet":false},{"pubDate":"2014-03-26T21:23:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3817003","author":"shogei.8015","body":"\n<p>I would like to see some zone-specific information out of an Overlook widget</p>\n<p>First, something that tells me events that are running in the current zone.  This would help when doing dailies that involve regional events (“Ascalonian events”, “Shiverpeaks Events”) etc.  If it interfaced with mumble it might be able to sort events based on distance from my current location.</p>\n<p>A list of discovery locations in the current zone would also be good (Points of interest, vistas, waypoints, hearts).  It would be especially good if it could tell you the ones you haven’t opened yet, but this is not currently supported.</p>\n<p>A list of vendors (cash and karma) in the zone with a list of wares would be useful.</p>\n<p>Something that discovers and lists all gathering nodes in the current zone would also be handy, but that would require an API change as it is not information that is currently available.</p>\n<p>Someone mentioned a world event timer.  There are lots of those out there already, but having one where I could set the event(s) I am interested in would be very nice.  I could “subscribe” to Shatterer and then be told when it was in pre.</p>","arenanet":false},{"pubDate":"2014-03-17T23:56:00.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3770958","author":"Maltroth.1276","body":"\n<p>I’m looking for a Guild Management and Utilities Tool but I think we’re all waiting the Authentification system to go further. I just subscribed for your Overwolf SDK and I started to look at the code and your API. It’s interesting indeed.</p>\n<p>Untill the GW2 API v2 comes out, we’re all a little stuck.</p>","arenanet":false},{"pubDate":"2014-02-24T10:07:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3680270","author":"Raif.9507","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 23 2014 09:41PM\"><a href=\"/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3678587\">StevenL.3761:</a></cite></div><div class=\"quotey\"><p>This may be far-fetched, but I often find myself using third-party websites to check when  world bosses will spawn.</p>\n<p>See <a href=\"http://guildwarstemple.com/dragontimer/\">Dragon Timer</a></p>\n<p>Is this something that can be turned into an overlay somehow?</p></div></blockquote>\n<p>Most certainly! But we already have that XD</p>\n<p>Look <a href=\"http://www.overwolf.com/Appstore/#appId=Axyd_GW2_TT\">here</a>. Brings up a window with the dragon, temples and popular events like the Frozen Maw, Shadow Behemoth and Fire Elemental. Configurable to your server of choice and shows you the history of the event (when it was attempted/completed).</p>","arenanet":false},{"pubDate":"2014-02-23T21:41:47.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3678587","author":"StevenL.3761","body":"\n<p>This may be far-fetched, but I often find myself using third-party websites to check when  world bosses will spawn.</p>\n<p>See <a href=\"http://guildwarstemple.com/dragontimer/\">Dragon Timer</a></p>\n<p>Is this something that can be turned into an overlay somehow?</p>","arenanet":false},{"pubDate":"2014-02-23T09:40:44.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3677153","author":"Raif.9507","body":"\n<p>Getting Overwolf on Mac is a difficult one. We’re discussing this, but it isn’t something we’re planning for a long while.</p>","arenanet":false},{"pubDate":"2014-02-20T19:04:47.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3666155","author":"smiley.1438","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on June 23 2013 08:27AM\"><a href=\"/forum/community/api/Map-API-Mumble-Mashup/2266136\">Cliff Spradlin.3512:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on June 23 2013 06:10AM\"><a href=\"/forum/community/api/Map-API-Mumble-Mashup/2265821\">Killer Rhino.6794:</a></cite></div><div class=\"quotey\"><p>Having trouble getting this working in OS X. Cliff, can you verify that the Mac client is writing values to the shared memory object just as the PC version does during its update loop?</p>\n<p>If I have Mumble open on my Mac, I’m able to at least get an empty linker object. I didn’t think having Mumble was necessary, but either way, the linker object isn’t being updated with any game values.</p></div></blockquote>\n<p>It definitely won’t work on the Mac, unless you can hook into the transgaming win32 layer somehow. That’s probably very difficult to do, if it’s possible at all.</p></div></blockquote>\n<p>Are you sure that Mac overlay is using the Mumble API to get the position data and not some obscure hacks? (Cliff explained roughly somewhere else)</p>","arenanet":false},{"pubDate":"2014-02-20T17:45:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3665766","author":"Lazarus.9716","body":"\n<p>It would be awesome if we could use it on the Mac too.  Mumble already has an overlay that works, so it’s definitely possible.  You could check out their source code on  GitHub and figure out how much work it would be.</p>","arenanet":false},{"pubDate":"2014-02-20T15:58:28.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3665290","author":"Raif.9507","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on February 18 2014 10:03AM\"><a href=\"/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3652432\">smiley.1438:</a></cite></div><div class=\"quotey\"><p>I have an Overwolf-App in development which combines <a href=\"https://forum-en.guildwars2.com/forum/community/api/Gw2-Location-Tracker/first#post2379754\">our location tracker</a> and <a href=\"https://chillerlan.net/gw2/wvw.html\">my wvw stats/maps app</a>. I didn’t plan to release it yet because i’m still waiting on a response by the Overwolf team about the possibilities to receive the <a href=\"http://feedback.overwolf.com/forums/235154-feature-requests/suggestions/5262764-mumble-integration\">mumble link data via Overwolf</a>. Currently you’d need a 3rd-party app to send location data which is what i want to avoid (begging users to install a software for use with a game… no way.).</p></div></blockquote>\n<p>Yea I get that. I know your in contact with our devs already trying to get that up and running, can’t wait!</p>\n<p>Anyone else have something they think would be cool to use?</p>","arenanet":false},{"pubDate":"2014-02-18T10:03:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3652432","author":"smiley.1438","body":"\n<p>I have an Overwolf-App in development which combines <a href=\"https://forum-en.guildwars2.com/forum/community/api/Gw2-Location-Tracker/first#post2379754\">our location tracker</a> and <a href=\"https://chillerlan.net/gw2/wvw.html\">my wvw stats/maps app</a>. I didn’t plan to release it yet because i’m still waiting on a response by the Overwolf team about the possibilities to receive the <a href=\"http://feedback.overwolf.com/forums/235154-feature-requests/suggestions/5262764-mumble-integration\">mumble link data via Overwolf</a>. Currently you’d need a 3rd-party app to send location data which is what i want to avoid (begging users to install a software for use with a game… no way.).</p>","arenanet":false},{"pubDate":"2014-02-18T07:41:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3652148","author":"Raif.9507","body":"\n<p>There is a WvW timer made by 2 different guys already in our app store! You should check it out see if that’s what you mean.</p>","arenanet":false},{"pubDate":"2014-02-18T01:27:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3651419","author":"ArtemusHunter.9521","body":"\n<p>I use overwolf most of the time when on gw2 or other games. Awesome little program! Maybe it could have some sort of app that works with WvW? Idk if such an app exists and I’m not one that’s good with programming/designing/creating apps, but its an idea.</p>\n<p>Maybe something small that keeps track of the keeps, camps, towers and SM and which server(by colour) has which. You could make it a small little thing that we could place somewhere in one of the corner’s of the screen or something? Idk, rough idea. I don’t know how useful that would be for the WvW-er’s, but I would assume it would be at least in some way.</p>","arenanet":false},{"pubDate":"2014-02-17T07:33:07.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/New-Overwolf-apps-for-GW2-looking-for-ideas/3648364","author":"Raif.9507","body":"\n<p>Hey all!</p>\n<p>My name is Raif, I’m the Community Manager over at Overwolf.</p>\n<p>Just some info on Overwolf: We’re a software platform that overlays into your game (just graphically, doesn’t violate GW2 TOS) and gives you some cool apps in game like a video recorder, Teamspeak overlay, music player, Facebook chat, direct uploads to YouTube or Facebook, a Twitch streaming app and some GW2 apps like WvW timers and guides.  You can check us out at www.Overwolf.com</p>\n<p>We’re looking for some new ideas as far as apps for GW2 for people to develop (even you guys, we have an open SDK so anyone can make an app using the GW2 API and use our SDK to make an app for the platform) and there is no one better to ask then you all here. We want to get ideas for things that you guys would use and like to see so that people who want to develop apps can make them.</p>\n<p>What kind of apps do you wish you had in game for GW2? Let us know!</p>","arenanet":false}]}