{"title":"Personal damage meter API?","pubDate":"2013-12-10T18:16:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Personal-damage-meter-API","comments":[{"pubDate":"2013-12-13T18:00:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Personal-damage-meter-API/3368019","author":"Healix.5819","body":"\n<p>The combat log would never be a part of the API since it would be very inefficient and a waste of resources. They could push the data to you in real time as an always connected data stream, but even then it would be redundant since that data is already sent to your client.</p>\n<p>If they were going to allow DPS meters, they would simply allow writing the combat log to a text file. The combat log would have to be improved first though, which is something I doubt will ever happen.</p>","arenanet":false},{"pubDate":"2013-12-11T19:56:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Personal-damage-meter-API/3356005","author":"rodadams.5963","body":"\n<p>While OAuth2 is coming (someday….), I have no idea where on the list of things to put out would be the ability to echo the combat log. That seems like such a different beast, and not really a good fit for the OAuth2 API model.</p>\n<p>Things that seem a much better fit:<br>\n- Character List, with basic stats (level, skl pts, crafting levels)<br>\n- Other forms of Character Progress (zone completion, skill unlocks, etc)<br>\n- Inventory listings (Equipped, Character Bags, Personal Bank)<br>\n- TP Buy/Sell order status.</p>\n<p>All of these are things which change rarely, and can be ‘pulled’ for the current values, and it holds relevance.</p>\n<p>A DPS meter, however, would require pulling the combat log (which is still missing many things), and then computing it. For what people would want it for, that would mean making a hit to thier web API basically every second.</p>","arenanet":false},{"pubDate":"2013-12-11T04:50:37.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Personal-damage-meter-API/3351448","author":"Swagger.1459","body":"\n<p>thanks for the response!</p>","arenanet":false},{"pubDate":"2013-12-10T21:46:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Personal-damage-meter-API/3348699","author":"Tanis.5134","body":"\n<p>ArenaNet is working on <a href=\"https://forum-en.guildwars2.com/forum/community/api/API-Development-Plans/first#post2081787\">bringing OAuth2 to the APIs</a>, which would allow us to get information such as this.</p>\n<p>About a month ago, the OAuth2 implementation was “basically complete”, but the APIs that go with it were not (<a href=\"https://forum-en.guildwars2.com/forum/community/api/OAuth-Status/first#post3211636\">see here</a>).</p>\n<p>No information has been provided on what information will be coming with OAuth, but you definitely won’t be getting player health information until then.</p>","arenanet":false},{"pubDate":"2013-12-10T18:16:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Personal-damage-meter-API/3346803","author":"Swagger.1459","body":"\n<p>Where is the personal damage meter API?</p>\n<p>Edit- any combo personal/pet damage meters floating around as well?</p>","arenanet":false}]}