{"title":"QOL Bank Viewer","pubDate":"2013-09-14T16:14:44.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/QOL-Bank-Viewer","comments":[{"pubDate":"2013-09-20T23:41:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/QOL-Bank-Viewer/2884396","author":"Stephane Lo Presti.7258","body":"\n<p>Hi,</p>\n<p>We do not allow discussion of a non-technical nature in the API Development subforum, as per the rules explained in <a href=\"https://forum-en.guildwars2.com/forum/community/api/Welcome-to-the-API-Development-subforum/\">this thread</a> We’re actually not inviting suggestions for the community of API developers (the Suggestions subforum is only for players suggesting things about the GW2 game) so there’s unfortunately no place for a topic like this on the GW2 forums. We suggest that you directly contact API developers to discuss these suggestions.</p>\n<p>Thanks for your understanding.</p>","arenanet":true},{"pubDate":"2013-09-14T22:56:13.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/QOL-Bank-Viewer/2839481","author":"rodadams.5963","body":"\n<p>Being that this is per character/account information, and not general “public” information, it is waiting on at least the OAuth2 implementation to be released.<br>\nWe’ve heard word that OAuth2 is being developed, but no timeframe for release has been announced, nor exactly what fuctionality will be included with it.</p>","arenanet":false},{"pubDate":"2013-09-14T16:14:44.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/QOL-Bank-Viewer/2837783","author":"Feeble.4632","body":"\n<p>I’m not an api developer but I have a suggestion that I could not find elsewhere.</p>\n<p>I would like to have  a way to view the materials/ and or contents in my bank on a second screen or mobile device. Since the game has so many reasons to keep track of large amounts of mats (ie legendary crafting, crafting in general, and tradepost turn arounds), it would be nice to have an at a glance view of what is in your bank even if you could not interact with it.</p>\n<p>If this already exists, please point me in the direction because it sure would be helpful while running around Tyria.</p>\n<p>Thanks</p>","arenanet":false}]}