{"title":"Request: View guild bank log","pubDate":"2016-04-18T19:03:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Request-View-guild-bank-log","comments":[{"pubDate":"2016-04-18T23:11:39.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Request-View-guild-bank-log/6102641","author":"Roytazz.5932","body":"\n<p>Well I guess im also being stupid for not properly examining the raw JSON, because it does indeed include the stash log entries.</p>\n<p>This does however let me find an undocumented property. In case the value of <em>type</em> is <em>‘stash’</em> there is an extra property called <em>coins</em>. Looking at the <a href=\"https://wiki.guildwars2.com/wiki/API:2/guild/:id/log\">Guild log doc</a> I could not find any documentation about it.<br>\nThought that might be of use for others.</p>\n<p>Thank you for your help!</p>\n<p>EDIT: After examining the JSON, I found serveral other properties that are not documented on the wiki, but are documented on the <a href=\"https://github.com/arenanet/api-cdi/blob/master/v2/guild/log.js\">Github</a> page.</p>","arenanet":false},{"pubDate":"2016-04-18T21:35:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Request-View-guild-bank-log/6102466","author":"Lawton Campbell.8517","body":"\n<p>I thought there was an open github issue or pull request, but there isn’t. Anyway, someone asked for this awhile back, and I’m looking to deploy it late this week or early next week. When I push the new code out we’ll have “stash” events in /v2/guild/:id/log.</p>\n<p>EDIT: I am stupid and this has already been deployed — I blame post-lunch sleepiness — there should already be “stash” events in there. Those should be emitted for all the guild storages. If you seem to be missing events, shoot me your guild ID via PM or in the thread and I’ll figure out what’s gone wrong.</p>","arenanet":true},{"pubDate":"2016-04-18T19:03:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Request-View-guild-bank-log/6102221","author":"Roytazz.5932","body":"\n<p>Can we get the possibility to read the guild bank log using the API?<br>\nI know we can already get the guild vault info but I’d like to also get the logs for the Guild Stash, Treasure Trove and Deep Cave.</p>","arenanet":false}]}