{"title":"Return proper error codes","pubDate":"2013-05-22T14:20:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes","comments":[{"pubDate":"2013-10-03T18:54:45.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2961806","author":"Stefan Larimore.6872","body":"\n<p>Thanks for the feedback guys.</p>\n<p>Dr. Ishmael, your argument is interesting: just return 200, 404, and 5XX and let the caller parse the results for details.</p>\n<p>However, I do think keeping 200 for truly ‘success’ cases makes sense because internally we have one-and-only-one ‘success’ code used across the gw2.  So this will always translate correctly and it doesn’t prevent anyone who wants to treat 4XX and 200 the same, relying instead on parsing the JSON for errors.</p>","arenanet":true},{"pubDate":"2013-10-02T16:31:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2955305","author":"Dr Ishmael.9685","body":"\n<p>I don’t really understand why HTTP errors are being returned at all, except for explicit 5xx server errors and 404 errors for non-existent endpoints (e.g. /v1/character_data.json).  (And 401 for authentication issues on OAuth2-enabled endpoints.)  As I see it, an API error is not an HTTP error – the endpoint was reached successfully, so the HTTP status should always be 200.  If the client supplied misspelled parameter names or invalid parameter values, those errors should be returned in the JSON content, not as an HTTP error code.</p>\n<p>It seems like this would simplify things a bit.  At the HTTP level, the client only needs to worry about handling 5xx and 404 error codes, which indicate that no response can be returned at all.  Any other valid request should return HTTP 200, in which case  the client should then check the JSON content to see if an API error was returned.</p>","arenanet":false},{"pubDate":"2013-10-02T15:20:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2954907","author":"smiley.1438","body":"\n<p>I don’t usually quote myself but i think it fits this topic:</p>\n<blockquote><div class=\"quotey\"><p>The 500 error which is thrown on any API error is somewhat misleading anyway. No matter if it’s a user error like wrong or missing params (could possibly end up in a 416), items not found (maybe a 416 as well, a 404 would be inappropirate) or “real” server errors (which are actually 500).</p></div></blockquote>\n<p><a href=\"https://forum-en.guildwars2.com/forum/community/api/Bug-in-Items-api/2622811\">https://forum-en.guildwars2.com/forum/community/api/Bug-in-Items-api/2622811</a></p>","arenanet":false},{"pubDate":"2013-10-02T12:49:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2954183","author":"Lil Puppy.5216","body":"\n<p>If I request an id that doesn’t exist, that is the designers problem for deleting items and not using the ID again; but since it doesn’t exist, a 404 is expected on my front end so I can tell the user that item doesn’t exist.</p>\n<p>If there is actually an internal error on the server I expect a 5xx.</p>\n<p>All other errors are my fault and should be 4xx and I don’t particularly care which one since I’m only checking for the first number of the error code (4).<br>\nIn all those cases and timeouts, the user doesn’t get to see anything and ultimately it is my problem for not getting the data properly.</p>\n<p>It is nice to get 5xx so I can tell the user that the service is currently down or the more friendly: “We are experiencing high demand at the moment, please check back in a few minutes”.</p>\n<p>A non 404 4xx probably means I screwed up and I’ll try one more time to get the data just in case it wasn’t me. A second fail without a 404 and I tell the user “Please check your spelling…”<img src=\"/include/images/smilies/wink.png\"></p>\n<p>I only really care about 200, 404, and 500. Anything else is extraneous programming on both our parts. If an error happened, toss me some more detailed info and we’re both happy<img src=\"/include/images/smilies/smile.png\"> The number of the error doesn’t do me much good but the detail info does both of us good.</p>","arenanet":false},{"pubDate":"2013-09-26T19:36:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2919572","author":"Stefan Larimore.6872","body":"\n<p>Hi There,</p>\n<p>I’d like to address this 500 error problem a bit:</p>\n<p>My proposal is to only return 500 on a relatively small set of known internal errors.  Otherwise, I assume it is user error and return 400.  I thought about trying to map to more granular HTTP errors, but as Cliff posted above it is a difficult and un-maintainable job.</p>\n<p>With my proposed fix, it is still possible that I missed a few “internal” errors which will come back as 400.  But as before, the error details will be provided in both 400 and 500 cases.   I can always add more errors to the “internal” set as needed.  In general, there are many more “user-error” than “internal-error” type codes in our system.</p>\n<p>When authenticated APIs come out, I will likely introduce the 401 error code as well.</p>\n<p>Any thoughts on this?</p>","arenanet":true},{"pubDate":"2013-05-24T15:33:10.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2085141","author":"zwei.9073","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 22 2013 04:04PM\"><a href=\"/forum/community/api/Return-proper-error-codes/2073965\">Cliff Spradlin.3512:</a></cite></div><div class=\"quotey\"><p>Having errors map to more specific HTTP status code is a good idea, but the reality is that we have many more complex error codes than we can map to HTTP statuses, and the errors may originate from backend servers that have no knowledge of HTTP.</p></div></blockquote>\n<p>You can only have fairly generic mapper and still give full error report in body of document, just like you do with code 500</p>\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 22 2013 04:04PM\"><a href=\"/forum/community/api/Return-proper-error-codes/2073965\">Cliff Spradlin.3512:</a></cite></div><div class=\"quotey\"><p>In other words, if you have a web server that talks to our API and returns results to a web browser, and you receive an error from us, try to send that error to the browser instead of swallowing it and generating your own error.</p></div></blockquote>\n<p>I think that “item not found” should not be considered error.</p>\n<p>Or rather, it is error in use of API by third party rather than error in service and as such is not error message, but info message for them.</p>\n<p>Of course, it is often difficult to determine which is which.</p>","arenanet":false},{"pubDate":"2013-05-22T22:56:44.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2075575","author":"AlSquire.9203","body":"\n<p>Sure, a 4xx is expected because it is client side error, and 400 fits with the error description “invalid match_id”, no objection.</p>\n<p>Or maybe 418 is better… dunno.</p>","arenanet":false},{"pubDate":"2013-05-22T16:04:45.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2073965","author":"Cliff Spradlin.3512","body":"\n<p>Having errors map to more specific HTTP status code is a good idea, but the reality is that we have many more complex error codes than we can map to HTTP statuses, and the errors may originate from backend servers that have no knowledge of HTTP.</p>\n<p>Generally the way error handling should work is this:</p>\n<pre><code>\nresult = get(/v1/events.json?event=123);\nif (result != 200) {\n    error = parseJson(resultBody);\n    if (error)\n        showErrorToUser(error);\n    return;\n}\n\n</code></pre>\n<p>Our error handling policy is to try to show the original error information to the user instead of hiding it. If a user reports a bug and includes the error code, there’s a good chance that we will be able to figure out the problem.</p>\n<p>In other words, if you have a web server that talks to our API and returns results to a web browser, and you receive an error from us, try to send that error to the browser instead of swallowing it and generating your own error.</p>\n<p>OK, on a separate topic this thread made me realize that error 500 was a bad choice. I propose changing the APIs to return error 400 instead.</p>","arenanet":true},{"pubDate":"2013-05-22T16:04:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2073961","author":"AlSquire.9203","body":"\n<p>I was implying that the stackoverflow thread (especially the most voted answer) convince me that 404 is appropriate even with the id part in a querystring. But ultimately it’s an API design choice.</p>\n<p>(I’m used to the /stuff/id pattern so ?xxx_id=123 feels a little weird to me ^^)</p>","arenanet":false},{"pubDate":"2013-05-22T15:36:54.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2073812","author":"The Talcmaster.7391","body":"\n<p>Thank you for the technical correction on the definition of a 404, Fror.  Nonetheless, it doesn’t change the appropriateness of it as the error code to return.  I would say that if we were using a myriad slashes to locate something (as AlSquire pointed out) that it would be more appropriate to use a 404.  Since we are passing parameters, I would say it makes more sense to use something else if a parameter is invalid.</p>","arenanet":false},{"pubDate":"2013-05-22T15:34:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2073797","author":"Fror.2163","body":"\n<p>All the resources you show somehow use REST. This API doesn’t provide REST. So Anet is free to use the query string part.</p>\n<p>The 404 is valid for a query string part since the HTTP protocol doesn’t say anything about that.</p>","arenanet":false},{"pubDate":"2013-05-22T15:18:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2073699","author":"AlSquire.9203","body":"\n<p>404 seems a good choice to me, but it made me wonder if this is more relevant to an URI without a querystring (something like <a href=\"https://api.guildwars2.com/v1/wvw/match_details/1.json\">https://api.guildwars2.com/v1/wvw/match_details/1.json</a> )</p>\n<p>Seems not, as it is discussed here : <a href=\"http://stackoverflow.com/questions/3821663/querystring-in-rest-resource-url\">http://stackoverflow.com/questions/3821663/querystring-in-rest-resource-url</a></p>\n<p>Also I found this <a href=\"http://www.restapitutorial.com\">site</a> which discuss REST API creation and <a href=\"http://www.restapitutorial.com/httpstatuscodekittenml\">different status codes</a>. Can be useful.</p>","arenanet":false},{"pubDate":"2013-05-22T15:01:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2073606","author":"Fror.2163","body":"\n<p>The Talcmaster, you are wrong. 404 means that the resource cannot be found. This is typically a case where a resource cannot be found. See <a href=\"http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.4.5\">http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.4.5</a></p>","arenanet":false},{"pubDate":"2013-05-22T14:51:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2073548","author":"The Talcmaster.7391","body":"\n<p>It wouldn’t be a 404, because that would mean the page match_details.json doesn’t exist.  A 400 (which some of them already use) would be a better choice, since that usually means a syntax error.  Since we’re on the subject of error codes, a 429 (Too Many Requests) would probably be a good idea if they ever feel the need to impose a rate limit on any part of the API</p>","arenanet":false},{"pubDate":"2013-05-22T14:40:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2073508","author":"Ruhrpottpatriot.7293","body":"\n<p>Thumbs up for this.</p>","arenanet":false},{"pubDate":"2013-05-22T14:20:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Return-proper-error-codes/2073396","author":"Fror.2163","body":"\n<p>Hi,</p>\n<p>I tried calling the following url: <a href=\"https://api.guildwars2.com/v1/wvw/match_details.json?match_id=1\">https://api.guildwars2.com/v1/wvw/match_details.json?match_id=1</a> I received an error 500.</p>\n<p>Since the match with id 1 doesn’t exist either, you should return an error 404, telling me that I made a mistake, not that you made an error while searching for the erroneous input I gave.</p>","arenanet":false}]}