{"title":"Simple but important ideas for HUD off play.","pubDate":"2014-04-10T19:57:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Simple-but-important-ideas-for-HUD-off-play","comments":[{"pubDate":"2014-04-10T20:12:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Simple-but-important-ideas-for-HUD-off-play/3880683","author":"smiley.1438","body":"\n<p>You win no prize at all because it’s the wrong subforum. Now that the game suggestions subforum has been closed, you should give it a try in the main GW2 discussion forum (or maybe a moderator will move the post there).</p>","arenanet":false},{"pubDate":"2014-04-10T19:57:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Simple-but-important-ideas-for-HUD-off-play/3880643","author":"Voluptus.3509","body":"\n<p>After I ran this by an Arenanet employee in game the employee asked me to be sure to put this suggestion up in the forums because s/he felt that:</p>\n<p>a) The idea would greatly improve the quality of play.<br>\nb) The implementation should, that is <em>should</em>, be easy and fairly painless.<br>\nc) It’s an idea that, once you think about it, actually is necessary for no-HUD play.</p>\n<p>The idea is simply this:</p>\n<p>1) With the HUD on the chat has, in OO coding terms, a “.visible” property. For some reason the ability to toggle the chat is dependant on what I can refer to as:</p>\n<p>if (HUD.visible==“True”)</p>\n<p>Why? Even without a HUD you should still be able to talk to other players. Speaking to each other is not an electronic enhancement the way a minimap or ground targeting circle is.</p>\n<p>2) When the HUD is off there is no way to know if you are dieing. Really? Even if you took away all my character’s electronic enhancements that you see in the HUD I think the character would know if his arm was half chopped off and he needed to throw a heal. As it stands, wihtout the HUD you have no idea if you’re injured or not. Therefore, the health bar should be able to be toggled even if the HUD is off, just as the chat window should be.</p>\n<p>Here are the reasons these things are needed and how they would make a positive difference:</p>\n<p>- If I’m running around I personally prefer to use the M map and then actually look around at the landmarks to navigate, <em>exactly the same way I have to navigate when I’m out for a hike in real life.</em> This results in feeling as if I’m actually <em>exploring</em> a new place that I’ve never been instead of just running to the next POI or waypoint that I need for map completion.</p>\n<p>- If I don’t have tags above the AI mobs then I have to open my eyes and look at everything to make sure I don’t stumble into a hornet’s nest and you know what?</p>\n<p>I actually notice all the detail that went into the world of GW2. It’s really amazing how much people never notice <em>when their heads are buried in a HUD and a minimap.</em> Running around staring at the minimap may get you around quickly but you miss out on seeing a lot of things in the world that make you stop and say “Wow… WOW!”</p>\n<p>Have you ever gone to NE Metrica province and looked up? Way, way up? Try it sometime. That’s the kind of thing you notice when you’re looking around instead of at a minimap.</p>\n<p>The quality of the experience goes way, way up when I turn off the HUD and zoom in as much as I can… but the fact that I can’t communicate with anyone is worse than inconvenient. The fact that I don’t know when I’m hurt and need to use a heal is just absurd. After all, it would <strong>hurt</strong> to have my leg hacked off!</p>\n<p>chat.visible should be usable regardless of the status of the HUD.visible variable and there should also be a Health.visible and it too would be able to be toggled regardless of HUD.visible’s state.</p>\n<p>Thanks for reading this and I hope it’s as easy to implement as I believe it <strong>should</strong> be. (Hate that word “should”…. )</p>\n<p>P.S. : Actually no, I’m not an RP’er. I’m a guy who has spent years navigating by sight as I explored thousands of acres of forest in real life. I found that the game has much the same feel if the HUD is off and I zoom in as much as possible. <em>I like that feeling…</em> and would use it as often as possible if only I could see the chat and my health.</p>\n<p>Oh, and being able to zoom the camera all the way in to 0 would be great too. Come on, I know it’s possible… I already make it happen by standing next to a wall and rotating the camera and just want to be able to do it without being next to a wall.</p>\n<p>Am I the 1,000,000th person to ask for a zoom to first person ability? If so, do I win a prize? :p</p>","arenanet":false}]}