{"title":"skill_id","pubDate":"2013-09-28T14:22:04.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/skill-id","comments":[{"pubDate":"2013-09-29T17:40:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/skill-id/2935103","author":"Arcades Saboth.5139","body":"\n<p>Thank you for your reply. I guess right now there is no way to retreive those data except to map by myself those missing buff.<br>\nI hope they are only related to the common prefixes, like Rabid for the example above about the Tome and so on for the others.</p>","arenanet":false},{"pubDate":"2013-09-28T15:30:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/skill-id/2929335","author":"Dr Ishmael.9685","body":"\n<p>We’d have to corner an Anet dev to find out why they did it like this, but that’s how Magic Find (before it got removed this month) was applied to equipment from the beginning – a buff effect (all effects are skills) that is always active while the item is equipped.</p>\n<p>When they added stat prefixes with Boon Duration and Condition Duration, those got added the same way, with an always-active buff. (<a href=\"https://api.guildwars2.com/v1/item_details.json?item_id=38317\">example</a>)</p>\n<p>When they made ascended trinkets, the base item’s attributes were handled normally, but they used a buff to add the “baked-in” upgrade component’s attributes.  Originally these were displayed separately in the item’s description, such that <a href=\"http://wiki.guildwars2.com/wiki/Tome_of_the_Rubicon\">Tome of the Rubicon</a> would show 2 entries for each attribute.  <a href=\"http://wiki.guildwars2.com/wiki/File:Ascended_example.png\">This image</a> on the wiki still shows the old style.  Anet changed this on <a href=\"http://wiki.guildwars2.com/wiki/Game_updates/2013-05-28\">May 28, 2013</a> to only show one entry per attribute.</p>","arenanet":false},{"pubDate":"2013-09-28T14:22:05.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/skill-id/2929030","author":"Arcades Saboth.5139","body":"\n<p>Hello,<br>\nI was playing with the API because I’m going to code a tool (in Qt/C++) to help the crafting. I realize there are plenty of other working tools but this is not the point.</p>\n<p>I decided to create a database (sqlite) to hold all the information gathered from the various API endpoints and I stumbled in a problem.</p>\n<p>I converted the item_id for the Tome of the Rubicon from it’s game code (from the wiki) and it is 37007. If I retreive the item detail from the api <a href=\"https://api.guildwars2.com/v1/item_details.json?item_id=37007\">https://api.guildwars2.com/v1/item_details.json?item_id=37007</a> I have the details.</p>\n<p>The attributes from these info are 24 Malice, 17 Precision, 16 Toughness which seems to be wrong. If we add the values from the ones in the description we get the proper values.<br>\nThe missing values, however, are not in the description but in that “buff” properties that I never seen in other items (I get few items right now just for test).</p>\n<p>That property give a strange buff with a skill of ID 15741.<br>\nFollowing the wiki page I created a game link for this skill: [&amp;B309AAA=] that, wrote in the game, give a skill without name that gives the missing properties.</p>\n<p>So the tome is composed of the values from this skill (which, I guess, it’s always active) and the values give by the item itself.</p>\n<p>Now my question is: for the beard of Merlin… why??<br>\nThis is quite a big problem for me: how many other items use these passive skills instead of the proper values from the “attributes” array?</p>\n<p>I fear there are many items that share this problem (I didn’t test but I bet every ascended item have this behavirou) but there is no API that let us discover the skill properties.<br>\nShould I get the values in-game everytime I discover a “buff” section like this?</p>\n<p>Thank you for the help.</p>","arenanet":false}]}