{"title":"Success point","pubDate":"2015-05-21T05:50:39.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Success-point","comments":[{"pubDate":"2015-09-27T17:45:29.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Success-point/5536921","author":"nama.2419","body":"\n<p>No news about wvw rank into the api? For a moment i can give only pvp_rank<img src=\"/include/images/smilies/sad.png\"></p>","arenanet":false},{"pubDate":"2015-05-21T19:50:00.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Success-point/5088175","author":"Lawton Campbell.8517","body":"\n<p>Not a bad idea, actually. That permission could also expose the completed achievements list for the account too, as well as the upcoming masteries and stuff.</p>","arenanet":true},{"pubDate":"2015-05-21T18:32:51.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Success-point/5087952","author":"rodadams.5963","body":"\n<p>I think I see the ‘account’ scope as being something pretty basic, and being something that is on by default, and completely harmless.</p>\n<p>Meanwhile, I consider my achievement history to be something fairly private, and also something which is separate from other tasks. Reviewing my TP efficiency doesn’t need to look at this. Checking my gear for a build doesn’t. Basically, nothing except an explict tracker for such things would need it, so having a separate scope makes sense.</p>\n<p>I’d name it “Account Progression”, and have all of the AP and XvX Ranks included.</p>","arenanet":false},{"pubDate":"2015-05-21T18:08:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Success-point/5087896","author":"Bugabuga.9721","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 21 2015 05:26PM\"><a href=\"/forum/community/api/Success-point/5087726\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p>Yeah, I want to put achievement points, wvw rank and pvp rank somewhere. I’m not sure if they should be on the normal “account” scope though, not sure where to put ’em.</p></div></blockquote>\n<p>Why not add “account statistics”  scope, where achievement and age info can reside?</p>","arenanet":false},{"pubDate":"2015-05-21T17:26:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Success-point/5087726","author":"Lawton Campbell.8517","body":"\n<p>Yeah, I want to put achievement points, wvw rank and pvp rank somewhere. I’m not sure if they should be on the normal “account” scope though, not sure where to put ’em.</p>","arenanet":true},{"pubDate":"2015-05-21T11:56:59.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Success-point/5086653","author":"Sich.7103","body":"\n<p>Yes I speak about achievements. <br>\nBut I do not try to protect personal bank data… With a little precaution this is enough to ensure that this guy is on the good server. Just try to ensure that one API key is only used once and it’s locked with the account name.<br>\nThe API Key is a personnal data, user don’t have to distribut the key everywhere. <br>\nAnd yes you can always try to brute force to find some valid keys but and then ? If this key is already registred on the app then it’s useless to have it.</p>\n<p>Again, ensure that someone is on the good server is not about national security. This API key is enough for my usage.</p>","arenanet":false},{"pubDate":"2015-05-21T10:44:28.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Success-point/5086538","author":"Slyfer.6478","body":"\n<p>First of all i think you’re referring to Achievement Points. <br>\nSecond, you can’t use the api keys as a way to authenticate a real gw2 user. Someone could of just borrowed a friends api key. The api keys in it’s current state is only useful as an optional feature for websites (the implementation on gw2shinies is decent, since there’s no malicious reason to lie about your key, haven’t tested how it deals with duplicate accounts with same key). <br>\nTo sum up, don’t use api keys as a way to authenticate real gw2 users – it’s currently useful for overlay/tracker/calculator/analyzer type apps and anything that isn’t dependent on the validation flaw.</p>","arenanet":false},{"pubDate":"2015-05-21T05:50:39.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Success-point/5086051","author":"Sich.7103","body":"\n<p>Hello,</p>\n<p>I would like to know if this will be possible in the next future to get the success point of the player when we make a request with the API ?<br>\nIn WvW there is a lot of player buying new account just to connect to other server and ask for access on TS / Forum. If we can check that the player have at least 2k success point we can avoid some of these account, just created to spy.</p>","arenanet":false}]}