{"title":"Suggestion: Game Messages API","pubDate":"2013-12-27T22:11:36.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Suggestion-Game-Messages-API","comments":[{"pubDate":"2014-01-22T16:15:14.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Suggestion-Game-Messages-API/3534332","author":"coderjoe.7538","body":"\n<p>@smiley As I said in my post, you’re already authenticated if you’re logged in and have a log present in memory. There’s no need for authentication because the game is running.</p>\n<p>@Pentose hit it right on the nose with the reference to Mumblelink. That’s how that API works and it works great while requiring no authentication at all.</p>","arenanet":false},{"pubDate":"2014-01-02T23:31:12.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Suggestion-Game-Messages-API/3445939","author":"Pentose.3479","body":"\n<p>Smiley, Coderjoe was referring to providing the game message log locally in the form of a file (whether backed by the FS or just memory). This doesn’t require authentication as the information is only available locally. It’s how the Mumblelink position integration works currently.</p>","arenanet":false},{"pubDate":"2014-01-02T17:38:00.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Suggestion-Game-Messages-API/3444469","author":"smiley.1438","body":"\n<p>So, how would you make data available which you can only see when you’re logged to your account? Right, via OAuth.<img src=\"/include/images/smilies/wink.png\"></p>\n<p>This might give you a glimpse of how it would work (if you’re unfamiliar with OAuth): <a href=\"http://collaboradev.com/2011/04/01/twitter-oauth-php-tutorial/\">http://collaboradev.com/2011/04/01/twitter-oauth-php-tutorial/</a></p>","arenanet":false},{"pubDate":"2014-01-02T16:37:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Suggestion-Game-Messages-API/3444220","author":"coderjoe.7538","body":"\n<p>My suggestion doesn’t require OAuth at all. It just requires existing data (that you can only see when logged in) be exposed (only after you’ve logged in). :P</p>","arenanet":false},{"pubDate":"2013-12-27T23:05:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Suggestion-Game-Messages-API/3426603","author":"smiley.1438","body":"\n<p>When the API finally supports OAuth, things like these become possible.</p>\n<p>MAKE IT HAPPEN, Anet!</p>","arenanet":false},{"pubDate":"2013-12-27T22:11:36.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Suggestion-Game-Messages-API/3426431","author":"coderjoe.7538","body":"\n<p>I’ve been watching over the list of things people want, and the list of things I’d like to develop, and I’ve noticed some interesting things.</p>\n<p>Most of the functionality people have requested from an in game API is provided in some way, shape, or form, by the Game Messages that are spit out in the chat window (if the game messages are enabled).</p>\n<p>Things this could provide:</p>\n<ul>\n\t<li>items acquired</li>\n\t<li>damage done per target</li>\n\t<li>skill rotations</li>\n\t<li>etc..</li>\n</ul>\n<p>If the game messages were updated to also list the name of the item salvaged before it listed the items acquired it could even be used to track inventory!</p>\n<p>With this in mind I ask you arenanet… PLEASE please please, add item salvages to the in game message log, and then expose the in game message log as something like a text file that is truncated every time you start the game… OR, an windows memorymapped file.</p>\n<p>Something that we as developers can read and parse. Nothing more complex needs to be done at this point to enable a wide swath of add-ons to be developed without violating the terms and agreements players agree to!</p>","arenanet":false}]}