{"title":"TBD event.","pubDate":"2014-04-06T09:12:15.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/TBD-event","comments":[{"pubDate":"2014-04-08T16:55:22.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/TBD-event/3871728","author":"munkiman.3068","body":"\n<p>TBD is Mordremoth, ofc….</p>","arenanet":false},{"pubDate":"2014-04-06T21:37:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/TBD-event/3864726","author":"Ice of Dragons.1637","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on April 06 2014 05:13PM\"><a href=\"/forum/community/api/TBD-event/3863934\">Killer Rhino.6794:</a></cite></div><div class=\"quotey\"><p>You’ll probably want to remove the app from the App Store by April 15th, since the established APIs will no longer be relevant after that, and update accordingly. Afterwards, you’ll need to evaluate the API changes in relation to your app. It’s all pretty common sense stuff.</p>\n<p>Do you use, or have looked at, GW2Kit?</p></div></blockquote>\n<p>The app will be updated in whole. Maybe there will be a day + but i will notice the user. Not shure how long the waiting time is atm for apple. I will not rellease uncofirmed stuff. Yust wondering if there would be something special to include. I agree that the apps should be done right.</p>","arenanet":false},{"pubDate":"2014-04-06T17:13:10.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/TBD-event/3863934","author":"Killer Rhino.6794","body":"\n<p>You’ll probably want to remove the app from the App Store by April 15th, since the established APIs will no longer be relevant after that, and update accordingly. Afterwards, you’ll need to evaluate the API changes in relation to your app. It’s all pretty common sense stuff.</p>\n<p>Do you use, or have looked at, GW2Kit?</p>","arenanet":false},{"pubDate":"2014-04-06T17:11:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/TBD-event/3863927","author":"Ice of Dragons.1637","body":"\n<p>I agree whit u on the dynamic sistem. But i was wondering if TBD would be important on release. I need to send the app asap and will do this statically and add the dinamicly dolodable stuff in a few weeks.</p>","arenanet":false},{"pubDate":"2014-04-06T10:44:16.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/TBD-event/3862923","author":"Healix.5819","body":"\n<p>It’s probably just a empty slot for future purposes. I assume it’ll be filled sometime during season 2, if they actually introduce a new zone.</p>\n<p>Why not just either leave it as TBD or disable it. Personally, I don’t include unknown events and instead, use an updateable list while also allowing the user to insert their own. Don’t just hardcode it, because there’ll be even more added in the future, as well as temporary ones.</p>","arenanet":false},{"pubDate":"2014-04-06T09:12:16.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/TBD-event/3862764","author":"Ice of Dragons.1637","body":"\n<p>Hy arena net dudes and ladyes. I am wondering if u guys have an idea yet what TBD will be ? Will it be a rotation or something added later on ? Will it be out on 15th ? I and other developers would like to know since in anticipation of the new mega server event sister we are overhauling our apps websites u name it. I myself am the author of iOS DragonTimer and would like to ask u in case u already know what will TBD be if u send me an any one else developing apps that request it and sign NDA and pinky swear not to tell it, PM what TBD will be, so we can insert int in the APP and make it available on the 15. Since iOS needs to validate my app i need to send it tomorrow/today to be out on 15th. Thank you. And i think the new system for world events will rock.</p>","arenanet":false}]}