{"title":"Theory crafter development","pubDate":"2013-09-08T19:15:39.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Theory-crafter-development","comments":[{"pubDate":"2013-09-15T14:34:39.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Theory-crafter-development/2842378","author":"Astewart.8415","body":"\n<p>This looks great. But for theorycrafting, is there any chance of the tool having a section that shows real theorycrafting values such as DPS against standard Heavy Target, Medium, Light….</p>\n<p>or let’s say Heal Per Second based on healing power, regeneration duration, boon duration buffs etc. etc. ?</p>\n<p>Or what – if scenarios where you can slot powers into a sample rotation and see the outcome with Bleeds applied (resulting damage), Poison (Resulting damage), etc. etc. Or maximum burst damage with a particular rotation. The person making the build can add his own rotations, or someone coming after can play around with whatever’s already there, make his own etc.</p>\n<p>People have made spreadsheets to do approximate calculations of these things, and apparently they translate fairly closely to the target dummies in the heart of the mists.</p>\n<p>I’m just thinking maybe for a “next – gen” theorycrafting tool we could get some real world effects from all the stats and so forth. Some true what-if scenarios.</p>","arenanet":false},{"pubDate":"2013-09-14T11:48:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Theory-crafter-development/2836750","author":"poke.3712","body":"\n<p>Hey, I’m somewhat interested but very limited by time, so I might not be a good help :P</p>\n<p>Anyway, is the project open source? If so, where is it hosted? And if not: Why? I know from experience that getting developers involved is a lot easier when the project is publicly open sourced; ideally on GitHub where the entry-level to submit small pull requests is very low. This would allow people to quickly submit smaller improvements without having to get involved too much into the project.</p>\n<p>E.g. this would be something <strong>I</strong> would be interested in, given that I can’t really make a commitment to whole project of this size, but would still be interested to help from occasionally.</p>","arenanet":false},{"pubDate":"2013-09-14T01:46:24.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Theory-crafter-development/2834973","author":"bob.4983","body":"\n<p>Hey There giffmac! I tried to PM you but as I have never actually signed in and posted on the form the spam prevention is stopping me from doing that… heh… Anyway…</p>\n<p>i am interested in giving you a helping hand. My skills include all of what you are looking for (and then some…). A bit about myself… I am a .NET developer by profession but I know many more languages then that (PHP, Objective-C, Java, Javascript, the list goes one). If you are still in need of help please drop me a message and let me know how I can help out!</p>","arenanet":false},{"pubDate":"2013-09-13T21:11:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Theory-crafter-development/2833449","author":"Stephane Lo Presti.7258","body":"\n<p>A note about your thread: we think that it’s perfectly permissible within this forum. We’ll be monitoring these threads to make sure that the API Dev subforum can focus on technical discussions. We’ll also add this note to the sticky thread.</p>\n<p>Thanks for your work on this GW2 API app!</p>","arenanet":true},{"pubDate":"2013-09-08T19:15:40.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Theory-crafter-development/2801358","author":"griffmac.8625","body":"\n<p>Hi, folks! I understand that this isn’t strictly an API post, but you guys are the people I’m looking for here.</p>\n<p>I submitted a post to the reddit community (<a href=\"http://www.reddit.com/r/Guildwars2/comments/1i5hp6/lfg_to_make_a_social_theory_crafter/\">seen here</a>) in July looking for developers to help create a new skill calculator. They pulled through, and we’ve made a lot of progress. However, there’s still much to do before our first release. You can see our current progress <a href=\"http://stryker2.com/bw2/build.html\">here</a>. This has limitations, of course, and we’re getting skill and equipment selections ready as we speak. Weapon selection is implemented, but buggy for the time being.</p>\n<p>So, I’m submitting a second call for all interested developers to come forward and help make this project become a reality. We’re attempting to make <strong>the</strong> definitive tool for our community, and if you’d like to be a part of that, we’d be happy to have you as a part of our krewe. I asked just reddit before, but I wanted to include this part of the community as well. You’ll see a copy of this post next door in the fan-generated content board.</p>\n<p>We’re looking for people with skills in object-oriented javascript/PHP, a strong knowledge of CSS, a decent knowledge of HTML, and are comfortable with working in PHP/javascript frameworks. You don’t have to have <strong>all</strong> of these skills together, but these are the kind of people we are looking forward to working with.</p>\n<p>This builder is called BLDR, and it stands for the Black Lion Defense Resource. Whether you’re defending Tyria from dragons, your world in the Eternal Battlegrounds, or nodes in the Mists, you need a place to store and find builds for any occasion. The BLDR aims to solve that problem.</p>\n<p>The aim of the project is to make a site that promotes new ideas, a sense of community, and the tools we’ve wanted since day one.</p>\n<ul>\n\t<li>Users will be able to have an <strong>account page</strong> that details the builds they’ve contributed, favorited, and commented on. It serves as the hub for saving your builds on the cloud, sharing them, and perfecting them over time. This page can also list your <strong>characters</strong>, complete with pictures and other information, so others can get a sense of who you are as a player and builder.</li>\n</ul>\n<ul>\n\t<li>The <strong>home page</strong> will feature the newest builds, by default listed by date uploaded, but will have plenty of <strong>filter and search settings</strong> to help you sort through for what you’re looking for. And, like Reddit, there will be an <strong>upvote system</strong> in place to promote what builds have been found the most successful.</li>\n</ul>\n<p>However, vote systems are somewhat tricky – over time, you have a few outdated builds that have hundreds of votes, cluttering a system meant to help keep it organized. This is the kind of thing we’ll have to work out, and I have some ideas as to how to make it more efficient at showing the real trend in success.</p>\n<ul>\n\t<li>The tools available will be as <strong>robust as the leading tools</strong> out there, they <strong>have</strong> to be. However, it being made by designers, it will feature an <strong>intelligent, well-designed interface</strong> created with the users in mind. My goal is to feature new exporting options to help you quickly share your build with friends in-game and online.</li>\n</ul>\n<ul>\n\t<li>Comment sections. Duh.</li>\n\t<li>Following your favorite uploaders, à la Twitch and Youtube style.</li>\n\t<li>Abilities to make hide/show edits to other’s builds. So you can show your suggestions or your slight variant.</li>\n\t<li>Private/public build storage.</li>\n\t<li>PvP, WvW, and PvE build options.</li>\n\t<li>Responsive web design so you can use it on any device, anywhere. Yes, you can theory craft on the toilet from your phone.</li>\n\t<li>Shift-click links to bring up the Wiki page. A feature I’ve missed forever.</li>\n\t<li><strong>Many, many more options and tools I’m waiting to discuss.</strong></li>\n</ul>\n<p>If you’re interested, please feel welcome to <strong>message me</strong> and leave a reply here. We work over skype, so having that readily available is important.</p>\n<p>Thanks for reading!</p>\n<p>-Griffin</p>","arenanet":false}]}