{"title":"Torrenal's Crafting Gadget","pubDate":"2013-07-22T05:19:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Torrenal-s-Crafting-Gadget","comments":[{"pubDate":"2013-07-22T05:19:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Torrenal-s-Crafting-Gadget/2459082","author":"Yamagawa.5941","body":"\n<p>I present to you the Torrenal’s Guild Wars 2 Crafting Gadget.<br>\n <br>\nIt interfaces with the GuildWars 2 API, keeping recipes and items up to date, and loading new recipes as they become available.<br>\nIt contains Mystic Forge Recipes<br>\nIt interfaces with the Trading Post <em>(requires game credentials)</em> downloading current prices for items, and allowing you to determine important things, including:</p>\n<ul>\n\t<li>The most profitable items to craft by Gold earned/unit</li>\n\t<li>The cheapest things to craft for gaining crafting experience</li>\n\t<li>The most profitable items to craft by % profit</li>\n\t<li>The most profitable items to craft by Skill point/karma spent.</li>\n\t<li>Items you can craft and sell to the highest buyer for the most profit.</li>\n</ul>\n<p>It allows  you to weight currencies (such as Karma, Coin and Fractal Relics) to help it decide how to  best build items with complex multi-step recipes, and whether to buy intermediate ingredients from the trading post.  The table columns <em>are</em> configurable  – the screenshots here do not show all columns.</p>\n<p>It also knows currency conversions: Yes, act now and you too can have your own Eternity for a meager price of $1469.88 (via the Gem store to acquire the necessary gold…), or your own omega siege golem for $0.34 and 3 skill points.  <em>Trading Post prices and Gem exchange rates subject to change without notice.</em></p>\n<p>This is built as a Java application, allowing it to run on any platform that is capable of running Guild Wars.<br>\nIt does use the unofficial Trading Post API to retrieve prices, but I patiently await the release of OAuth which should allow me a more…<em>convenient</em> path to pricing data.</p>\n<p>The gadget is available at <a href=\"http://gw2gadget.com\">http://gw2gadget.com</a></p>\n<p>//Torrenal<br>\n  Brought to you by the author of the Torrenal’s Stella Deus Fusion Calculator.</p>","arenanet":false}]}