{"title":"[Under Development]Legendary Tracker","pubDate":"2015-05-15T12:13:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Under-Development-Legendary-Tracker","comments":[{"pubDate":"2015-05-21T15:47:38.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Under-Development-Legendary-Tracker/5087336","author":"Syncez.1536","body":"\n<blockquote><div class=\"quotey\"><p>Hi,<br>\nI’m no programmer at all (just using basic python scripts for speeding up things), so I have no idea if this is possible. But I think it’d be pretty awesome if you could couple the items with current TP prices based on gw2spidy API: <a href=\"https://github.com/rubensayshi/gw2spidy/wiki\">https://github.com/rubensayshi/gw2spidy/wiki</a><br>\nSo something similar to that <a href=\"http://gw2legends.net/\">http://gw2legends.net/</a></p></div></blockquote>\n<p>Hi there. Thanks for your suggestions. It is definitely a possibly and it is already in the list on my original post<img src=\"/include/images/smilies/smile.png\">. At the moment, I’m just trying to get it to a usable state and get the logic between each legendary working well before I add little aesthetics like that<img src=\"/include/images/smilies/smile.png\"></p>\n<p>Edit: The app is purely based on gw2legends.net – I wanted an overlay application to be used in game so it’s definitely heading that way right now!</p>\n<p>Keep your suggestions coming though, even if it sounds ‘impossible’~</p>","arenanet":false},{"pubDate":"2015-05-21T15:08:51.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Under-Development-Legendary-Tracker/5087166","author":"Hylgeriak.8250","body":"\n<p>Hi,</p>\n<p>I’m no programmer at all (just using basic python scripts for speeding up things), so I have no idea if this is possible. But I think it’d be pretty awesome if you could couple the items with current TP prices based on gw2spidy API: <a href=\"https://github.com/rubensayshi/gw2spidy/wiki\">https://github.com/rubensayshi/gw2spidy/wiki</a></p>\n<p>So something similar to that <a href=\"http://gw2legends.net/\">http://gw2legends.net/</a></p>","arenanet":false},{"pubDate":"2015-05-21T07:21:27.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Under-Development-Legendary-Tracker/5086195","author":"Syncez.1536","body":"\n<blockquote><div class=\"quotey\"><p>First, on behalf of the GW2 community, thank you so much for creating a tool for us!<br>\nSecond, I note this will be a .net VS application – I suppose this means to web or contained version, leaving us Mac players out of the fun?<br>\nThanks.</p></div></blockquote>\n<p>:). This is a .net application. The code is currently written in C# .Net and yes, Mac users are a bit at a disadvantage here. On a second note, my partner plays GW2 on a Mac, and she loves the application, which is why I’ve always had the cross-compatibility in mind. So don’t worry, I will port it over….eventually<img src=\"/include/images/smilies/smile.png\"> <em>(in Java)</em></p>","arenanet":false},{"pubDate":"2015-05-20T20:40:46.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Under-Development-Legendary-Tracker/5084746","author":"orenwolf.1953","body":"\n<p>First, on behalf of the GW2 community, thank you so much for creating a tool for us!<img src=\"/include/images/smilies/smile.png\"></p>\n<p>Second, I note this will be a .net VS application – I suppose this means to web or contained version, leaving us Mac players out of the fun?</p>\n<p>Thanks.</p>","arenanet":false},{"pubDate":"2015-05-20T17:14:59.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Under-Development-Legendary-Tracker/5084085","author":"Syncez.1536","body":"\n<p>Thanks for the input guys. <br>\nI’ll keep working on it until something reasonable comes into place. For now, it works fine as it is. Have added these ‘issues’ and recommendations to my dev cycle. I’m hoping to have a usable version soon enough for people to try out. That way I could get more feedback!</p>\n<p>Updated the  <a href=\"http://imgur.com/a/HxCNw\">image album</a> with more ‘app in action’ screenshots<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2015-05-19T22:18:40.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Under-Development-Legendary-Tracker/5081449","author":"fro.8967","body":"\n<p>I think people just need to get used to using API keys, or have a good incentive. An automatic legendary progress tracker (web based) might be just the ticket.</p>","arenanet":false},{"pubDate":"2015-05-19T22:15:13.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Under-Development-Legendary-Tracker/5081441","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 19 2015 09:38PM\"><a href=\"/forum/community/api/Under-Development-Legendary-Tracker/5081333\">Syncez.1536:</a></cite></div><div class=\"quotey\"><p>Could implement it easily using <a href=\"https://github.com/arenanet/api-cdi/pull/3\">this</a>. But that also means I’ll have to add something on launch like  “insert account name” and I don’t think people are comfortable with that. We’ll see how it goes.</p></div></blockquote>\n<p>It’d be “insert API key with the ‘inventories’ permission”. I’m not sure how to make people more comfortable with using them though; that’s an open problem in my book.</p>","arenanet":true},{"pubDate":"2015-05-19T21:38:24.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Under-Development-Legendary-Tracker/5081333","author":"Syncez.1536","body":"\n<p>Could implement it easily using <a href=\"https://github.com/arenanet/api-cdi/pull/3\">this</a>. But that also means I’ll have to add something on launch like  “insert account name” and I don’t think people are comfortable with that. We’ll see how it goes.</p>","arenanet":false},{"pubDate":"2015-05-18T16:11:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Under-Development-Legendary-Tracker/5077218","author":"Slyfer.6478","body":"\n<p>Will you be using the API to automatically track the progress? As in we’ll be getting access to players inventories, material deposit and bank tabs soonish i reckon. As for feedback. It’s nice. But it’s just simpler for me to use an excel sheet instead of downloading a third-party tool. If said third-party tool was able to automatically track the progress(which it would be able to once API is fleshed out) i’d use it over excel sheet.</p>","arenanet":false},{"pubDate":"2015-05-15T12:13:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Under-Development-Legendary-Tracker/5067943","author":"Syncez.1536","body":"\n<p>Hi guys!</p>\n<p>I’m Ez, and I am a software engineer at broadcast company. I’m a big Guild Wars / Guild Wars 2 fan and have been playing both games as I grew up.</p>\n<p>Now we’re done with introductions, I’d like to present something I’ve been working on (the last 2 days).</p>\n<p>I am currently working on an application (using the .Net GW2 API) that tracks your progress as you craft the current Legendary weapons. The application simply pulls the information of all the current legendary weapons, with the description and presents it in a minimalistic interface. I wanted to create something that is simple to use, no fuss, no worries and also something that you can just go up to your friends online and say “Oh, i’m 20% done with my Bolt”. Just something you can track your progress as we all know how much people love numbers and percentages.</p>\n<p>I started off playng around with the API and just simple stuff like pulling items based on their IDs, etc. When I got home from work, I figured I should make a cup of coffee and sit on this and have a think. I made a <a href=\"http://redd.it/35y6ri\">reddit post</a> about it. You can also find the application gallery <a href=\"http://imgur.com/a/HxCNw\">here</a>.</p>\n<p>The more I work on this, the more I want to make it work, seeing as I’m sure tons of people who are crafting those beautiful Legendary weapons would want one. <br>\nSure you could use Excell sheets but setting it up is pretty tedious.</p>\n<p>Now, why am I here? <strong>I’m looking for your suggestions.</strong></p>\n<p>Here are some things I’ve come up with and will add to my cycle:</p>\n<ol>\n\t<li><del>XML ‘database’ for personal tracking – where you fill in a form, click save and it updates a little progress bar to show how far you are from finishing each component for that particular legendary (with an exception to Gift of Mastery and Fortune as both are used to craft all the legendaries). </del></li>\n\t<li>Progress Bars. Progress Bars everywhere.</li>\n\t<li>Trading Post calculator (gets current values, computes profits, etc etc.)</li>\n\t<li>Better look and feel (but I want to focus on the functionality first.).</li>\n\t<li>Overlay functionality (So you can run it alongside the game client).</li>\n</ol>\n<p>Here are the changelogs.<br>\nChangelogs:</p>\n<ol>\n\t<li>Added trading post API placeholders for getting the TP prices for precursors. Will implement the same for all components.</li>\n\t<li>Fixed progress bar and now increments/decrements properly according to the XML logic.</li>\n\t<li>Improved loading time</li>\n\t<li>Changed the highlighting colours when selecting a legendary to match colour sceheme.</li>\n\t<li>Added seperate recipe for Eternity.</li>\n\t<li>Added checks for completion</li>\n\t<li>Populates the recipe section properly with all required items.</li>\n\t<li>Pulls recipes for each component.</li>\n\t<li>Application checks for internet connectivity before launching (and prompts the user if there is no internet connection.)</li>\n\t<li>‘Your Tracker’ populates dynamically based on the components selected.</li>\n\t<li>Precursor section now dynamically populates by cross referencing with the Legendary the user selects.</li>\n\t<li>Local XML ‘database’ added for personal tracking.</li>\n\t<li>Progress Bar working 100% on Gift of Fortune personal tracker.</li>\n\t<li>Gift of Fortune personal tracker is now active (check <a href=\"http://imgur.com/a/HxCNw\">Application Album</a> for some screenshots – latest being at the bottom of the album)</li>\n\t<li>Added Gift of Fortune window and currently implementing a local xml db for personal tracking.</li>\n</ol>\n<p>Stuff I’m using (for those interested)</p>\n<ol>\n\t<li><a href=\"https://gwapinet.codeplex.com/wikipage?title=Getting%20Started&referringTitle=Documentation\">API</a>.</li>\n\t<li>Visual Studio 2012</li>\n\t<li>The wiki, documentation of the API and <a href=\"http://gw2tno.com/api/finditemidbyname/Incinerator\">this thing</a>.</li>\n</ol>\n<p>Hope I can get some positive feedback (keeping in mind this thing is only 2 days old) here and some more suggestions.</p>\n<p>Note: I made this for personal use but it exploded to something bigger and I am kind of enjoying the practice I get from this.</p>","arenanet":false}]}