{"title":"/v2/items/xxxxx","pubDate":"2016-01-02T12:32:51.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/v2-items-xxxxx","comments":[{"pubDate":"2016-01-04T18:05:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/v2-items-xxxxx/5896899","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on January 02 2016 12:32PM\"><a href=\"/forum/community/api/v2-items-xxxxx/5893094\">Drifyt.2598:</a></cite></div><div class=\"quotey\"><p>Specifically, in your own experience, how often would you say an item changes? Is there anywhere that changes are noted? I would assume after each patch? I am unsure if items can change mid version.</p></div></blockquote>\n<p>To add to Eearslya’s response, items <strong>cannot</strong> change unless the value of /v2/build updates — that’s the only time that the dat-reading component (from which anything with localized data originates) pulls updated data. For endpoints that are localized, if /v2/build hasn’t changed since the last fetch, the same data will be returned.</p>\n<p>It’s a bit annoying, but our API backend is totally stateless so there’s not a good way for the API to respond to If-Modified-Since requests (or respond with Last-Modified). This issue has been raised a few times in the past (and I opened a <a href=\"https://github.com/arenanet/api-cdi/issues/159\">github issue</a> today to track it better), but my current recommendation is to do a complete re-fetch of any data persisted by the application from localized endpoints whenever /v2/build updates. There might be a better way to do this in the future, but right now that’s the only recourse available for application developers to always have an up-to-date version of the data.</p>","arenanet":true},{"pubDate":"2016-01-02T16:15:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/v2-items-xxxxx/5893337","author":"Eearslya.6309","body":"\n<p>From what Lawton has said before, items are not supposed to change until an actual build. So you can check <strong>/v2/build</strong> every now and then until it increments, then you know to re-check your items. However, new items can appear between builds, so you can just check the <strong>/v2/items</strong> endpoint for the list of IDs and see if anything is new.</p>\n<p>The Cache-Control header will almost always return a value of 5 minutes only, unless you’re dealing with trading post APIs, so that probably won’t help.</p>","arenanet":false},{"pubDate":"2016-01-02T12:32:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/v2-items-xxxxx/5893094","author":"Drifyt.2598","body":"\n<p>Hi API Devs,</p>\n<p>I’ve been experimenting with numerous AN API’s in a ‘live view’ sort of situation and was wondering if any you experienced api devs could give some feedback into item updates. Specifically, in your own experience, how often would you say an item changes? Is there anywhere that changes are noted? I would assume after each patch? I am unsure if items can change mid version.</p>\n<p>I’m looking at ways to fine tune and optimize my calls to this interface so any hindsight would be greatly appreciated. My thinking is to cache the results locally and use these until the Cache-Control expires or the client and or server is patched.</p>\n<p>Cheers<br>\nPaul</p>","arenanet":false}]}