{"title":"Wish: Better searching","pubDate":"2015-11-15T10:16:26.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Wish-Better-searching","comments":[{"pubDate":"2015-12-03T20:19:45.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Wish-Better-searching/5822853","author":"DarkMagister.7429","body":"\n<p>Seems like things are more evident now, but since it was asked.</p>\n<blockquote><div class=\"citey\"><cite title=\"Posted on November 28 2015 01:32PM\"><a href=\"/forum/community/api/Wish-Better-searching/5804476\">Killerassel.2197:</a></cite></div><div class=\"quotey\"><p>Consider the following two questions and how you’d answer them from the API:</p>\n<ul>\n\t<li>What can I craft from mithril ore?</li>\n\t<li>What recipes can my Scribe (level xx) craft?</li>\n</ul></div></blockquote>\n<p>I develop my tool as an application, not a web-project, so for me running though some lists or dictionaries looks like a faster way to get things done, then requesting server for each action.</p>\n<p>Question 1: It can be split into two different actions, first being an addition to the second:<br>\n1. Connect user input “Mithril Ore” with the item ID (if it is a user input and we don’t know the ID). I’ve added it not so long ago, so: I have two lists: one if integer – IDs, second of string (item names). The search function creates the list of indexes of items in the 2nd list, containing “Mithril Ore”, then converts it into the list of item IDs from the 1st list (item #10 corresponds to the item #10), so the list of item IDs is returned to the table, from which Mithril Ore can be selected – we get our ID.<br>\n2. Code:<br>\n</p><pre><code>Public Function GetRecipesUsingItem(i_ItemID As Integer) As List(Of cls_HolderAPI2RecipeDetails)\n        Dim lst_return As New List(Of cls_HolderAPI2RecipeDetails)\n        For Each item In dic_RecipesDetails\n            For Each item2 In item.Value.ingredients\n                If item2.item_id = i_ItemID Then\n                    Dim lst_LvlUPRecipes As New List(Of cls_HolderAPI2RecipeDetails)\n                    lst_LvlUPRecipes = GetRecipesUsingItem(item.Value.output_item_id)\n                    If lst_LvlUPRecipes IsNot Nothing Then\n                        lst_return.AddRange(lst_LvlUPRecipes)\n                    End If\n                        lst_return.Add(item.Value)\n                End If\n            Next\n        Next\n        If lst_return.Count = 0 Then\n            Return Nothing\n        Else\n            Return lst_return\n        End If\nEnd Function</code></pre><p></p>\n<p>This recursive function returns the list of all recipes, in which the given item and its “children” are used as ingredients. Then another function converts it into the list of results item IDs, which is then converted into names at the stage of filling the result table. It can be converted directly, but the program works with IDs, not names, I only use names when it is something the user is to see.</p>\n<p>Conversion to name is simple, item details are stored in the dictionary of item details classes, with item IDs being keys. So, for example<br>\n[pre]msgbox (GetItemForID(i_ItemID).name)</p>\n<p>Public Function GetItemForID(i_ID As Integer) As cls_HolderAPI2ItemDetails<br>\n        If dic_ItemsDetails.ContainsKey(i_ID) = True Then<br>\n            Return dic_ItemsDetails.Item(i_ID)<br>\n        End If<br>\n        Dim cls_ZeroResult As New cls_HolderAPI2ItemDetails<br>\n        cls_ZeroResult.name = “N/A”<br>\n        Return cls_ZeroResult<br>\n    End Function[/pre]</p>\n<p>“What recipes can my Scribe (level xx) craft?”<br>\nI have a boolean function b_IsNeededDiscipline, that checks: is the given recipe corresponds to the given recipe search settings (discipline and level), like  Scribe (level xx) . It is used on several occasions, in your task it will be cycling through all the recipes, creating the list of recipes IDs, that correspond to the given setting.</p>\n<p>I’m sorry for much text, and possibly sorry for stupid code – I’m not a pro.</p>\n<p>P.S. I understand that using a local database would be the right way to do it, but had my reasons to do it this way.</p>","arenanet":false},{"pubDate":"2015-12-02T12:22:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Wish-Better-searching/5817812","author":"Killerassel.2197","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on December 01 2015 03:23PM\"><a href=\"/forum/community/api/Wish-Better-searching/5813047\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p>The API doesn’t talk to any relational databases;</p></div></blockquote>\n<p>I had almost expected that. But I thought putting it in familiar SQL terms anyway helped me to clarify what I’m asking for and clear up the confusion DarkMagister pointed at.</p>\n<blockquote><div class=\"citey\"><cite title=\"Posted on December 01 2015 03:23PM\"><a href=\"/forum/community/api/Wish-Better-searching/5813047\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p>This doesn’t really scale in a sane way; it would be ideal to toss all of the data into a more production-ready indexing solution (read: hand-normalize it into SQL, or toss is into an indexed document store ala Lucene) but we don’t really have the resources to set up and maintain additional third-party software solutions.</p></div></blockquote>\n<p>Ouch.<img src=\"/include/images/smilies/colondee.png\"> Ok, but since there is an index to find recipes by ingredient and output, at least there was some hope this would be doable.</p>\n<blockquote><div class=\"citey\"><cite title=\"Posted on December 02 2015 12:40AM\"><a href=\"/forum/community/api/Wish-Better-searching/5816014\">Arridath.1087:</a></cite></div><div class=\"quotey\"><p>With regards to OP’s request, the GW2Spidy API might be of use.</p></div></blockquote>\n<p>Thank you for the suggestion. Yes, this would be another good option.</p>","arenanet":false},{"pubDate":"2015-12-02T00:40:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Wish-Better-searching/5816014","author":"Arridath.1087","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on December 01 2015 03:23PM\"><a href=\"/forum/community/api/Wish-Better-searching/5813047\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p>The API doesn’t talk to any relational databases; the recipe search endpoints are using hand-rolled indexes. This doesn’t really scale in a sane way; it would be ideal to toss all of the data into a more production-ready indexing solution (read: hand-normalize it into SQL, or toss is into an indexed document store ala Lucene) but we don’t really have the resources to set up and maintain additional third-party software solutions.</p></div></blockquote>\n<p>Oh my god I am so sorry this is the case.</p>\n<p>With regards to OP’s request, the GW2Spidy API might be of use. They poll the official API and keep all of their data in a separate database. Because of this, they support searching for an item by name.</p>","arenanet":false},{"pubDate":"2015-12-01T15:23:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Wish-Better-searching/5813047","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on November 28 2015 01:32PM\"><a href=\"/forum/community/api/Wish-Better-searching/5804476\">Killerassel.2197:</a></cite></div><div class=\"quotey\"><p>To put it in SQL terms, I’d like to have more options/indexes for WHERE conditions, but my post was not at all about JOIN (i.e. recursion).</p></div></blockquote>\n<p>The API doesn’t talk to any relational databases; the recipe search endpoints are using hand-rolled indexes. This doesn’t really scale in a sane way; it would be ideal to toss all of the data into a more production-ready indexing solution (read: hand-normalize it into SQL, or toss is into an indexed document store ala Lucene) but we don’t really have the resources to set up and maintain additional third-party software solutions.</p>","arenanet":true},{"pubDate":"2015-11-28T13:32:55.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Wish-Better-searching/5804476","author":"Killerassel.2197","body":"\n<p>At the recursion stage I’m already working with IDs. At that time I won’t need (other) search conditions anymore.</p>\n<p>Consider the following two questions and how you’d answer them from the API:</p>\n<ul>\n\t<li>What can I craft from mithril ore?</li>\n\t<li>What recipes can my Scribe (level xx) craft?</li>\n</ul>\n<p>There is already /recipes/search?input=…, which allows to query “What can I craft from the item with ID 1234?” So to find out what I can craft from mithril ore I need to find its ID first. And this is not directly possible via the API, other than loading ALL items and check each item’s name.</p>\n<p>Similar for the second question. I can get a list of all recipes and each recipe states its discipline(s). But I cannot query, say, /recipes/search?discipline=Scribe.</p>\n<p>Once I have recipes I need to find what the item IDs actually represent and possibly how to craft them. This is the recursion step, but this can be done without search but directly querying items by their ID and recipes by /recipes/search?output=…, which exists.</p>\n<p>To put it in SQL terms, I’d like to have more options/indexes for WHERE conditions, but my post was not at all about JOIN (i.e. recursion).</p>\n<p>And about the server load: well, it’s a trade off. My suggestion would put a bit more load for processing, but take away a lot of load on bandwidth. Unless, of course, high bandwidth sites start to abandon their local caches and start hammering the server.</p>","arenanet":false},{"pubDate":"2015-11-22T13:28:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Wish-Better-searching/5786564","author":"DarkMagister.7429","body":"\n<p>Maybe I’ve read too much, but I meant what it:<br>\nANet is interested in moving as much search job to our side, instead of loading its servers. Thus it is reasonable for them to leave such complex searches to our side.<br>\n(this may not be a problem on their side, but I see some requests dropped in the prime-time already)</p>\n<p>And if you already consider recursion to be done on your side anyway, why do you need any search at the server-side? To first get recipe-list from the server, then use your recursive function (returning recipes, using this item) on the results from this list – it is counter-productive.</p>\n<p>P.S. Trying to use recursive search on MF recipes will need additional fail-safes added.</p>","arenanet":false},{"pubDate":"2015-11-22T13:10:07.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Wish-Better-searching/5786540","author":"Killerassel.2197","body":"\n<p>DarkMagister, you’ve read too much into my post. The API already supports listing recipes by (immediate) ingredient or by result. It takes the item ID as parameter, though. So, what I need is a way to translate the name of an item into its ID, i.e. a search item by name function.</p>\n<p>I’d consider recursion through recipes my application’s job anyway.</p>\n<p>My problem with with the API as it is now is, that I cannot search an item or a recipe by specific properties directly. For recipes specifically, I can ask by ingredient or result, but I cannot filter by discipline or min-level.</p>\n<p>I.e. I CAN ask “show all recipes using item 12345”, but I cannot ask “show all recipes for scribes (using item 12345)”.</p>\n<p>The workaround that I can use is pulling ALL items/recipes and filter locally.</p>\n<p>Unfortunately this workaround will have to do for the forseeable future. Thanks for the feedback anyway and keep up the nice work.</p>","arenanet":false},{"pubDate":"2015-11-18T18:36:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Wish-Better-searching/5773516","author":"Lawton Campbell.8517","body":"\n<p>This is something we’ve looked into but are unlikely to support, unfortunately.</p>","arenanet":true},{"pubDate":"2015-11-18T13:17:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Wish-Better-searching/5772426","author":"DarkMagister.7429","body":"\n<p>I think let not try to sit on anet’s head here )) They are providing us with some nice info to use, but if all the sites or programs start requesting anet’s server for all these things – it would not be so good.</p>\n<p>“which recipes for scribes use T1 blood?” – way I remember there is an API to return the list of recipes using the item, then you can go through that short list to check which of them is for scribe.</p>\n<p>BUT I doubt that API provides recursive check, nor will any other API of that kind. I mean “A is used for crafting B, B is used for crafting C. You won’t get C in the response list for A”. So it is something you will still need to do on your side.</p>","arenanet":false},{"pubDate":"2015-11-15T10:16:27.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Wish-Better-searching/5760849","author":"Killerassel.2197","body":"\n<p>There are two things I have noticed lately on using the API. I’d like to be able to find an item by its name and the recipes by discipline and possibly min_rating. An example use case: which recipes for scribes use T1 blood?</p>\n<p>Of course it would be even better the more general the search options are. Ideally it would be possible to find by every aspect that is included in the result, such as items by type, flags, details, rarity etc. For example: find all level 80 heavy armor boots that give power (and any other stats).</p>\n<p>This would rather be a convenience (and performance) feature. To get my list of scribing recipes I just pulled all the recipes and filtered them by discipline. The same approach can be used to find an item by name. And of course I could cache it in a local database. But I think it would be nice if one could just ask the API for it directly.</p>\n<p>Oh, and item by name should at least optionally be partial name, just like on the TP.</p>","arenanet":false}]}