{"title":"&quot;Activation Time&quot; property in skills API","pubDate":"2017-03-06T12:38:11.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API","comments":[{"pubDate":"2017-05-06T18:51:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API/6578226","author":"Ramiel.1405","body":"\n<p>Thanks Lawton for replying and actually participating in the discussion. I’m also very interested in this because I also was thinking about a project similar to OP’s.<br>\nI hope you have time to work on this in the near future!</p>","arenanet":false},{"pubDate":"2017-03-19T16:04:11.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API/6531823","author":"nightzirch.3126","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on March 18 2017 07:48PM\"><a href=\"/forum/community/api/Activation-Time-property-in-skills-API/6531180\">Maja.6372:</a></cite></div><div class=\"quotey\"><p>I am not sure if I understand it right, but if this is about to know when you can skip parts of skillanimations via stow weapon to cast faster to do more dmg<br>\nmaybe it would just be better to finaly fix the skills so stow weapon cant be exploited anymore ?</p></div></blockquote>\n<p>Uhm, what? This is about knowing the length of the skill animation so I can create a tool that simulates a dps rotation.</p>\n<p>Also, this is in the API section of the forums. Your concern is better fit in the <a href=\"https://forum-en.guildwars2.com/forum/support/bugs\">Bugs: Game, Forum, Website</a> section.</p>","arenanet":false},{"pubDate":"2017-03-18T19:48:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API/6531180","author":"Maja.6372","body":"\n<p>I am not sure if I understand it right, but if this is about to know when you can skip parts of skillanimations via stow weapon to cast faster to do more dmg<br>\nmaybe it would just be better to finaly fix the skills so stow weapon cant be exploited anymore ?</p>","arenanet":false},{"pubDate":"2017-03-17T22:59:09.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API/6530484","author":"deltaconnected.4859","body":"\n<p>I wish I knew why I named them the way I did… I just wanted something fast for easy ctrl+c/ctrl+v’ing for total mapchat link code domination. Data comes from crawling game memory.</p>\n<p>etime is the result (?) from the game’s tooltip cast time function. My comments tell me it eats an &amp;float\\[18\\] parameter (with index 9 and 10 set to infinity), and etime are the two values that made the most “sense”. Quite possible the value you mention was in the others and I picked unfortunate samples to filter out what to keep.</p>\n<p>atime is what I assumed to be the animation step data. I take it evade frames and other points are included elsewhere? <img src=\"/include/images/smilies/wink.png\"></p>\n<p>edit: wrong function. It’s a struct-like float18 and not 4.</p>","arenanet":false},{"pubDate":"2017-03-17T17:48:05.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API/6530247","author":"Lawton Campbell.8517","body":"\n<p>Ugh I just made a really long post about this and the forums ate it. It was probably the best post I’ve ever made and this is a poor facsimile.</p>\n<p>Anyway.</p>\n<p>After looking at the data, I’m pretty sure that “etime” and “atime” are poking into the animation sequence data. The animation sequence data <em>does</em> contain both the evade frames and the activation timings.</p>\n<p>“etime” looks like it basically has the time offsets for the animation sequence steps that control the end of precast/end of cast. I’m not entirely sure where this data is coming from, but the timings are matching what I’m looking at. “etime.a” appears to be the time between casting the spell and the precast being over; “etime.b” is the time between casting the spell and the spell being over.</p>\n<p>Or, that’s what it <em>looked</em> like until I just now looked up Meteor Shower</p>\n<p>Mar 07 02:27:54 sdef 5501 Bn0VAAA= at 18b1b98eb9c: Meteor Shower<br>\n    Mar 07 02:27:54 —etime<br>\n    Mar 07 02:27:54 --— a:   3.8100s<br>\n    Mar 07 02:27:54 —-- b:   1.8000s<br>\n    Mar 07 02:27:54 —atime<br>\n    Mar 07 02:27:54 --— 5:   1.4000s<br>\n    Mar 07 02:27:54 —-- 1:   1.4000s<br>\n    Mar 07 02:27:54 —-- 4:   1.4000s<br>\n    Mar 07 02:27:54 —-- 5:   1.8000s<br>\n    Mar 07 02:27:54 —-- 5:   2.2000s<br>\n    Mar 07 02:27:54 —-- 5:   2.6000s<br>\n    Mar 07 02:27:54 —-- 5:   2.8000s<br>\n    Mar 07 02:27:54 —-- 5:   3.4000s<br>\n    Mar 07 02:27:54 —-- 2:   3.8010s<br>\n    Mar 07 02:27:54 —-- 0:   3.8010s<br>\n    Mar 07 02:27:54 —-- 3:   3.8100s</p>\n<p>I’m actually not totally certain what etime is because that doesn’t look quite right. Or — meteor shower might be a bit of a special pickle because it’s got really wonky animation timings.</p>\n<p>Assuming that “etime” is a subset of the animation sequence step data  — the animation sequence step data contains the evade frames, but those don’t appear to be exposed by this.</p>\n<p>Anyway, “atime” has the animation sequence’s trigger data. The “number:” prefix is the trigger id — the important ones, I think, are “0” is the trigger for “give the player back control”, and “1” is “do the skill’s effects”. Pretty sure the other ones are totally irrelevant for gameplay purposes.</p>\n<p>tl;dr, man this would really be useful to have in the API so we didn’t have to root around all crazy-like.</p>","arenanet":true},{"pubDate":"2017-03-17T10:43:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API/6529927","author":"nightzirch.3126","body":"\n<p>Thank you for replying!</p>\n<p>I was checking out arcdps’ skill logs. <a href=\"https://www.deltaconnected.com/arcdps/x64/evtc/skilldump.20170307.txt\">Link to .txt ~20mb</a>.<br>\nAnd was wondering if maybe you could help me make sense of “etime” and “atime”. This could prove to be a good enough source for these timings until these values can be extracted and put into the API.</p>\n<p>Are the timings listed here all the relevant information or are there more information about timing (aftercast etc) which are stored someplace else? In the animation data for instance?</p>","arenanet":false},{"pubDate":"2017-03-07T14:30:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API/6519900","author":"Crell.6401","body":"\n<p>It’d also be cool to know exactly where the evade frames are in the animation, sometimes its not as obvious as one might think.</p>","arenanet":false},{"pubDate":"2017-03-07T00:15:45.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API/6519426","author":"Lawton Campbell.8517","body":"\n<p>Hah yeah the aftercast is embedded in the animation data as well, as are the precast duration and the evade duration (though I think some of the evade durations are hardcoded skill facts — otherwise they wouldn’t show up in the API at all).</p>\n<p>Once I find the time to do the necessary refactoring it should be possible to expose all four values (precast, aftercast, total cast time, total evade time).</p>","arenanet":true},{"pubDate":"2017-03-06T23:17:12.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API/6519362","author":"Khisanth.2948","body":"\n<p>I guess that explains why some skills are lacking this info even in game. Mostly as part of auto attack sequences.</p>\n<p>The aftercast would also be necessary as well …</p>","arenanet":false},{"pubDate":"2017-03-06T18:52:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API/6519098","author":"Lawton Campbell.8517","body":"\n<p>There’s an <a href=\"https://github.com/arenanet/api-cdi/issues/249\">existing issue</a> for this, but the short story is that this is pretty difficult to expose (since activation times are stored in the animation data), but I’ll see what I can do to pull it out.</p>\n<p>EDIT: so the long story short is that the cast time is actually stored in the skill’s animation data and the code that extracts the value displayed in-game is fairly coupled to the UI. Pulling that out is a pretty significant undertaking; not sure when I’ll have time for it.</p>","arenanet":true},{"pubDate":"2017-03-06T12:38:12.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Activation-Time-property-in-skills-API/6518755","author":"nightzirch.3126","body":"\n<p>I am currently planning a very helpful tool for GW2 players who would like to improve their DPS rotation. I have however met a rather big limitation of the API that will require me to do an immense amount of manual work when creating and updating the tool.</p>\n<p>And that is the <strong>activation time of skills</strong>. How difficult would it be to add this property to the skills API?</p>\n<p>For instance, we have <a href=\"https://api.guildwars2.com/v2/skills/14407\">https://api.guildwars2.com/v2/skills/14407</a> with duration of 90 and recharge of 120, but we have idea about the activation time (cast time) of that skill.</p>\n<p>Thank you for your time</p>","arenanet":false}]}