{"title":"Alpine Borderlands Map Tiles","pubDate":"2016-05-04T06:25:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Alpine-Borderlands-Map-Tiles","comments":[{"pubDate":"2016-05-05T23:07:55.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Alpine-Borderlands-Map-Tiles/6140082","author":"Drant.5902","body":"\n<p>If I zoom all the way out on my map, I can see the original unitary map, with the new Alpine BLs on the top left and the 2012 Alpine lake BLs at bottom right. But since the top left quadrant is all we’re allowed to see right now, then I guess I’ll have to make do.</p>\n<p>Thanks for all your work and support of the community developers.</p>","arenanet":false},{"pubDate":"2016-05-05T22:45:00.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Alpine-Borderlands-Map-Tiles/6140043","author":"Lawton Campbell.8517","body":"\n<p>I spent some time today making my “make sure we don’t leak things while updating the tile data this time” test app presentable and pushed it <a href=\"https://github.com/arenanet/api-cdi/blob/master/leaflet-example.html\">to the api-cdi repo</a>. On the WvW maps it renders the objective markers from the API data and such.</p>\n<p>The ruin names have been bugged for awhile (<a href=\"https://github.com/arenanet/api-cdi/issues/102\">tracking issue</a>); with Alpine BL back I need to root around and see where those map labels are coming from. For all of the other objectives, the labels are from the sectors that the objective is in (and the objectives have no name associated with them).</p>\n<p>The tile cropping is just an artifact of how the tiles are generated — basically with a program that just takes screenshots of the world map UI element. I think the Alpine BL was adjusted to have different bounds which causes there to be no parchment beneath EB. It’s a bit unfortunate, but a bit intractable.</p>","arenanet":true},{"pubDate":"2016-05-04T23:12:16.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Alpine-Borderlands-Map-Tiles/6138207","author":"Drant.5902","body":"\n<p>I see from the new map tiles that the Alpine BL is not at its old spot (overlapping Desert BL), but it was moved to the top left corner. This is great since we only have to use one floor to display both borderland types.</p>\n<p>Maybe it’s because the API hasn’t been completely rolled out, but I’m encountering some issues as seen from this map (Continent 2 Floor 1):<br>\n<a href=\"http://gw2timer.com/wvw\">http://gw2timer.com/wvw</a></p>\n<p>- The Alpine BLs on the northwest portion (top left quadrant) of the Mists map has tiles visible, but the rest is blank. The Desert BLs cannot be seen at their old spot in the bottom right quadrant. It doesn’t seem like the Mists map had changed dimension, so maybe the tiles on other quadrants aren’t updated yet?</p>\n<p>- The /v2/wvw/objectives endpoint I use to get objectives’ coordinates are still positioned at the old bottom right quadrant. Will this be updated to reflect the displacement of Alpine objectives, or should I translate the coordinates manually? Also, EBG from /v2/maps is duplicated to this quadrant, but it has only one set of coordinates (for bottom right quadrant).</p>\n<p>- Finally, this is just a minor issue, but if it could be easily fixed I want to point out that the “Ruins” in the /v2/wvw/objectives endpoint currently has their names as “Demontrance Lake”, which is the sector it’s in, and not their proper name like  “Bauer’s Estate”.</p>\n<p>…</p>\n<p>Edit: It turns out the incorrect objectives placement in my map was because the Mists continent now has 8 zoom levels instead of 7. So /v2/wvw/objectives has correct coordinates.<br>\nBut back to the tiles themselves, it’s unfortunate that the new tiles is cropped shortly below the borderlands. Right now it is showing an abrupt blank background below EBG, which previously had terrain.</p>","arenanet":false},{"pubDate":"2016-05-04T21:45:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Alpine-Borderlands-Map-Tiles/6138079","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 04 2016 05:38PM\"><a href=\"/forum/community/api/Alpine-Borderlands-Map-Tiles/6137510\">Drant.5902:</a></cite></div><div class=\"quotey\"><p>In case we do get map rotations often, it would be nice if there is a variable in the wvw/matches endpoint that tells whether we’re having Desert or Alpine currently. Right now the way to determine that is to read the objectives array (which contains respective objectives).</p></div></blockquote>\n<p>In /v2/wvw/matches, each map object in the .maps array has a id — which somewhat ambiguously is the map_id — that you can inspect or resolve against <a href=\"https://api.guildwars2.com/v2/maps?ids=38,94,95,96\">/v2/maps</a> to get the metadata and localized strings.</p>\n<p>EDIT: also the new map tiles are up.</p>","arenanet":true},{"pubDate":"2016-05-04T17:38:02.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Alpine-Borderlands-Map-Tiles/6137510","author":"Drant.5902","body":"\n<p>Thank you for regenerating the tiles. It will be great for live maps and overlay users.</p>\n<p>In case we do get map rotations often, it would be nice if there is a variable in the wvw/matches endpoint that tells whether we’re having Desert or Alpine currently. Right now the way to determine that is to read the objectives array (which contains respective objectives).</p>","arenanet":false},{"pubDate":"2016-05-04T17:20:13.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Alpine-Borderlands-Map-Tiles/6137479","author":"Lawton Campbell.8517","body":"\n<p>In the short term, I’m uploading the regenerated tiles right now. Should have the Alpine BL tiles up by the end of the day.</p>\n<p>In the middle term, your proposal sounds reasonable if a bit of a hack. I’ll look into setting it up sometime this week. I opened up a <a href=\"https://github.com/arenanet/api-cdi/issues/304\">tracking issue on Github</a> for this.</p>","arenanet":true},{"pubDate":"2016-05-04T06:25:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Alpine-Borderlands-Map-Tiles/6136647","author":"Drant.5902","body":"\n<p>Map <a href=\"http://wiki.guildwars2.com/wiki/API:Tile_service\">tiles</a> are used to create a web version of the game’s map. The <a href=\"http://wiki.guildwars2.com/wiki/API:2/continents\">continents</a> endpoint has an array of “floors” numbers which can change the tile images URL, allowing the whole web map to change its map layer, such as for showing different elevations (Verdant Brink canopy) or minimaps (closeup of PvP maps).</p>\n<p>Floor 1 is used to display the majority of the maps and borderlands in the Mists continent, including PvP maps and WvW borderlands. With HoT’s release, this floor which used to have Alpine Borderlands was replaced with Desert Borderlands tiles.</p>\n<p>Since the borderlands will now be on a rotation, I request that we have Alpine and Desert borderlands on separate floors, instead of being replaced. So create a duplicate of Floor 1 (let’s say Floor 2), but with the non-EBG borderlands having Alpine BL.</p>\n<p>This is the URL scheme to get the Floor 1 (which has Desert Borderlands) tiles for web maps:<br>\n<a href=\"https://tiles.guildwars2.com/2/1/{z}/{x}/{y}.jpg\">https://tiles.guildwars2.com/2/1/{z}/{x}/{y}.jpg</a><br>\nNote the “2” in “/2/1/{z}/{x}/{y}.jpg” is the Mists continent number, and “1” is the floor number. Since “Floor 2” is not in the floors array, I assume it is unused, so…</p>\n<p>I request that<br>\n<a href=\"https://tiles.guildwars2.com/2/2/{z}/{x}/{y}.jpg\">https://tiles.guildwars2.com/2/2/{z}/{x}/{y}.jpg</a><br>\nbe a duplicate of Floor 1 but with Alpine Borderlands instead.</p>","arenanet":false}]}