{"title":"API Image Resource Policy","pubDate":"2015-09-03T01:53:44.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Image-Resource-Policy","comments":[{"pubDate":"2015-09-03T13:32:33.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Image-Resource-Policy/5450451","author":"Elfo Bianco.3786","body":"\n<p>Really I don’t understand this part:</p>\n<p>“Any use of the API’s must comply with the Website Terms of Use and Content Terms of Use, however you may use the API’s to make commercial products so long as they are otherwise compliant and do not compete with ArenaNet.”</p>\n<p>because I asked to the support about selling an app that helps to keep track of everything an account has unlocked and Aidan Taylor answered that I can’t sell anything. So which kind of commercial products the phrase above talks about??</p>","arenanet":false},{"pubDate":"2015-09-03T04:56:09.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Image-Resource-Policy/5449561","author":"MrKnieves.4162","body":"\n<p>Awesome! This clears it up! Thanks!<img src=\"/include/images/smilies/colondee.png\"></p>","arenanet":false},{"pubDate":"2015-09-03T03:49:16.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Image-Resource-Policy/5449431","author":"Lawton Campbell.8517","body":"\n<p>From <a href=\"https://forum-en.guildwars2.com/forum/community/api/API-Documentation\">this thread</a>:</p>\n<blockquote><div class=\"quotey\"><p>API Terms:</p>\n<p>These API’s are wholly owned by ArenaNet, LLC (“ArenaNet”). Any use of the API’s must comply with the <a href=\"https://www.guildwars2.com/en/legal/website-terms-of-use/\">Website Terms of Use</a> and <a href=\"https://www.guildwars2.com/en/legal/guild-wars-2-content-terms-of-use/\">Content Terms of Use</a>, however you may use the API’s to make commercial products so long as they are otherwise compliant and do not compete with ArenaNet. ArenaNet may revoke your right to use the API’s at any time. In addition, ArenaNet may create and/or amend any terms or conditions applicable to the API’s or their use at any time and from time to time. You understand and agree that ArenaNet is in the process of developing a full license agreement for these API’s and ArenaNet will publish it when it is complete. Your continued use of the API’s constitutes acceptance of the full license agreement and any related terms or conditions when they are posted.</p></div></blockquote>\n<p>(EDIT: I actually have no idea what the status is of the “full license agreement”)</p>","arenanet":true},{"pubDate":"2015-09-03T01:53:44.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Image-Resource-Policy/5449147","author":"MrKnieves.4162","body":"\n<p>Hello,</p>\n<p>I searched but couldn’t find a direct answer, what is the policy regarding the use of API image resources, for example currency icons, on mobile apps/sites?</p>\n<p>I’m currently building a mobile app based around the api and I’m “caching” and re-sizing the images on device so I don’t have to re-download them every time they are needed. Is this an allowed usage?</p>\n<p>App is going to be free with no ads, I’m just building it as a portfolio piece.</p>\n<p>Please advise, thanks!</p>","arenanet":false}]}