{"title":"[API Suggestion] Events","pubDate":"2013-05-25T08:31:49.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events","comments":[{"pubDate":"2013-05-29T03:09:20.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events/2110951","author":"Khisanth.2948","body":"\n<p>The timestamp would also help with dealing with server restarts.<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2013-05-28T19:39:45.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events/2107986","author":"smiley.1438","body":"\n<p>Please add the <em>map_id</em> to the <em>event_names</em> API – currently it’s a pain to find the right map for a given event (without a database driven backend) since its not assured that a given event is listed in the <em>events</em> response for a single world.</p>","arenanet":false},{"pubDate":"2013-05-26T22:24:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events/2096445","author":"DarkSpirit.7046","body":"\n<p>For web services like these, sorted list from the server would be useful if the number of items in the list can change between calls very often.  For example, the number of items in a search query from the Trading Post can change at anytime.  The TP client can do all the sorting, but that would mean:</p>\n<p>1.  Getting the entire list from the server first (some performance hit) instead of a partial list (typically done if the list is long).<br>\n2.  Sort the list<br>\n3.  Keep the list static as the user navigates between pages of your search result.</p>\n<p>All that time, the number of items in that list could have changed, or their prices could have changed, etc while the user is looking through it.  This is the price to pay for a client-sorted list.  But if the list is quite static, then client-sorted is fine and we save some server resources.</p>\n<p>Currently, with the simple data and short list from events.json, I don’t think we need any sorting from the server, but feel free to disagree.</p>","arenanet":false},{"pubDate":"2013-05-26T19:48:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events/2095802","author":"Rawrfaec.6412","body":"\n<p>There are certainly cases where having guaranteed sorted data wins you something without costing you anything for not having sorted data. But I did say it was a luxury problem.</p>","arenanet":false},{"pubDate":"2013-05-26T19:00:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events/2095620","author":"Primal Zed.9714","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 26 2013 10:30AM\"><a href=\"/forum/community/api/API-Suggestion-Events/2093856\">Rawrfaec.6412:</a></cite></div><div class=\"quotey\"><p>A luxury problem but would it be possible to have events sorted by ID? It’s a lot of client overhead that seems like it could be avoided. I realize they probably aren’t indexed by public IDs and requiring an ORDER BY on every request would add unnecessary server overhead, which is even worse.</p></div></blockquote>\n<p>What’s the point in sorting by ID?  It’s just a GUID, so putting it in alphabetical order by ID won’t have any value.</p>\n<p>edit: Also, if these web services become widely used, it’d be much more efficient to do things like sorting client-side so to keep the web service response as fast and efficient as possible for tons of requesters.</p>","arenanet":false},{"pubDate":"2013-05-26T10:30:13.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events/2093856","author":"Rawrfaec.6412","body":"\n<p>A luxury problem but would it be possible to have events sorted by ID? It’s a lot of client overhead that seems like it could be avoided. I realize they probably aren’t indexed by public IDs and requiring an ORDER BY on every request would add unnecessary server overhead, which is even worse.</p>","arenanet":false},{"pubDate":"2013-05-26T05:37:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events/2093137","author":"DarkSpirit.7046","body":"\n<p>A good example that I have in mind would be the website shown <a href=\"http://gw2.thelazy.net/events.html\">here</a>.  The fields for each event record should also include:</p>\n<p>1.  Location (called as Area in the above website) or a x/y co-ordinate position on the map.<br>\n2.  Type of Event: Normal/Skill Challenge/Meta/Chest<br>\n3.  DateTime of last status update to the event<br>\n4.  Number of players participating/participated in the event, if possible.</p>","arenanet":false},{"pubDate":"2013-05-26T04:02:59.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events/2092854","author":"Khisanth.2948","body":"\n<p>Start and path are not necessary but they are useful. The thing I have in mind is calculating current status.</p>","arenanet":false},{"pubDate":"2013-05-25T15:10:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events/2090396","author":"Primal Zed.9714","body":"\n<p>I disagree with specifically ‘start’, ‘current’, and ‘final’ locations.</p>\n<p>For starters, an escort only needs ‘current’ and ‘destination’.</p>\n<p>Secondly, there might be events with different kinds of locations, for example “destroy 3 towers” with the location of each tower.</p>\n<p>To that end, there should be a “locations” array, with the x, y, (z?) of each location for the event, the type of icon for that location (shield, star, swords, etc), and possibly a brief description of it (i.e. “Tower” or “Destination”)</p>\n<p>I don’t think the full path of an escort is necessary.</p>\n<p>Also, a primary icon to use for the event would be handy (similar to what klaufel set up at <a href=\"http://klaufel.info/gw2-active-events/\">http://klaufel.info/gw2-active-events/</a> – he’s just parsing the first word of the event name and guessing what icon to use with it).</p>","arenanet":false},{"pubDate":"2013-05-25T13:18:59.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events/2090008","author":"Khisanth.2948","body":"\n<p>Location should also have 3 different fields. Start, current and final location.</p>\n<p>Another thing that would be nice to go with the location is the path.<img src=\"/include/images/smilies/smile.png\"></p>\n<p>It would also be nice to have a timestamp for when an event has entered its current state. This can be used to figure out how much time is left on on timed events. It can also be used to find all potentially stalled events.</p>\n<p>Many events also have some sort of objective. It would be nice to have the state of those objectives too. Examples would be when the pirates burn the town in Gendarran Fields and you have to put out x/y fires. Another example is when you have to take down the door in the Taidha Covington pre-event.</p>","arenanet":false},{"pubDate":"2013-05-25T08:31:49.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events/2089205","author":"LadyRhonwyn.2501","body":"\n<p>I noticed there was a suggestion for guild events, but not for regular events…</p>\n<p>I have the following requests for the events:</p>\n<p>Group status (I have seen this one before somewhere, but can’t find the thread anymore)<br>\nLevel requirement.</p>\n<p>If location would be added, it would be the icing on the cake, but I have no idea if that’s even possible…</p>","arenanet":false}]}