{"title":"[API Suggestion] Few generic API Suggestions","pubDate":"2013-09-27T19:09:47.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions","comments":[{"pubDate":"2014-12-02T17:45:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/4596513","author":"HaydenTheGreat.8362","body":"\n<p>The near fact that most replies and posts on the forum site are all over four months to a year is a disappointing site to see. Being an long time Guild wars 2 player and also one of Dragonbrand’s Public Relation Administrator, I see the struggle of replenishing numbers with in the game, the effects or long term players who get bored, and leave, and the over all satisfaction/dissatisfaction of changes to the game so far. The upgrades, changes, and updates have all been correct actions in the end. The Living-story content in some opinion is to easy or boring, but the pace is picking up, which is inspiring some to return to the game. But in my honest opinion the one and nearly the only thing that ANET does in correctly is the advertising. Advertise the game, truly invest in getting the game out there. the game has been one of the biggest marketed MMOs in the West and has a huge Eastern population as well, but the game needs to keep advertising. Not on Facebook and other social media, but an honest to god commercial. WoW has the luxury of being able to create a commercial yearly, I know with funding being different since the game isn’t subscription, but if you truthfully want more active users then you must advertise your changes and game more sufficiently. Also make it worth new players joining the lower Tier Servers. For example “All new players  will receive Karma Boosts, Experience Boosts, a Black Lion Key, 5 gold to make their home on Anvil Rock, or SoR” We need to push for players to pick up the game in the lower tier Servers so they wont instantly want to transfer due to the fact the population may be lacking. If players start their they will tend to stay if they see other players of he some par. Leading to cultivation. I hope some one in ANET reads this and considers this. -Sir Hayden</p>","arenanet":false},{"pubDate":"2014-02-17T08:11:27.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/3648459","author":"smiley.1438","body":"\n<p>Also:</p>\n<blockquote><div class=\"citey\"><cite title=\"Posted on September 24 2013 01:14PM\"><a href=\"/forum/community/api/XML-Output/2904684\">smiley.1438:</a></cite></div><div class=\"quotey\"><p>Not to speak of the overhead XML has compared to JSON.<img src=\"/include/images/smilies/wink.png\"></p></div></blockquote>","arenanet":false},{"pubDate":"2014-02-17T01:42:07.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/3647699","author":"Killer Rhino.6794","body":"\n<p>NO XML! Srsly.</p>\n<p>To repeat what smiley said, I just don’t get it….I just…why?! You could write a JSON→CSV parser in a weekend if absolutely need some format to import into Excel.</p>\n<p>Also, doesn’t this do what you need? <a href=\"http://stackoverflow.com/a/7300926/623771\">http://stackoverflow.com/a/7300926/623771</a></p>\n<p>In closing: JSON.</p>","arenanet":false},{"pubDate":"2014-02-16T05:22:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/3644979","author":"The Ice Mage.4879","body":"\n<p>Apologies if this is not the best place to post this but here goes anyhoo.</p>\n<p>I was wondering, is there a way currently to retrieve player Achievement Point scores from the leaderboard? I was just thinking it’d be cool to be able to retrieve player’s scores. I had been playing around trying to make a little Java GUI that would take in data of some kind about, for example, my score and generate a graph but I had problems trying to get stuff for drawing functions working and I’ve been a bit busy with other things so haven’t dedicated more time to resolving the issue yet…<br>\nBut either way getting back on topic, having a way to retrieve achievement point totals would be nice IMO.<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2013-10-16T22:06:24.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/3038695","author":"Stefan Larimore.6872","body":"\n<p>Offering alternative data representations (such as XML) is planned, but not anytime soon.  In the meantime I’d recommend using a simple JSON to XML translation library, of which there are several.  There are even web-based translators you can play around with.</p>","arenanet":true},{"pubDate":"2013-10-16T14:51:46.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/3035671","author":"smiley.1438","body":"\n<p>I still wonder why (a very few) people still demand XML as data format. Ok, i can understand that it might be easier to parse in certain languages but i can’t see an advantage over JSON in the case of the GW2 API (and many more…). Don’t get me wrong, but personally i’d kill XML with fire – along with excel. Any decent language has possibilities to parse JSON easily (either native or as library) and also i heard that SQL databases are pretty handy when it comes to statistics. So when you’re working with MS-Office, you should at least favor Access over Excel.<img src=\"/include/images/smilies/wink.png\"></p>\n<p>Also for the notes – just for example:</p>\n<p><a href=\"https://twitter.com/thomasfuchs/status/379675885647192065\">https://twitter.com/thomasfuchs/status/379675885647192065</a> / <a href=\"https://gist.github.com/madrobby/6584720\">https://gist.github.com/madrobby/6584720</a></p>","arenanet":false},{"pubDate":"2013-10-16T14:32:44.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/3035535","author":"Mechamilk.7809","body":"\n<p>We really need an XML version, please implement it. I need a easy way to elaborate data on excel. It will open a world of statistics.<br>\nI play only WvW and i love to work with data, statistics and predictions. I think WvW need an easy way to elaborate all the data between this type of game. With a simple tutorial much more people will use it.  Best regards.</p>","arenanet":false},{"pubDate":"2013-09-29T21:44:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/2936175","author":"athanor.7410","body":"\n<p>Websockets for the event would be good so we can retrieve only event status changes</p>","arenanet":false},{"pubDate":"2013-09-27T20:34:51.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/2925316","author":"smiley.1438","body":"\n<p>I can still see no reason to include this info in an API response – like i said, most of it is obvious and if not, it is (or should be) covered in the wiki since it’s the official API documentation. Feel free to <a href=\"http://wiki.guildwars2.com/wiki/Guild_Wars_2_Wiki:Requests_for_API_editorship\">apply as API editor</a> to help and add info which you think is missing.</p>\n<p>Btw. in the MySQL example you mentioned, of course you wouldn’t create a varchar(x) field if you don’t exactly know the data length – you’d just use a tinytext/text/mediumtext/longtext<img src=\"/include/images/smilies/wink.png\"> <a href=\"http://dev.mysql.com/doc/refman/5.1/en/storage-requirements.html\">http://dev.mysql.com/doc/refman/5.1/en/storage-requirements.html</a></p>\n<p>(also: keep in mind the overhead a response would have, <a href=\"https://forum-en.guildwars2.com/forum/community/api/XML-Output/2904684\">especially XML</a>)</p>","arenanet":false},{"pubDate":"2013-09-27T19:56:38.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/2925132","author":"Chik En.8973","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on September 27 2013 07:31PM\"><a href=\"/forum/community/api/Few-generic-API-Suggestions/2924983\">smiley.1438:</a></cite></div><div class=\"quotey\"><p>Regarding #2: Javascript is a typeless language and since <a href=\"http://www.json.org/\">JSON</a> is a subset of Javascript it’s typeless aswell. I don’t think there’s much need for extra information about the datatypes since most of them are obvious. The wiki already covers this information if you really need it.</p></div></blockquote>\n<p>If you intend to do data persistence to a database such as MySQL or any other, knowing data lengths without guessing and hoping to avoid truncation is a needed factor. Not everything will be created in javascript. A efficient programmer does not just put String(1000) just in case, if you only need a varchar of 3, it would be nice to know.</p>\n<p>And the wiki only covers some basic info as I said.</p>\n<p>My objective for these two suggestions is to persist the data and hit the api with less load, hopefully avoiding unneeded pulls, example.</p>\n<p>1) If the build number has not changed, there is no need to update the map locations.<br>\n2) only pulling data that has changed since XXXXX</p>\n<p>The Schema built in is typical of other API’s such a webservice</p>\n<p>Example of a webservice <a href=\"http://wsf.cdyne.com/WeatherWS/Weather.asmx\"></a><a href=\"http://wsf.cdyne.com/WeatherWS/Weather.asmx\">http://wsf.cdyne.com/WeatherWS/Weather.asmx</a><br>\nExample of a webservice exposing its Schema through a parameter <a href=\"http://wsf.cdyne.com/WeatherWS/Weather.asmx?wsdl\"></a><a href=\"http://wsf.cdyne.com/WeatherWS/Weather.asmx?wsdl\">http://wsf.cdyne.com/WeatherWS/Weather.asmx?wsdl</a></p>\n<p>Just saying this would be nice for those who might want to persist the data and lighten the load to the API server</p>","arenanet":false},{"pubDate":"2013-09-27T19:31:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/2924983","author":"smiley.1438","body":"\n<p>Regarding #2: Javascript is a typeless language and since <a href=\"http://www.json.org/\">JSON</a> is a subset of Javascript it’s typeless aswell. I don’t think there’s much need for extra information about the datatypes since most of them are obvious. The wiki already covers this information if you really need it (e.g. <a href=\"http://wiki.guildwars2.com/wiki/API/item_details\">http://wiki.guildwars2.com/wiki/API/item_details</a>).</p>","arenanet":false},{"pubDate":"2013-09-27T19:09:47.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Few-generic-API-Suggestions/2924871","author":"Chik En.8973","body":"\n<p>#1</p>\n<p>It would be nice that with every request a index in time was returned, in the form of a typical unix timestamp 1380310841 (see <a href=\"http://www.unixtimestamp.com/\">here</a>)</p>\n<p>So that when calling any API a optional parameter would be passed such as<br>\n<a href=\"https://api.guildwars2.com/v1/event_details.json?since=1380310841\">https://api.guildwars2.com/v1/event_details.json?since=1380310841</a></p>\n<p>Would only provide event details of what has changed since this time stamp.</p>\n<p>This might lighten the load for processing and updates as well.</p>\n<p>#2</p>\n<p>I see some basic information about the data type’s such as Numeric or Int or String</p>\n<p>But it would be good if precision was provided as well and a simpler way to take note of the data such as (for the wiki)</p>\n<p><strong>String(42)</strong><br>\n<strong>Numeric(16,2) or Numeric(4,0) etc..</strong><br>\n<strong>Date(YYYY-MM-DD)</strong><br>\n<strong>Datetime(YYYY-MM-DD HH:MM:SS)</strong><br>\n<strong>unixtimestamp()</strong><br>\n<strong>LIST[String(32),Numeric(3,1)]</strong></p>\n<p>Just some suggestion, does not cover all data types such as signed or unsigned numeric.</p>\n<p>Also it would be good if the Json api would take a API parameter to output this information with the build number such as</p>\n<p><a href=\"https://api.guildwars2.com/v1/event_details.json?datatypes=true\">https://api.guildwars2.com/v1/event_details.json?datatypes=true</a></p>\n<p>To display that information in json format of<br>\n<strong>field_id, fieldname, type, precision, parent_id</strong></p>\n<p>where parent id is used for lists (nesting)</p>\n<p>This is just a quick suggestion, I have not hashed out everything and the forum search feature would not work at all in any browser to determine if anyone suggested this or similar.</p>","arenanet":false}]}