{"title":"[API Suggestion]API for the wardrobe","pubDate":"2014-04-07T20:52:48.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-API-for-the-wardrobe","comments":[{"pubDate":"2014-05-12T20:15:40.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-API-for-the-wardrobe/4016411","author":"Sariel V.7024","body":"\n<p>You have probably already seen, but items sport a skin_id.</p>\n<p>nightzirch, GMTA. I am also working on something similar, though I don’t expect to do much beyond a single release.</p>","arenanet":false},{"pubDate":"2014-04-07T21:42:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-API-for-the-wardrobe/3868760","author":"nightzirch.3126","body":"\n<p>I quickly browsed through the API category to see if there were any threads like this. I must’ve missed yours.</p>\n<p>As you say, we propose two different approaches to basically the same end-result. I agree that your suggestion seems alot easier to implement.</p>\n<p>Let us cross our fingers and hope for a response from the devs.</p>","arenanet":false},{"pubDate":"2014-04-07T21:33:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-API-for-the-wardrobe/3868722","author":"Dr Ishmael.9685","body":"\n<p>I already asked basically the same question: <a href=\"https://forum-en.guildwars2.com/forum/community/api/The-API-the-Wiki-and-the-Wardrobe\">https://forum-en.guildwars2.com/forum/community/api/The-API-the-Wiki-and-the-Wardrobe</a>  but instead of proposing new endpoints, I suggested that they just add skin_id to item_details.json (the data is probably already structured this way anyway, which should make it relatively easy to implement).</p>\n<p>I don’t know what else you would expect to get from a wardrobe.json endpoint… I doubt they would be able or willing to host model/texture files the same way they do item icons.</p>","arenanet":false},{"pubDate":"2014-04-07T20:52:48.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-API-for-the-wardrobe/3868567","author":"nightzirch.3126","body":"\n<p>Hello</p>\n<p>I recently started the development of <a href=\"http://gw2wardrobe.com\">gw2wardrobe</a> which I intend to make <em>the</em> go-to source for players who seek to fill their wardrobe 100% or players who wonder how to acquire certain items.</p>\n<p>I am currently using both the GW2 official API and gw2spidy’s API in order to get easier access to item data. However, calling <a href=\"http://www.gw2spidy.com/api/v0.9/json/all-items/0\">gw2spidy’s API for all armor items</a>, I get 7418 results back. Lots of these items share the same look, making the majority of the items redundant.</p>\n<p>I started this thread with questions in mind, but turned it around to include suggestions instead.</p>\n<p>I would love to see an API for the wardrobe. Kind of like <a href=\"http://wiki.guildwars2.com/wiki/API:1/items\">items</a>, but with skins instead.</p>\n<ol>\n\t<li><a href=\"https://api.guildwars2.com/v1/wardrobe.json\">https://api.guildwars2.com/v1/wardrobe.json</a> would return a JSON object with all the different looks there are in the game.</li>\n\t<li><a href=\"https://api.guildwars2.com/v1/wardrobeDetails.json?item_id=1234\">https://api.guildwars2.com/v1/wardrobeDetails.json?item_id=1234</a> would return details about a specific skin. It could also include an array of item IDs for the items that have this particular skin.</li>\n\t<li>I would also love to see some order in the returned object, so we could with a few lines of code automatically sort the items in the order they appear in the wardrobe. This could either be the order they are returned in the JSON object from wardrobe.json, or as an integer property in wardrobeDetails.json.</li>\n</ol>\n<p>I know this would take hours and hours of work off my shoulders, not having to create a database manually.</p>\n<p>I would love to hear your thoughts on this matter. And I feel I should thank all the devs. for their work. We all appreciate the great job you are doing for the developer community!</p>","arenanet":false}]}