{"title":"[API Suggestion] Characters","pubDate":"2013-05-24T05:05:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters","comments":[{"pubDate":"2014-12-19T15:11:27.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/4638114","author":"chaly.7638","body":"\n<p>There is <a href=\"https://forum-en.guildwars2.com/forum/community/api/Query-home-server-of-a-player/first#post3674253\">another suggestion here</a> regarding a query of somebodys homeserver (ID or name).</p>\n<p>This other request would be <strong>obsolete if</strong> the request of this character API would get the accountname as a parameter and/ or charactername.</p>\n<p>Please note that ppl already start building their own databases using the mumble API and distributed third party clients.. Any response from ANet for the “Characters” API would be beneficial and may stop this.</p>","arenanet":false},{"pubDate":"2014-09-23T19:00:51.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/4439309","author":"Nicsword.3956","body":"\n<p>Yes, you are correct. Commanders have access to the /supplyinfo and the /squadinfo both of which display the total supply of your followers, but each comes with its own limitations as defined by the guild wars 2 wiki.</p>\n<p>If the supply of each character following the commander was added together using the API then a count can be provided without the need to “ball up”</p>\n<p>Also take into consideration the supply traps and cow trebuchet supply drains over the course of taking a keep, that /supply command result will change drastically if such events occurred and a real time update would be an fyi on what was lost and what they have left while in mid fight with the other server defending said keep.</p>","arenanet":false},{"pubDate":"2014-09-22T14:14:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/4435615","author":"smiley.1438","body":"\n<p>If i remember right, there was a command /supply for that.</p>","arenanet":false},{"pubDate":"2014-09-22T13:27:09.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/4435526","author":"Nicsword.3956","body":"\n<p>It has been a few months since anyone posted ideas but a supply count of each character for WvW would be an interesting statistic especially for commanders who want an instant supply count update of each of their followers.</p>","arenanet":false},{"pubDate":"2014-04-24T18:26:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/3952471","author":"Alcarin.9024","body":"\n<p>I would like to have information about the amount of time that the account and/or every character in that account have played the game (the same information that you could have with the command /age ).</p>","arenanet":false},{"pubDate":"2014-04-06T17:59:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/3864125","author":"wmcastrey.9284","body":"\n<p>I am interested in developing an application that is account linked that acts as an account companion. It would be an additional window into the world while a user is playing. In order to create an app like this I would need the following information. As there was not currently an account section I decided to place it here as character information was the closest in my opinion.</p>\n<p>A character would input their account name without password utilizing the authorization tools (OAuth2) in development. Under that account I would like:<br>\n-Characters<br>\n-Achievements<br>\n-World<br>\n-Friends</p>\n<p>Under Characters I would like:<br>\n-isActive<br>\n-getCurrentLocation<br>\n-getStatus (Health, Conditions/Boons, Downed Bar)<br>\n-getDamageDone (Skill/Condition/Minion/Pet Causing Damage, Damage Amount, and Target)<br>\n-getDamageReceived (Skill/Condition Causing Damage, Damage Amount, and Source)<br>\n-getHealingDone (Skill/Boon/Minion/Pet Causing Healing, Heal Amount, and Target)<br>\n-getHealingReceived (Skill/Boon Causing Healing, Heal Amount, and Source)<br>\n-getCurrentParty (Name, Health, Conditions/Boons, Downed Bar)<br>\n-getCurrentPets/Minions (Name, Health, Conditions/Boons, Time Remaining)</p>","arenanet":false},{"pubDate":"2013-08-13T13:51:40.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2618257","author":"GreyJackal.7319","body":"\n<p>D’oh – missed a page on which several people mentioned it.  Apologies</p>\n<p><del>My one and only wish for a character API interface is to discern which dungeon paths one has completed<img src=\"/include/images/smilies/colondee.png\"></del></p>\n<p><del>I’ll knock something up myself if need be, but if someone’s already planning something more extensive, please consider adding that (assuming that data is exposed if/when one becomes available).</del></p>","arenanet":false},{"pubDate":"2013-06-26T19:24:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2294639","author":"ghostrunners.2437","body":"\n<p>Character API is crucial, so I understand taking the time to get it right. Fortunately, Blizzard has established the gold standard with BattleNet’s Armory, and it has really enhanced their community experience. With the new spectator mode in sPVP, you are now able to obtain character API information in game – and I believe that’s all ArenaNet needs to put out initially in a web format. IMO, I learn a lot by looking at how others build their toon wrt gear, skills, and traits – and it enhances my experience. There are times, however – that I don’t remember what my toon looks like when I’m away from the game, or what I’ve accomplished, and there’s a feeling of disconnect because the information is not readily available at my fingertips. For the long term health of this incredible gw2 mmo, and community – I re-emphasize that the Character API is the key to continued success.</p>","arenanet":false},{"pubDate":"2013-06-21T21:23:26.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2258291","author":"Bear on the job.6273","body":"\n<p>Deleting comments…didn’t realize this thread existed until Forum Mod just merged me here<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2013-05-30T09:11:24.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2119827","author":"SLAYER.3941","body":"\n<p>Character API would be great to build a database with every character like its done by blizzard (Armory). Of course more player information should be available IN THE GAME. So that i can right-click a character and see some information about him…</p>","arenanet":false},{"pubDate":"2013-05-26T05:08:59.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2093062","author":"Amon.3275","body":"\n<p>I’d love to have a way to see character achievements like jump puzzles completed, and other stats like number of WvW kills. In past games, our guild has run contests for most kills in a week, most crafting levels gained, stuff like that. That’s currently impossible in GW2 because there’s no way to see this kind of information about other players.</p>","arenanet":false},{"pubDate":"2013-05-25T18:36:20.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2091145","author":"zwei.9073","body":"\n<p>I would like detailed infromation about character wolrd completition – list of all discovered pois, vistas and completed hearts/challenges.</p>","arenanet":false},{"pubDate":"2013-05-25T02:49:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2088273","author":"Primal Zed.9714","body":"\n<p>Being able to see your inventory (both character and bank) through a web service would be hugely beneficial.</p>","arenanet":false},{"pubDate":"2013-05-24T18:55:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2086345","author":"eldion.8609","body":"\n<p>What I would like to write: Programs that allow players to display additional information about themselves and to display such information about other playes, preferably about the selected player/target.</p>\n<p>For this, I would very much welcome:</p>\n<ul>\n\t<li>The target/player currently selected by my own character</li>\n</ul>\n<p>Name and server of the selected player/target would already suffice for this.</p>","arenanet":false},{"pubDate":"2013-05-24T18:23:33.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2086159","author":"rodadams.5963","body":"\n<p>I’m going to assume that nothing per-character will be release in an un-authenticated world.</p>\n<p>This post thus focuses on what would be good to see an API for in looking at just my own characters:</p>\n<p>Account Wide:<br>\n- Currency Info (laurels/gems)<br>\n- Achievements<br>\n- Bank Inventory (inc Collections Tab &amp; Gold)<br>\n- Guild List</p>\n<p>Per Character:<br>\n- Name<br>\n- Currency (Karma/Gold)<br>\n- Class/Race/Gender<br>\n- Level &amp; XP<br>\n- Crafting: Current level in each, tag which two are active.<br>\n- Fractal Level<br>\n- Story Line Path/Progress (available in Hero Tab)<br>\n- Skill Unlocks &amp; Remaining Skill Pts.<br>\n- Current Traits<br>\n- Inventory, including Equiped items. (say which bag it’s in as well as bag type)<br>\n- Per Map: Heart/Vista/POI/Skill Pt counts, much like you see when hovering on title in map.<br>\n—- Yes, you could list out each point, with a Found/Unfound state, but that would potentially make map clears easier, since you could have an app say that you’re missing some zone, and your last POI is in there.<br>\n- Per Dungeon: Which paths have been completed (inc Story)<br>\n- Unlocked Dye colors</p>","arenanet":false},{"pubDate":"2013-05-24T15:24:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2085092","author":"The Talcmaster.7391","body":"\n<p>I am strongly in favor of letting the user decide what to release.  Rawrfaec brings up many good points about the issues with this sort of thing (facebook and other social media companies have gotten in some hot water over stuff like this).  Even if a user doesn’t wish to report something like their current location, I would still want to know that there are x many unidentified users in an area so that I can create population heatmaps and the like.  I don’t personally have much concern about people in my guilds or friend list knowing my location, but if all the sudden there was a website that had a history of where I specifically was at a given time and when I was logged in, I would start to get a little uncomfortable.</p>","arenanet":false},{"pubDate":"2013-05-24T15:04:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2084963","author":"Nabrok.9023","body":"\n<p>Homeworld would be very useful.</p>","arenanet":false},{"pubDate":"2013-05-24T11:37:05.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2084045","author":"Moturdrn.2837","body":"\n<p>Currently set home world? This is something you can already get information about from within the game itself, and would make it much easier for server sites to lock down access in certain areas to players on that server only.</p>","arenanet":false},{"pubDate":"2013-05-24T06:19:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2082969","author":"Rawrfaec.6412","body":"\n<p>Player agency is nice in principle but it requires a lot of extra work and relying on people to maintain such settings is a fool’s errand. If people have to actively allow access to information we’ll end up not being able to know anything about anyone. If people have to actively deny access we’ll end up being able to know everything about everyone.</p>\n<p>I don’t think hiding account names is sensible as account names aren’t (and shouldn’t be) inherently secret. It’s trivial to get the account name of a character anyway. If account names should be restricted just make it authorized information, which is fair if inconvenient.</p>\n<p>I don’t like having character location reported. Partly I expect that to be a huge drain on resources, partly it has huge privacy implications. I appreciate that it can be useful for, say, guilds, to get around the five-man party size limit, but people have been making that work up until now and I don’t see that changing.</p>\n<p>The ability to view character and bank inventories would be very much welcome. Inventory management is probably too much to hope for but not having to swap characters to move stuff between them would be nothing short of amazing.</p>","arenanet":false},{"pubDate":"2013-05-24T05:05:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Characters/2082690","author":"smiley.1438","body":"\n<p>While we’re at it:</p>\n<p>I’m a friend of “let the owner decide what info he wants to reveal” – this won’t need authorisation and would give people full control of their data. The only thing i’d like to see public would be a characters name. People would have to allow in their game options. So:</p>\n<ul>\n\t<li>Character name (public)</li>\n\t<li>Account name (user decision)</li>\n\t<li>Character location (user decision)</li>\n\t<li>Character data like achievements and stuff (user decision)</li>\n</ul>\n<p>Personal stuff</p>\n<ul>\n\t<li>Friendlist (authorized)</li>\n\t<li>Chat (authorized)</li>\n\t<li>Messages (authorized)</li>\n\t<li>Inventory and chest? (authorized)</li>\n</ul>","arenanet":false}]}