{"title":"[API Suggestion] add times of last change","pubDate":"2013-05-29T20:39:26.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-add-times-of-last-change","comments":[{"pubDate":"2013-05-29T23:35:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-add-times-of-last-change/2117685","author":"smiley.1438","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 29 2013 11:29PM\"><a href=\"/forum/community/api/API-Suggestion-add-times-of-last-change/2117642\">Khisanth.2948:</a></cite></div><div class=\"quotey\"><p>It would enable checking the remaining time on Righteous Indignation without ever being near the camp.</p></div></blockquote>\n<p>Thats already possible without a timestamp<img src=\"/include/images/smilies/wink.png\"></p>\n<p><a href=\"http://mos.millenium.org/na/matchups/map/711\">http://mos.millenium.org/na/matchups/map/711</a></p>","arenanet":false},{"pubDate":"2013-05-29T23:29:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-add-times-of-last-change/2117642","author":"Khisanth.2948","body":"\n<p>There are already existing threads for these suggestions.<br>\n<a href=\"https://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events\">https://forum-en.guildwars2.com/forum/community/api/API-Suggestion-Events</a><br>\n<a href=\"https://forum-en.guildwars2.com/forum/community/api/API-Suggestion-World-vs-World\">https://forum-en.guildwars2.com/forum/community/api/API-Suggestion-World-vs-World</a></p>\n<p>Even with the same suggestion for events.</p>\n<p>For the WvW suggestion that should NOT be done. It would enable checking the remaining time on Righteous Indignation without ever being near the camp.</p>","arenanet":false},{"pubDate":"2013-05-29T20:39:26.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/API-Suggestion-add-times-of-last-change/2117021","author":"Tub.4560","body":"\n<p>Hi,</p>\n<p>I’d like to have access to the time when an event last changed its state, or a WvW objective changed owners.</p>\n<p>For events that are running, I’d like to see if they’ve just started (so I can join) or if they’ve been running for a while (so it’s likely finished by the time I get there) or maybe if they’ve been running for hours (likely to be bugged and worth checking out and reporting).<br>\nIf they’re not running, I’d like to know when they’ve finished last, possibly making a prediction about their next start.</p>\n<p>Same for WvW: did that camp switch owners in the last 5 minutes? Can it be taken back or not? Has the keep been in enemies hands for long, is it likely to be upgraded?</p>\n<p>It’d be nice if a single query to the API could answer these questions.</p>\n<p>Of course I can get that data by continuously polling the API, comparing with a local cache and inserting the time of change on my own. This is however<br>\na) inaccurate, since I really shouldn’t poll every second<br>\nb) a waste of my bandwidth and system resources<br>\nc) a waste of ANet’s bandwidth and system resources<br>\nd) likely to get me a scolding from the College of Statics<img src=\"/include/images/smilies/wink.png\"></p>\n<p>My suggestion is to change the APIs as follows. The events.json might return something like this:</p>\n<pre><code>{\n  \"current_time\": 1369858634,\n  \"events\":[\n   {\"world_id\":42,\"map_id\":42,\"event_id\":\"12345\",\"state\":\"Success\",\"laststatechange\":1369858217},\n   {\"world_id\":42,\"map_id\":42,\"event_id\":\"67890\",\"state\":\"Active\",\"laststatechange\":1369858453},\n   ...\n}</code></pre>\n<ul>\n\t<li>.current_time is optional. It would be useful for synchronization, making it easier to deal with network lag or poorly synchronized local clocks.</li>\n\t<li>.laststatechange is the time when the value of .state changed to the value it currently has. I don’t really care about the time format. Unix timestamps may be the most efficient in terms of encoding and calculations (seconds_since_change = myevent.laststatechange – data.current_time), but a properly formatted datestring should be workable, too.</li>\n\t<li>Similary for wvw, match_details.json should add .lastownerchange to all objectives. Maybe lastownerguildchange for completeness’ sake.</li>\n</ul>\n<p>Of course a proper push API would be even better, but since we’re stuck with polling, this is the next best thing to reduce load while increasing accuracy. It it possible to add this information with the current architecture, or should I expect to keep polling for my project?</p>\n<p>Oh, and while I’m here: thank you ANet for this awesome toy!</p>","arenanet":false}]}