{"title":"Application suspended from Google Play","pubDate":"2015-09-18T07:22:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-suspended-from-Google-Play","comments":[{"pubDate":"2015-09-23T08:10:39.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-suspended-from-Google-Play/5518933","author":"Shadowblade.6350","body":"\n<p>As suggested, I sent an email to support@arena.net 2 days ago (which got an autoreply requesting me to use the Guildwars 2 support site, I did it too).</p>\n<p>Thank you for helping me to solve this problem !</p>","arenanet":false},{"pubDate":"2015-09-22T21:41:55.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-suspended-from-Google-Play/5517810","author":"Gaile Gray.6029","body":"\n<p>Hooray for Pat!  <img src=\"/include/images/smilies/smile.png\"></p>\n<p>We’ll get this sorted for you, Shadowblade, and for others who may come across this issue.</p>","arenanet":true},{"pubDate":"2015-09-18T18:45:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-suspended-from-Google-Play/5505520","author":"Pat Cavit.9234","body":"\n<p>Shadowblade, send an email to support@arena.net with the subject “GW2 App blocked by Google” and a copy of your initial forum post and they’ll try to get you sorted.</p>\n<p>Sorry for the trouble, our legal team will be working to clarify the TOSes for this sort of situation so it should get better in the future!</p>","arenanet":true},{"pubDate":"2015-09-18T17:38:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-suspended-from-Google-Play/5505268","author":"Pat Cavit.9234","body":"\n<p>Hey gang, I’ve raised this question internally to try to get some clarification on the situation.</p>","arenanet":true},{"pubDate":"2015-09-18T16:30:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-suspended-from-Google-Play/5505020","author":"Teranas.6150","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on September 18 2015 02:56PM\"><a href=\"/forum/community/api/Application-suspended-from-Google-Play/5504759\">Shadowblade.6350:</a></cite></div><div class=\"quotey\"><p>I have already exposed my problem at community@arena.net, and the CM suggested to post in this forum.</p></div></blockquote>\n<p>That’s pretty funny according to the page I posted earlier where they redirect any questions to that mail address.</p>\n<p>I agree with you, that’s something that must be clarified.</p>","arenanet":false},{"pubDate":"2015-09-18T14:56:51.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-suspended-from-Google-Play/5504759","author":"Shadowblade.6350","body":"\n<p>All apps were free, but the one I am talking about in this thread (WvW Assistant) contained ads, which could be removed by paying.<br>\nBut anyone could perfectly use the app without paying.</p>\n<p>According to the following thread, the GW2 API can be used for commercial use, as long as the project complies with the terms of use  :<br>\n<a href=\"https://forum-en.guildwars2.com/forum/community/api/API-Documentation\">https://forum-en.guildwars2.com/forum/community/api/API-Documentation</a></p>\n<p>Concerning the Content Terms of Use, my assets are :<br>\n- The tiles provided by the GW2 Tiles API, to display the WvW map.<br>\n- Assets provided by the GW2 Files API, for some icons.<br>\n- Assets I personally created.</p>\n<p>I think that Google won’t accept a simple forum post.<br>\nIn fact, I have already sent them the link for a previous app suspension, but I think they didn’t take the time to read it, because they never replied.<br>\nThat’s why I request an official document.</p>\n<p>I have already exposed my problem at community@arena.net, and the CM suggested to post in this forum.</p>","arenanet":false},{"pubDate":"2015-09-18T14:01:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-suspended-from-Google-Play/5504591","author":"Teranas.6150","body":"\n<p>There’s an info page about this issue:</p>\n<p><a href=\"https://www.guildwars2.com/en/legal/guild-wars-2-content-terms-of-use/\">https://www.guildwars2.com/en/legal/guild-wars-2-content-terms-of-use/</a></p>\n<p>No clue if that’s enough for Google. As far as your apps are free for all I don’t see any problem.</p>\n<p>If the page isn’t enough you can also send an email to community@arena.net. That’s the suggested way to go.</p>\n<p>PS: You definitely shouldn’t post your email on a public board …</p>","arenanet":false},{"pubDate":"2015-09-18T07:22:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Application-suspended-from-Google-Play/5503900","author":"Shadowblade.6350","body":"\n<p>Hello,</p>\n<p>As suggested by the Community Manager I contacted by email, I post my problem in this forum to get some help.</p>\n<p>Two years ago, I created and published an Android app based on the World versus World API, which displayed the battlefield current state to the user : <strong>GuildWars 2 WvW Battle Map</strong>. Later, I renamed it <strong>WvW Assistant</strong>.</p>\n<p>One week ago, I published an update to this app on Google Play to provide a better user interface and a better user experience, but their team decided to suspend the app from the store because of the following reason :</p>\n<p><strong>REASON FOR SUSPENSION:Violation of the impersonation or deceptive behavior (<a href=\"https://play.google.com/about/developer-content-policy.html#impersonation\">https://play.google.com/about/developer-content-policy.html#impersonation</a>) provisions of the Content Policy. Please refer to the impersonation policy help article (<a href=\"https://support.google.com/googleplay/android-developer/answer/2986097\">https://support.google.com/googleplay/android-developer/answer/2986097</a>) for more information.</strong></p>\n<p>If I understand it correctly, the Google Play team suspects me to use the GuildWars 2 brand without the company permission.</p>\n<p>That’s not the first time they suspend one of my GuildWars 2 related apps from the store, always for the same reason.<br>\nI tried to ask them what specific details they wanted to see modified, but they never gave the response.</p>\n<p>As a consequence, all my GW2 related apps are suspended from Google Play, and my Google Play Developer account has also been suspended.</p>\n<p>My only hope to resolve this problem is to send a document to the Google Play team,  which proves that ArenaNet is OK with me publishing GW2 related apps on Google Play.<br>\nTo be clear, this is the description of  the kind of document they request :<br>\n<strong>Please provide a document that proves you have the rights to use specific content, icons, images, etc.</strong></p>\n<p>Has anyone here had the same problem ?</p>\n<p>Can anyone from the staff provide me with an official document that I could send to the Google Play team ?</p>","arenanet":false}]}