{"title":"Are we allowed to...","pubDate":"2013-07-14T15:12:09.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Are-we-allowed-to","comments":[{"pubDate":"2013-07-26T21:50:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Are-we-allowed-to/2495440","author":"Stephane Lo Presti.7258","body":"\n<p>FYI, and in case you didn’t see it, we posted the sticky here:<br>\n<a href=\"https://forum-en.guildwars2.com/forum/community/api/Welcome-to-the-API-Development-subforum/first#post2469979\">https://forum-en.guildwars2.com/forum/community/api/Welcome-to-the-API-Development-subforum/first#post2469979</a></p>\n<p>We’ve discussed opening a subforum for this but decided against it as it adds just another one, and there are already a lot of them already. If there’s a high demand for such a subforum (not in the API Development subforum but on the Fan-generated Content subforum), we may reconsider. But until then, please follow these rules. Thank you!</p>","arenanet":true},{"pubDate":"2013-07-22T21:03:24.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Are-we-allowed-to/2463641","author":"synk.6907","body":"\n<p>I agree with you -- I head to the Fan-generated Content section looking for discussions about the various community sites that have been created and instead have to wade through fanfiction and art commissions.</p>\n<p>I don’t think the two styles of user content overlap enough, personally, if you folks are open to splitting them.</p>\n<p>edit: Also I need to stop alt-tabbing while playing and getting killed writing posts :P.</p>","arenanet":false},{"pubDate":"2013-07-22T17:27:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Are-we-allowed-to/2462286","author":"Illconceived Was Na.9781","body":"\n<p>The fan-generated content forum is, unfortunately, 99% about stuff other than tools. It has posts about art, fan fiction, lore speculation, and so on. I’m usually against adding “yet another” sub-forum, but in this case, I would find it easier to find apps/websites and provide feedback if there was a “fan-created applications” or “fan-developed tools” folder, parallel to “fan-generated content.”</p>","arenanet":false},{"pubDate":"2013-07-19T17:44:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Are-we-allowed-to/2445366","author":"Stephane Lo Presti.7258","body":"\n<p>Hey AdelphiA.9287,</p>\n<p>We’ll publish soon a sticky in this subforum to better explain the rules, but here’s basically the answer to your question in two parts:</p>\n<ul>\n\t<li>You can have a thread in the API Development subforum but it has to be a technical discussion between API application developers exclusively (and posts from non-developers should be reported so that we can enforce this rule so that we can keep this subforum focused on API Development)</li>\n\t<li>You can create a thread in the Fan-generated Content subforum to have a more general discussion and feedback gathering (including bug reports) with the users of your API application; the forum’s <a href=\"https://forum-en.guildwars2.com/forum/rules\">Code of conduct</a> and <a href=\"https://forum-en.guildwars2.com/forum/community/fangen/About-Fan-Generated-Content\">specific subforum guidelines</a> apply</li>\n</ul>\n<p>Let us know if you have questions or comments.<br>\nThanks for supporting the GW2 API!</p>","arenanet":true},{"pubDate":"2013-07-14T17:38:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Are-we-allowed-to/2411953","author":"Healix.5819","body":"\n<p>“The API Development subforum is not intended for general discussions about the API, but rather technical discussions about how to use the API for developers of applications.”</p>","arenanet":false},{"pubDate":"2013-07-14T15:12:09.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Are-we-allowed-to/2411358","author":"AdelphiA.9287","body":"\n<p>… use this site for feedback on our apps? If we created a topic specifically called the name of our application for people to give feedback, report bugs etc. (and to possibly make donations) would this be acceptable or should this really be kept “outside” of API Development forum?</p>\n<p>I’m guessing this needs to be answered by Cliff or one of the ANet team.</p>","arenanet":false}]}