{"title":"Are ads allowed?","pubDate":"2015-09-07T15:46:05.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Are-ads-allowed","comments":[{"pubDate":"2015-09-07T17:40:14.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Are-ads-allowed/5466646","author":"darthmaim.6017","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 14 2013 11:01PM\"><a href=\"/forum/community/api/API-Documentation/2028044\">Cliff Spradlin.3512:</a></cite></div><div class=\"quotey\"><p>API Terms:</p>\n<p>These API’s are wholly owned by ArenaNet, LLC (“ArenaNet”). Any use of the API’s must comply with the <a href=\"https://www.guildwars2.com/en/legal/website-terms-of-use/\">Website Terms of Use</a> and <a href=\"https://www.guildwars2.com/en/legal/guild-wars-2-content-terms-of-use/\">Content Terms of Use</a>, however you may use the API’s to make commercial products so long as they are otherwise compliant and do not compete with ArenaNet. ArenaNet may revoke your right to use the API’s at any time. In addition, ArenaNet may create and/or amend any terms or conditions applicable to the API’s or their use at any time and from time to time. You understand and agree that ArenaNet is in the process of developing a full license agreement for these API’s and ArenaNet will publish it when it is complete. Your continued use of the API’s constitutes acceptance of the full license agreement and any related terms or conditions when they are posted.</p></div></blockquote>\n<p>So based on the “you may use the API’s to make commercial products so long as they are otherwise compliant and do not compete with ArenaNet” I’d say yes (IANAL).</p>","arenanet":false},{"pubDate":"2015-09-07T15:46:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Are-ads-allowed/5466219","author":"Hakor.7580","body":"\n<p>The terms state: “The content must be used in a non-commercial context for private, personal use only”</p>\n<p>Is it allowed to embed ads in a website using the API?</p>","arenanet":false}]}