{"title":"Basic API calls with JQuery","pubDate":"2013-06-09T15:19:16.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Basic-API-calls-with-JQuery","comments":[{"pubDate":"2013-11-11T11:41:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Basic-API-calls-with-JQuery/3185084","author":"sorenrye.7238","body":"\n<p>It has been some months now. Did you update the code in your links, fx wrt to local caching?</p>\n<p>What is the status of your project?</p>","arenanet":false},{"pubDate":"2013-06-10T12:48:26.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Basic-API-calls-with-JQuery/2186551","author":"Rawrfaec.6412","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on June 10 2013 08:12AM\"><a href=\"/forum/community/api/Basic-API-calls-with-JQuery/2185722\">Tribio.8531:</a></cite></div><div class=\"quotey\"><p>Indeed, the code needs to be optimalised some more (as you mention, use the JQuery functionality a bit more).</p></div></blockquote>\n<p>Actually, using more jQuery will increase overhead. It takes quite a bit for that to be noticeable and the consistency can be worth more in the long run from a perspective of maintenance but raw JavaScript always outperforms jQuery. You certainly wouldn’t notice the difference in this case, however.</p>","arenanet":false},{"pubDate":"2013-06-10T08:12:08.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Basic-API-calls-with-JQuery/2185722","author":"Tribio.8531","body":"\n<p>Thank you for the feedback, much appreciated..<br>\nIndeed, the code needs to be optimalised some more (as you mention, use the JQuery functionality a bit more). Also I have to investigate some caching of the JSON-data, so that I don’t have to make constant API calls over Inet.. Work in progress, of course..<br>\n<em>Ultimate plan is to get an overview like gw2thelazy for only my server (Fissure of Woe) where I can easily see the quest progress for the world bosses and our overall standing in WvW..</em></p>","arenanet":false},{"pubDate":"2013-06-10T05:55:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Basic-API-calls-with-JQuery/2185283","author":"ElGreenGo.6734","body":"\n<p>That is a pretty good example of basic API use with jQuery. I would change a couple of things. You are using getElementById several places, since you are already using jQuery for the Ajax calls you could shorten document.getElementById(“some_id”).innerHTML=output; to $(“#some_id”).html(output);. Likewise, the $.ajax calls could be shortened and be made a little easier to read if you used the $.getJSON helper function instead.</p>","arenanet":false},{"pubDate":"2013-06-09T15:19:16.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Basic-API-calls-with-JQuery/2182335","author":"Tribio.8531","body":"\n<p>Hello everyone,</p>\n<p>After reading a bit through the API documentation the urge to start programming reappeared on my side.. So I did some work today and yesterday and thought it’d be handy to share my code with you guys?</p>\n<p>I believe very new API programmers might find it handy for reference, and I hope that advanced API experts might correct me or provide me with some nice comments..</p>\n<p>Anyway, here she goes (all is in one .html-file)..</p>","arenanet":false}]}