{"title":"[Bug] Tequatl the Sunless event states","pubDate":"2013-05-23T14:52:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Bug-Tequatl-the-Sunless-event-states","comments":[{"pubDate":"2013-05-23T18:00:37.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Bug-Tequatl-the-Sunless-event-states/2079704","author":"rodadams.5963","body":"\n<p>Something to keep in mind here is that they build all of these states in the way which suited their designers, etc. <br>\nMaking things like Dragon Timers easy to code was not a priority.</p>\n<p>It also makes sense… they likely don’t see a “wait three hours, then have a 30min window” like we do. Once he dies, they roll the dice and wait 180 to 210min before “There’s something in the water” again.</p>\n<p>As has been pointed out before, this is a common occurance for them, where “warmup” can include the entire wait period, and it goes immediately from Active → Warmup</p>","arenanet":false},{"pubDate":"2013-05-23T15:33:07.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Bug-Tequatl-the-Sunless-event-states/2078954","author":"Terrasque.8735","body":"\n<p>Why do you think it’s a bug? Tequatl have no fail state, no followup, and thus won’t need a specific success  state either.</p>\n<p>Warmup is when a condition is missing for the event to start, in Tequatl’s event it’s time . I guess they set a new time when he dies (3h+random) and sets the event to Warmup.</p>\n<p>Thakitten  means something else than what you hoped for doesn’t necessarily make it a bug</p>","arenanet":false},{"pubDate":"2013-05-23T15:10:49.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Bug-Tequatl-the-Sunless-event-states/2078840","author":"Uttar.2341","body":"\n<p>A LOT of events are like that though so it’s hardly worth reporting it individually. It’s possible that the “Preparation” state they are adding/fixing will improve that in the next patch but we’ll see<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2013-05-23T14:52:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Bug-Tequatl-the-Sunless-event-states/2078751","author":"Opt.3714","body":"\n<p>The “Defeat Tequatl the Sunless” event only has the states “Active” and “Warmup.” In order for the “Warmup” state to be meaningful the event should spend some time in its Success state first. I.E., when Tequatl is killed the event should be in the Success state until the start of its next spawn window, when it should switch to Warmup.</p>\n<p>Event ID: 568A30CF-8512-462F-9D67-647D69BEFAED</p>","arenanet":false}]}