{"title":"Easy way to compile API data?","pubDate":"2013-10-09T21:25:22.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Easy-way-to-compile-API-data","comments":[{"pubDate":"2013-10-10T01:02:39.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Easy-way-to-compile-API-data/2997049","author":"Ryan.9387","body":"\n<p><a href=\"https://forum-en.guildwars2.com/forum/community/api/Guide-to-the-Black-Lion-Trading-Co-API/first#post2962070\">https://forum-en.guildwars2.com/forum/community/api/Guide-to-the-Black-Lion-Trading-Co-API/first#post2962070</a></p>\n<p>You may try to look at this section of the guide.</p>\n<p>?text=&amp;levelmin=0&amp;levelmax=80<br>\nThis combination will return a list of all the items along with their buy and sell listings and prices. By default this only returns 10 items at a time, but this is adjustable by the count= parameter. If count=0 it will return all of the items in the list. The offset= parameter starts the listing based on that number in the list (1 is the first item) The text= can be filled in to filter by the item name, but leaving it blank is still valid. levelmin and levelmax require valid numbers to be entered. Other filters that are optional are removeunavailable=true, rarity=, type=, and subtype= (these last 3 require their numeric representation, not characters). WARNING: This can pull in ALL ITEMS and can take a long time to run and take a great deal of memory to process</p>\n<p>I haven’t used it myself, but if it is true you could just pull all data and deal with the filtering on your end rather than filtering before pulling data.</p>","arenanet":false},{"pubDate":"2013-10-09T22:34:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Easy-way-to-compile-API-data/2996366","author":"smiley.1438","body":"\n<p>I think you may want to take a look at this: <a href=\"https://github.com/codemasher/gw2-database\">https://github.com/codemasher/gw2-database</a></p>","arenanet":false},{"pubDate":"2013-10-09T21:25:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Easy-way-to-compile-API-data/2995998","author":"Lexxon.3147","body":"\n<p>I want to make a crafting assistance utility, but the way the API is set-up makes things difficult for me. There’s the items and item_details repositories, but they make it incredibly difficult to mine the information I need to create my utility.</p>\n<p>I have an enormous list of item ID’s over here, but I don’t know what items they go with until I make a call to the other repository. I tried to automate things, but I think I hit a rate limit because I’m required to make n+1 HTTP requests where n is the number of items in all of GW2.</p>\n<p>Is there an API that makes things easier on me?  Is there a way to go about this using the items and item_details lists better than I currently am?</p>\n<p>As further explanation, I want to either collect information on all of the potential crafting materials and outputs (I’m focusing on cooking first) so I can form a database, or I want to be able to readily use information about an item or set of items as keys to refer to other items (essentially use the static API as it exists as my “database”, which I think is the point of its existence in the first place, but I can’t wrap my head around how it’s supposed to be useful as a pile of disembodied keys).</p>\n<p>Thanks for any insight you can provide.</p>","arenanet":false}]}