{"title":"GW2 Navi potential banning?","pubDate":"2017-01-02T17:44:28.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/GW2-Navi-potential-banning","comments":[{"pubDate":"2017-01-02T20:19:54.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/GW2-Navi-potential-banning/6452562","author":"Half Mystic.9072","body":"\n<p>Thanks everyone for the replies, really eased our worries. We’ll continue to use it, it’s really entertaining to just mind-numbingly follow the overlay while watching something on Netflix.</p>\n<p>Happy gaming!</p>","arenanet":false},{"pubDate":"2017-01-02T18:50:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/GW2-Navi-potential-banning/6452492","author":"Azure Fang.8605","body":"\n<p>Read further in the Navi thread. The user that was banned for using Navi was reinstated. There was apparently a misunderstanding somewhere. As long as an app does not access GW2 in memory and does not breach the “one key – one action” rule (excluding macro programs used exclusively to drive musical instruments), you should be fine. Navi has been well accepted by both Dev and Support and is perfectly safe.</p>\n<p>Here’s a resolution thread from reddit about the banned player: <a href=\"https://www.reddit.com/r/Guildwars2/comments/5e6k2t/player_claims_their_account_was_closed_because/daa3dw3/\">https://www.reddit.com/r/Guildwars2/comments/5e6k2t/player_claims_their_account_was_closed_because/daa3dw3/</a></p>","arenanet":false},{"pubDate":"2017-01-02T18:40:51.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/GW2-Navi-potential-banning/6452481","author":"Inculpatus cedo.9234","body":"\n<p>You are unlikely to get a response from an ArenaNet official on the forums, nor through a ticket, about 3rd party programs. (Check the Sticky above.) The best you can do is check the API sub-forum or the Wiki to see if your app is listed, if you don’t feel comfortable with  posters’ advice.</p>\n<p>Good luck.</p>","arenanet":false},{"pubDate":"2017-01-02T17:58:33.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/GW2-Navi-potential-banning/6452439","author":"rapthorne.7345","body":"\n<p>it’s an overlay that just displays info available in the API, it’s fine to use and there are several overlay projects floating around. The one I use is Guild Wars 2 Personal Assistant Overlay.</p>\n<p>These programs just fetch info from the API to give you access to game state info without having to tab out to a browser to do the same thing.</p>\n<p>It only becomes something you can be banned for when it displays info you should not have access to (for example, using hex editing/ “ram reading” software), like player gear, location of someone in stealth in PvP, etc. That sort of thing.</p>","arenanet":false},{"pubDate":"2017-01-02T17:44:28.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/GW2-Navi-potential-banning/6452433","author":"Half Mystic.9072","body":"\n<p>An overlay, “GW2 Navi”, has really caught me and my wife’s attention, so we started to use it – renewing our enjoyment out of world completion due to it’s fun little function of giving a guided tour of Tyria.</p>\n<p>But a thought came up, can we get banned for using this? We didn’t think so because it’s merely an overlay like Overwolf for example, but before we continue to use it, I wanted to get a reply from a mod for 100% certainty if possible.</p>\n<p>Just a yes or no would be fantastic from someone an Anet. We love GW2 and we put a lot of time/money into our accounts, and it would be terrible to loose them over something so simple.</p>\n<p>The website to obtain GW2Navi is : <a href=\"http://forum.renaka.com/topic/5546166/1/\">http://forum.renaka.com/topic/5546166/1/</a></p>\n<p>Thanks.</p>","arenanet":false}]}