{"title":"How feasible would this be?","pubDate":"2015-07-20T17:05:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/How-feasible-would-this-be","comments":[{"pubDate":"2015-07-20T19:28:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/How-feasible-would-this-be/5301558","author":"Menadena.7482","body":"\n<p>Thanks!</p>\n<p>Now if there was an easier way to get a list rather than hovering over each item. Hint to anet.</p>","arenanet":false},{"pubDate":"2015-07-20T18:53:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/How-feasible-would-this-be/5301409","author":"Abominable Snowman.2036","body":"\n<p>I have <a href=\"http://gw2cookbook.azeban.hackedd.nl/skins\">a page</a> (<a href=\"http://i.imgur.com/fcyEiLe.png\">screenshot</a>) that does most of that, but (because of the missing API) you have to manually keep track of the skins you have and which you still need.</p>\n<p>However, it does remember them for you, allows you to search by name, and can show you the items it knows that have that particular skin.</p>\n<p>I also looked into something that would allow me to more easily work towards completion (<em>“show me the cheapest sword skins I don’t have yet”</em>), but it turns out that for a <em>lot</em> of the skins there aren’t any items in the API with that skin.</p>","arenanet":false},{"pubDate":"2015-07-20T17:48:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/How-feasible-would-this-be/5301136","author":"Menadena.7482","body":"\n<p>Yes, someone else already told me I was not insane. That I could not do all of it yet but the wardrobe would probably be in the character api if it was ever included. I knew the TP part would work as there are already plenty of sites and apps where it is used.</p>","arenanet":false},{"pubDate":"2015-07-20T17:21:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/How-feasible-would-this-be/5301016","author":"smiley.1438","body":"\n<p>It’s not yet possible to get the unlocked skins of an account (and theres no PR on that yet: <a href=\"https://github.com/arenanet/api-cdi/pulls\">https://github.com/arenanet/api-cdi/pulls</a>), but if so, all this would be possible – the TP data is already available and so are item databases.</p>","arenanet":false},{"pubDate":"2015-07-20T17:05:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/How-feasible-would-this-be/5300927","author":"Menadena.7482","body":"\n<p>I vaguely am remembering something that would allow you to authenticate to get player data? Or am I mistaken? If so would this be possible?</p>\n<p>Scan my wardrobe for what skins I need. Look them up in the TP. Tell me which skins exist and how much they will cost me to add. Extra points for UI design (selecting sort parameters and filters) and thumbnails of what they look like. I would use that even if I was at my computer as I could see it being a huge timesaver for collecting skins. If not at my computer I could see it a handy way to plan out purchases when I was not busy.</p>","arenanet":false}]}