{"title":"How should we handle maps that overlap","pubDate":"2016-05-27T19:34:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/How-should-we-handle-maps-that-overlap","comments":[{"pubDate":"2016-06-01T22:05:20.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/How-should-we-handle-maps-that-overlap/6183894","author":"Drant.5902","body":"\n<p>Dry Top bounds overlapping Silverwastes is probably a bug (one I noticed since long last year), although when used in junction with the MumbleLink API, it works in locating your character whether in Silverwastes or Dry Top.</p>\n<p>The solution is to create a special case when dealing with Dry Top, here’s a snippet of my precached version of the map JSON:</p>\n<pre><code>\n\"silverwastes\":\n{\n\tid: \"1015\",\n\tmap_rect: [[-24576, -18432], [24576, 18432]],\n\tcontinent_rect: [[3840, 14208], [5888, 15744]]\n},\n\"drytop\":\n{\n\tid: \"988\",\n\tmap_rect: [[-24576, -30720], [24576, 30720]],\n\tcontinent_rect: [[3840, 15744], [5888, 17152]],\n\tcontinent_rect_actual: [[3840, 14592], [5888, 17152]]\n},\n</code></pre>\n<p>-</p>\n<p>Notice the extra “continent_rect_actual” bounds which is what’s in the API, and is used for when I need to find the character’s in game position. But for when using the web map, I use my own measured “continent_rect”.</p>","arenanet":false},{"pubDate":"2016-05-28T13:47:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/How-should-we-handle-maps-that-overlap/6177623","author":"Reincarnated.1754","body":"\n<p>I have noticed this.<br>\nMy app. only opens information for one map at a time. So it’s not a problem for me.<br>\nI guess something should be done.</p>\n<p>You can see it more clearly in these screen shots I took in one of my little tools.</p>\n<p><a href=\"http://img.techpowerup.org/160528/capture266.jpg\" title=\"1015\">Silverwastes</a></p>\n<p><a href=\"http://img.techpowerup.org/160528/capture265.jpg\" title=\"988\">Dry Top</a></p>","arenanet":false},{"pubDate":"2016-05-27T19:34:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/How-should-we-handle-maps-that-overlap/6176695","author":"cvpcs.5914","body":"\n<p>Hello, I’m not sure if this has been addressed before but I wasn’t able to get the forum search to work.</p>\n<p>I have been investigating an issue I have with my mapping program that uses the coordinates from v2/continents to display a website map. Basically, to reduce clutter I only display map data (POIs, Tasks, etc) if the center of the viewport is hovered over a map (determined by looking at the center of the viewport and comparing it to the values in continent_rect across all maps).</p>\n<p>This works well except with Silverwastes. Whenever I hover over Silverwastes the Dry Top map data displays.</p>\n<p>I investigated the data and it appears that the problem is that continent_rect for dry top is [(3840, 14592), (5888, 17152)], while silverwastes is [(3840, 14208), (5888, 15744)]. As you can see, dry top’s top-left Y value 14592 is less than silverwaste’s bottom-right Y value 15744, effectively overlapping the dry top rect and the silverwastes  rect. Since I was short-circuiting my map-find algorithm once one was a map was found, dry top was always given priority because its map id is lower than silverwastes and the for loop was iterating over an ordered array of maps by map ids.</p>\n<p>So my question is how should this situation be handled client-side? I know that the X/Z translation depends on map_rect + continent_rect, so making the continent rects not overlap is probably a non-trivial affair from a game perspective. I was able to work around it by simply reversing my search order, but can we always assume that higher map ids should always be overlayed on top of maps with lower ids?</p>\n<p>Thanks!</p>","arenanet":false}]}