{"title":"I'd like some help with the API.","pubDate":"2014-05-30T09:07:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/I-d-like-some-help-with-the-API","comments":[{"pubDate":"2014-05-30T20:45:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/I-d-like-some-help-with-the-API/4075035","author":"DixieCrafting.5017","body":"\n<p>What a shame that there’s no chat API.</p>\n<p>Thank you for the links, especially the GW2.NET library, I think I’ll use that.</p>","arenanet":false},{"pubDate":"2014-05-30T11:56:04.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/I-d-like-some-help-with-the-API/4073199","author":"StevenL.3761","body":"\n<p>There is no official chat API, so there’s no guide that you could’ve missed.</p>\n<p>For a list of services that you can use, look at the <a href=\"http://wiki.guildwars2.com/wiki/API\">documentation</a>.</p>\n<p>Shameless self-promotion: if you’re planning to use C#, don’t even think about starting from scratch. Instead, use the great and awesome <a href=\"https://gw2dotnet.codeplex.com/\">GW2.NET</a> code library.<br>\nGW2.NET implements support for every official API endpoint.</p>","arenanet":false},{"pubDate":"2014-05-30T09:07:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/I-d-like-some-help-with-the-API/4072883","author":"DixieCrafting.5017","body":"\n<p>Hello.</p>\n<p>As the title states, I’d like to use the API, but I honestly have no idea how. <br>\nI program in C# and C++, but I rarely use APIs and when I do, they always have a nice guide on how to use their API. I don’t know if I missed the guide (excuse me if I did), but could you please link me to it if there is one?</p>\n<p>I intend to create a chat application that will let you communicate with your friends from Guild Wars 2 outside Guild Wars 2. If there already is an application that can do this, then please link me to it. Even if there IS an application that can accomplish this task, I’d still like to get a link to a guide that can show me how to use the GW2 API.</p>\n<p>I apologize if this question has been answered a lot.</p>\n<p>Thanks in advance.</p>","arenanet":false}]}