{"title":"I'm new to programming","pubDate":"2015-07-01T20:27:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/I-m-new-to-programming","comments":[{"pubDate":"2015-07-06T18:50:13.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/I-m-new-to-programming/5253631","author":"Killer Rhino.6794","body":"\n<p>Wonder if <a href=\"https://forum-en.guildwars2.com/forum/community/api/Starting-an-API/first#post3040154\">this</a> would be of any help to you.</p>","arenanet":false},{"pubDate":"2015-07-03T01:07:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/I-m-new-to-programming/5242307","author":"fishball.7204","body":"\n<p>API keys are usually public keys which you give to websites or applications so they can access a subset of data without ever needing your password or username.</p>\n<p>For GW2, the API information comes in <a href=\"https://en.wikipedia.org/wiki/JSON\">JSON</a> format which you can call via a URL endpoint either using a HTTP GET request or authenticated headers. In simple layman terms, you can obtain the information in a blob from a link such as <a href=\"https://api.guildwars2.com/v2/items\">https://api.guildwars2.com/v2/items</a> which will give you a full list of item IDs. You can view some example of authenticated ones in this thread <a href=\"https://forum-en.guildwars2.com/forum/community/api/Launching-inventory-endpoints/first\">https://forum-en.guildwars2.com/forum/community/api/Launching-inventory-endpoints/first</a></p>","arenanet":false},{"pubDate":"2015-07-02T14:53:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/I-m-new-to-programming/5240257","author":"Aralicia.6157","body":"\n<p>Welcome into the world of programming.<br>\nThe GW2 API is a still growing API that permit access to some of the data of the gw2 game, out of the game.<br>\nIt allows, for example, access to Trading Post prices, Recipe, Event and recently Inventory/Bank content.</p>\n<p>The API keys you can create in your account section are a special authentication key that you can give to applications to let them securely access some data about your characters.</p>\n<p>The API is used by multiple apps and websites (more than a few are listed in this subforum).</p>\n<p>If you want to dive a bit more in how the API can be used, you can take a look to the <a href=\"http://wiki.guildwars2.com/wiki/API:Main\">API Wiki</a></p>","arenanet":false},{"pubDate":"2015-07-01T20:27:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/I-m-new-to-programming/5237711","author":"Evga.2471","body":"\n<p>As the title says. I’m currently taking an intro software design class at my local college (the course is called ITP 100 if any of wanted to know). The teacher for the class covered Application Programmers Interface. Of course I saw this API key thing on the GW2 (under my account). Not really sure how the key works and what tool or application I can use?</p>\n<p>Well with that said any response to this post is appreciated. Thanks for your time.</p>","arenanet":false}]}