{"title":"ID's for meta event chains...","pubDate":"2013-05-20T23:58:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/ID-s-for-meta-event-chains","comments":[{"pubDate":"2013-06-02T10:18:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/ID-s-for-meta-event-chains/2139993","author":"AdelphiA.9287","body":"\n<p>This is a simple process if you care to spend the time on it.  For those that can’t or those that don’t have the time, here is an example of what I do for my chest events in PHP. (NOTE: I have abbreviated the list)</p>\n<pre><code>class chestEventClass\n{\n\tpublic $events = Array(\n\t\t// Name, boss, actual event ID, linkedevent count, final pre event ID, ... first pre event ID\n\t\t// Behemoth\n\t\tArray('Secrets in the Swamp','Behemoth','31CEBA08E44D472F81B07143D73797F5',4,'363301407A61470899EB010B10420E39','CFBC4A8C2917478A90631A8B43CC8C38','E539A5E3A33B4D5FAEED197D2716F79B','AFCF031AF71D4CEA85E1957179414B25'),\n\t\t// Golem Mark II\n\t\tArray('Defeat the Inquest\\'s Golem Mark II','Golem Mark II','9AA133DCF6304A0EBB5DEE34A2B306C2',1,'3ED4FEB4A976459794E88BFD9053522F'),\n\t\t// Jormag\n\t\tArray('Breaking the Claw of Jormag','Jormag','0464CB9E18484AAABA314779A959DD71',5,'BFD87D5B64194637AFC535357932AD2C','0CA3A7E35F664651B0CBC45D3F0CAD95','96D736C4D2C64392982FAC6B8EF3B1C8','C957AD9925E14DB09938F54D9F23587B','429D6F3E079C4DE08F9D8F75A222DB36'))\n}</code></pre>","arenanet":false},{"pubDate":"2013-06-02T04:36:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/ID-s-for-meta-event-chains/2139008","author":"Zhentar.6810","body":"\n<p>That presumes that there are simple database fields that determine what event triggers on a success or failure. That seems like a rather rigid and narrow sighted design; I doubt it’s the case. The next event in the chain is likely triggered by a script run at the completion of the previous event, so providing that information would either require the API to parse the scripts to try to pick out any events it triggers, or would require manual data entry that would probably only be marginally more reliable than the wiki.</p>","arenanet":false},{"pubDate":"2013-06-01T00:35:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/ID-s-for-meta-event-chains/2131849","author":"Acuba.4312","body":"\n<p>The cronjob is up and running. It collects the data from the temple events and the dragon events (at least from the belonging events which I found on the English and German wiki). I plan to add the world boss metas and the champion metas which yield a daily bonus chest. <br>\nThe problem is that I have to use the data the wikis provide. They might not be complete (as with the differences of the Lyssa meta between the German and English wiki) or correct.</p>\n<p>The example I attached is a quick dump of the Grenth Temple Meta. Just remove the .txt file ending and watch it in browser.</p>\n<p>It’s clearly that the events have handlers which can invoke other events. And the events seem to have a static warmup time.</p>\n<p>Why I have to analyze this is beyond me. I don’t know why it would be so difficult to expand the event_names API with onFail and onSuccess statements and warmup times.</p>\n<p>I want to collect data for a certain time, so that I can analyze the typical runtime of a event, the logical structure of a meta and maybe how long it takes to succeed (or fail) with a event at different times (like night, morning, evening, weekend or working days).</p>\n<p>So long.</p>","arenanet":false},{"pubDate":"2013-05-31T15:34:08.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/ID-s-for-meta-event-chains/2128042","author":"Charismatic Harm.9683","body":"\n<p>I don’t know what kind of metadata that Cliff and the team at Anet has, but I think the issue of event linking could be solved with the addition of 2 parameters to the “event_names” API.</p>\n<p>If you added….<br>\n“event_success” : event_id<br>\n“event_fail” : event_id</p>\n<p>…..those two items could allow developers to do a complete event chain link and if multiple events are required to have a “Success” state in order to complete them, they would each have the same event_id in their “event_success” parameter.</p>\n<p>Like I said….I don’t know if it’s possible, but it’s something to look at.</p>","arenanet":false},{"pubDate":"2013-05-31T14:56:38.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/ID-s-for-meta-event-chains/2127841","author":"Acuba.4312","body":"\n<p>I don’t know how the mechanics of events or event chains work internally. Maybe the kickoff of a event is not directly connected to a former event, thus negating the chance of seeing that. But maybe the event can show its own starting conditions (dialog, event(x-y-z, failure/success), timer, …).</p>\n<p>If it’s not possible, I agree with you rodadams, that the community has to reconstruct the metas. ATM I’m writing a cronjob that automatically collects the state of every event in the five Temple Metas (thanks to the wiki in different languages) each minute of my home server. With this data I hope to reconstruct the conditions in these metas (while Balthazar’s seems the most complicated with three pre meta events :-S ) .</p>","arenanet":false},{"pubDate":"2013-05-31T07:21:37.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/ID-s-for-meta-event-chains/2126164","author":"rodadams.5963","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 31 2013 01:32AM\"><a href=\"/forum/community/api/ID-s-for-meta-event-chains/2124893\">Acuba.4312:</a></cite></div><div class=\"quotey\"><p>If it is not possible to deliver these information with the API, maybe it is possible that you programmers or designers can simply post how each meta evolves (with all possibilities). It’s not ideal, but at least you could push the API to a standard of correctness that you and us wish. <br>\nWhile it’s fun to explore an investigate ingame, it’s not to try to reconstruct data that is already known (by you). So please ArenaNet, pimp your API.</p></div></blockquote>\n<p>I could maybe see tagging events as part of a world event, since this is known to the player in game, being that it appears under the gold bar in the quest display.<br>\nHowever, any sense of which events are otherwise connected to each other are not readily displayed in game, and thus are not fair game for APIs.<br>\nIt would also spoil the effect of the designers coming in and adding new branches. What fun is it if the branches are automatically mapped out for you?</p>\n<p>I suggest that if the community feels strongly enough about this, that they get together and track what information they can gleam together and put json or other relevant data files in github or the like.</p>","arenanet":false},{"pubDate":"2013-05-31T01:32:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/ID-s-for-meta-event-chains/2124893","author":"Acuba.4312","body":"\n<p>Just to bring this back up. <br>\nI find it quite inconvenient that there is no connection of the text snippets of a meta event to the events which are running. There must be some connections or callbacks.</p>\n<p>The wiki is not complete (assuming correctness in every info is also vague) and the data from the API does not deliver a single hint about how the events are connected. Even if it’s not possible to deliver data about meta events, there must be handlers that initiate other events on failure or success. If you could expand the Event API to show these events, we could easily rebuild the metas. <br>\nI assume that at the moment dozens of us are rebuilding event chains and metas with the help of the wiki without the certainty of being correct.</p>\n<p>If it is not possible to deliver these information with the API, maybe it is possible that you programmers or designers can simply post how each meta evolves (with all possibilities). It’s not ideal, but at least you could push the API to a standard of correctness that you and us wish. <br>\nWhile it’s fun to explore an investigate ingame, it’s not to try to reconstruct data that is already known (by you). So please ArenaNet, pimp your API.</p>","arenanet":false},{"pubDate":"2013-05-21T02:27:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/ID-s-for-meta-event-chains/2064976","author":"Uttar.2341","body":"\n<p>The Wiki (mostly) has the necessary data (and it can be fixed where it isn’t accurate).</p>\n<p>I’m working on an ambitious project based on the Events API that should include meta-event information among many other things. Stay tuned!<img src=\"/include/images/smilies/wink.png\"></p>","arenanet":false},{"pubDate":"2013-05-21T02:13:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/ID-s-for-meta-event-chains/2064932","author":"Cliff Spradlin.3512","body":"\n<p>I agree it would be nice, but unfortunately we don’t have the right kind of metadata on events to support this.</p>","arenanet":true},{"pubDate":"2013-05-20T23:58:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/ID-s-for-meta-event-chains/2064378","author":"Crise.9401","body":"\n<p>…. would be extremely nice convenience addition… to fetch a collection of even information about every event in said meta event.</p>\n<p>Although, it might not be worth it if it isn’t trivial to include such information… since it is reasonable to keep track of things manually too.</p>","arenanet":false}]}