{"title":"Ideas for GW2","pubDate":"2017-02-03T22:56:59.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Ideas-for-GW2","comments":[{"pubDate":"2017-02-04T23:34:54.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Ideas-for-GW2/6483522","author":"JaxomNC.5381","body":"\n<p>First this is a dev forum about the web API (and maybe other things such as the Mumble stuff), not for game suggestions.</p>\n<p>Second: NO!</p>\n<p>For months and months we had the wecked Lion’s Arch used in personal story when those instances we supposed to take place months if not years before Scarlet’s rampage. We rightfully (and loudly) complained that this was odd, confusing and weird to have NPC do stuff in a fully destroyed place. I do not remember if we got the new LA in story at some point but it does not matter, they fixed it and we finally can come back in old LA during story AS IT SHOULD BE.</p>\n<p>On a side note: I hope at some point they fixed the Pact coming together in a vine-invaded Fort Concordia when this, too, was supposed to take place years before Mordremoth’s awakening.</p>","arenanet":false},{"pubDate":"2017-02-04T05:30:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Ideas-for-GW2/6482987","author":"Celiea.3461","body":"\n<p>I forgot to add when I was doing the old storyline when I was leveling up a new character I have seen half of the story is still using the old Lions Arch model I was disappointed that it was still using the old model So I would suggest changing that so the new model will be used for the story or any chance that the Development team will change that.</p>","arenanet":false},{"pubDate":"2017-02-03T22:56:59.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Ideas-for-GW2/6482694","author":"Celiea.3461","body":"\n<p>Hello Dev team been playing GW2 for a while havn’t done any endgame yet since I haven’t fully leveled to 80.</p>\n<p>Anyways heres some ideas I have in mind for the offhand focus So far I have seen a focus could be anything for a caster but the problem is its something that the character is holding and so far making to were it looks blan when a caster wields it. I propose an alternative to make the caster more fun to play why not give the focus something that is animated and looking like the item is enchanted.</p>\n<p>Example: a floating opened book either following a character of with the characters hand up and the book floats on top of the hand. or an orb that would be floating around with different auras emanating from it like fire coming out of the orb for a Elementalist is using fire or spouting water, rocks, etc, for other professions mesmers could have some illusions coming out of the orb or butterfly’s flying around the character, etc etc, for necromancers like a dark green aura coming from the orb or even an animated skull, or like the book have the characters hand up with the orb on top of the character’s hand.</p>\n<p>So a lot of things ya can use for the focus offhand than just an item that a character has to hold on to.</p>\n<p>Now so far if arena plans to make another profession for the next upcoming expansion which I am sure they will since how popular the game is right now. I would recommend a Wizard/Witch with some Cool spells that other proffessions aren’t using and with a combo of telepathy no a wizard doesn’t really have to read minds but move objects, using waves etc that wizards we have seen in films or books. A good example is Gandalf using all sorts of invisible magic in Lord of the Rings.</p>\n<p>Arena may not use this idea for their next profession but its something I like to post.</p>\n<p>Either way hope the new content will make the game even more enjoyable to play.</p>","arenanet":false}]}