{"title":"Image permissions / requesting?","pubDate":"2016-03-31T08:17:45.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Image-permissions-requesting","comments":[{"pubDate":"2016-07-04T19:23:46.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Image-permissions-requesting/6231868","author":"Aidan Savage.2078","body":"\n<p>For #1 and #3, the Content ToU (there’s a link to it if you navigate to the GW2 asset kit page under the Media navbar up top) provides sufficient “written permission” so long as you follow the parameters set forth within the ToU:</p>\n<blockquote><div class=\"quotey\"><p>Guild Wars 2 Content Terms of Use<br>\nWe reserve the right, at our sole discretion, to change, modify, add, or remove portions of these Content Terms of Use, at any time. It is your responsibility to check these Content Terms of Use periodically for changes. Your continued use of Guild Wars or Guild Wars 2 content, APIs, or materials following the posting of changes will mean that you accept and agree to the changes.<br>\n<strong>I’m interested in using Guild Wars or Guild Wars 2 art on a website, application, in a project, or on a Guild Wars, Guild Wars 2 or ArenaNet fansite. What is your policy regarding copyrights and trademarks? May I use ArenaNet, Guild Wars 2 and/or Guild Wars content, such as images, text, sounds, or video?</strong><br>\nYes, you may use our content-that is images, text, video and audio files-within the following parameters:<br>\nThe content must be used in a non-commercial context for private, personal use only (i.e. not for use by a company)<br>\nYou must include all copyright and other notices associated with the content<br>\nYou acknowledge and agree that no title nor any other form of ownership to the content has been or will be transferred to you from ArenaNet nor from anyone else<br>\nYou agree that you will not alter, disassemble, decompile, reverse-engineer or in any other way modify the content<br>\nYou agree that you will not present the content as officially sanctioned or professionally associated with ArenaNet<br>\nYou agree that ArenaNet has the right to require removal of our content at any time, for any reason</p></div></blockquote>\n<p>Bolding is from the page, just had to add formatting. Anyways, basically, as long as you arent selling the application (a donation button is a verrrrrrry hazy gray area that Gaile Gray would likely know, or can get the answer to quickly), provide proper attribution to the source, and not imply it’s anything “official,” Anet generally wont care. Lawton’s probably the same, until you try to make a program that sends billions of requests for every iota of information available from the api server about Grumble Cakes.</p>\n<hr>\n<p>Yes, I’m aware this is an old thread, but the information added bears mentioning, as it’s still a valid concern for others than the OP.</p>\n<p>edit: apparently three consecutive *’s are considered a “page break” and it gives a full width dividing line. Huh. Neat.</p>","arenanet":false},{"pubDate":"2016-03-31T20:14:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Image-permissions-requesting/6074783","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on March 31 2016 08:17AM\"><a href=\"/forum/community/api/Image-permissions-requesting/6073622\">Bobbyjoemoma.5784:</a></cite></div><div class=\"quotey\"><p>4.  If this isn’t possible, is there a way to request images to be added to the v2/files/ endpoint other than listing them sparsely through forum/github posts?</p></div></blockquote>\n<p>Having separate github issues for each bundle of file requests is the easiest way for me to keep track of things. I’ll toss all your requests onto <a href=\"https://github.com/arenanet/api-cdi/issues/220\">this issue</a> since I haven’t started rooting around for the last batch yet.</p>","arenanet":true},{"pubDate":"2016-03-31T08:17:45.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Image-permissions-requesting/6073622","author":"Bobbyjoemoma.5784","body":"\n<p>So, multi-part…</p>\n<p>1.   maybe asked before, but I have noticed many applications using some anet images/icons that are found on the official wiki. I was trying to look into using some as well, but I thought that the Terms said that they cannot be… Does this TOS just mean they cant be used maliciously or something?</p>\n<p>2.  Specifically, the API lacks a few images that are useful (like PvP rank images, race icons, crafting icons[other than the small map icons], mastery point icon [earned and not], and many others that I am sure I will remember after posted this). These images are readily available on the wiki and are used by other applications, but I wanted to be sure before releasing my own application</p>\n<p>3.  Obviously written permission would bypass this, but if that really a thing? I highly doubt these applications have gotten such permissions (maybe I am wrong…)</p>\n<p>4.  If this isn’t possible, is there a way to request images to be added to the v2/files/ endpoint other than listing them sparsely through forum/github posts?</p>\n<p>Thanks for the info in advance !<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false}]}