{"title":"Introducing GW2co.net...","pubDate":"2014-08-17T16:34:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Introducing-GW2co-net","comments":[{"pubDate":"2014-10-13T21:08:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Introducing-GW2co-net/4484496","author":"Gil.9346","body":"\n<p>Update</p>\n<p>We are now in public beta with my homeworl Elonareach for more than 2 month and many errors have been fixed, improvements were implemented and new features came along. A big “Thank You All” at this point!</p>\n<p>Because of the good feedback and flawless running client and server we decided to go public in November! Servers TS Admins or Guild leaders can contact us now (see <a href=\"http://about.gw2co.net\">http://about.gw2co.net</a>) to apply for a channel. We will still ramp up slowly and requests will be handling in order of income.</p>\n<p>What else has changed?<br>\n- Users can now choose where to install at setup<br>\n- New flat design layout with 4 map view (see all at once) and continent layout when maximized (for 2nd screen) with some extras<br>\n- Spawn Port Authentification makes it quite impossible to spy on the positions of your enimies even when password is compromised<br>\n- Upgraded to 5 scouts per team, new colors/icons and improved Win7 onTop Handling</p>\n<p>2 month of progress leaves trails. But we still have a long list of wishes and cool features to come. Stay tuned and explore!</p>\n<p>Greetings,<br>\nGil/Comes Mors</p>","arenanet":false},{"pubDate":"2014-08-22T21:57:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Introducing-GW2co-net/4322063","author":"Filovirus.6258","body":"\n<p>Thanx a lot for the answer.</p>\n<p>I’ll keep testing it a bit and keep you informed. Will be posting about it on my guild forums too soon, so others can test too.</p>","arenanet":false},{"pubDate":"2014-08-22T19:05:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Introducing-GW2co-net/4321319","author":"Gil.9346","body":"\n<p>The few things:<br>\n- the setup gets language from operating system, the client also, but in settings you can change language between german and english</p>\n<p>- you can choose installation path by clicking options at the installer. the path is not prefilled though, for which a ticket is already open</p>\n<p>- arranging all maps in a full row, 2by2 or as continent view do make maps too small to have all the maps/items visible when sized minimum. we wanted to provide a way to show as many maps possible but not beeing too big as an overlay. when you observe multiple maps you still do not want to sacrify too much space onscreen. we found a three maps view to be a good balance between items/map visibility and minimal client size. we already have a ticket open for a continent view</p>\n<p>- that’s a good idea. we never thought of it that way. this focusmode just evolved over time, espacially as i like the client left to my minimap with the map i currently raiding in wvw</p>\n<p>- the public demo channel shares all positions from all that try it at the same time. together with the random match it is not usable for playing, but you can still test all options, including voting, leaders, map switching, focusmode and everything else because you share positions. it is to test the client and as we are still in beta, channels are limited</p>\n<p>- contacting me for a channel is not complicated, you did it<img src=\"/include/images/smilies/smile.png\"> more feedback options will come in the future. as long we are in beta, channels can only be created by us</p>\n<p>i’ll look up gw2wvw.org about what can be displayed additionally. thanks for this tip and the feedback. as you see some of your notes are already addressed<img src=\"/include/images/smilies/smile.png\"></p>\n<p>Greetings,<br>\nGil/Comes Mors</p>","arenanet":false},{"pubDate":"2014-08-21T21:54:54.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Introducing-GW2co-net/4318242","author":"Filovirus.6258","body":"\n<p>Nice idea.</p>\n<p>Now a few things :<br>\n- put a choice of languages with at least english (and a translation, even if it’s using a web automatic translator) for the installation process, licence and such, German (i guess it’s German) makes it quite hard for people not speaking it specially in case of error.</p>\n<p>- allow people to choose where they install it. I have a dedicated partition for software installation, and every software forcing itself to install in C:\\whatever is a problem due to the low size of the C: partition on my comp (no need for a big one when softs aren’t there), triffling with regedit and the registry to put it where it belong is a pain.<img src=\"/include/images/smilies/colondee.png\"></p>\n<p>- why only 3 maps shown in the Carroussel mode ? Specially when you have the room for 4 if you rearrange them otherwise.</p>\n<p>- why can’t we have the “reduced” view with no background and reduced ui in Carroussel mode and only in zoom/focused mode ? It would be really nice to have the ability to show all maps in a compact way while playing (for those like me who are the ones keeping track of what happens on all maps).</p>\n<p>-  why not allow people to choose what (public) channel they want to see in the overlay in Demo mode instead of putting a random one ? A random one don’t really allow testing, don’t allow to check accuracy and things like that, while the fact it’s Demo PUBLIC mode and stated pretty much everywhere makes it so that there won’t really be a problem for that (specially when you know there is maps on website for everything but positioning, and no one would expect that to be hidden in a public channel) ?</p>\n<p>- Is there plans for an easy way/interface on the website (or tool) to create private channels ?<br>\nIt’s kind of complicated for now.</p>\n<p>Would be nice too, to have somewhere the info about ticks from all 3 servers on the MU, their number of points, and the difference between a server and the leading one (ie : most of what’s displayed at the bottom of the gw2www.org maps).</p>\n<p>It’s pretty much all for now.<br>\nThanx for the good work btw, was hoping for that sort of tool having pretty much everyone for quite some time.<img src=\"/include/images/smilies/colondee.png\"></p>","arenanet":false},{"pubDate":"2014-08-17T16:34:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Introducing-GW2co-net/4302465","author":"Gil.9346","body":"\n<p>Hi everyone!</p>\n<p>I’d like to introduce <a href=\"http://gw2co.net\">http://gw2co.net</a></p>\n<p>GW2co.net – GuildWars2 Commander Overlay is an overlay addon for GuildWars2 for cooperative teamplay that allows players in World vs. World mode to see movements of teams. Get active! Choose your team, vote your leader, be a scout… Discover more!</p>\n<p>Today marks a special milestone from closed to public beta release. The first server to get a channel will be my homeworld Elonareach. If you are interested in a Beta Channel or you have a big guild which is active in WvW, just contact us and see our Website for feedback options.</p>\n<p>I also want to use the moment for some big thanks to all products that made GW2co.net happen! Special thanks to:</p>\n<p>Arenanet for the Public API<br>\n    Heimdall, Smiley and God Of Fissures to support the development<br>\n    zeeZ for the gw2 emblemer appspot server<br>\n    Drakma gw2stats.net for the initial capture times</p>\n<p>Have fun and greetings, <br>\nGil/Comes Mors</p>","arenanet":false}]}