{"title":"Is screen monitoring against the ToS or EULA?","pubDate":"2014-12-11T14:43:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-screen-monitoring-against-the-ToS-or-EULA","comments":[{"pubDate":"2015-01-12T20:10:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-screen-monitoring-against-the-ToS-or-EULA/4687710","author":"Strategist.6132","body":"\n<p>I think it’s not against the ToS or EULA when it doesn’t give you advantages over other players not using your program.</p>\n<p>For example ask yourself the following questions:</p>\n<p>- Does your program only provide information?<br>\nI guess this should be okay. For example, the Overwolf plugin is even encouraged to be used. So I don’t think it’s a problem if you show Trading Post statistics or data about skins and colors.</p>\n<p>- Does your program automatically performs some kind of behaviour?<br>\nI think this isn’t allowed when it performs significant actions that would be harder to do manually. For example automatically buying/selling at the trading post. Or moving your character to kill/spam skills.</p>\n<p>Conclusion:<br>\nI think only an overlay is probably fine as long as it doesn’t give you a significant benefit over other players not using your program.</p>\n<p>PS. Can you tell us a bit more about your program? I think it’s easier to provide a better answer then.</p>","arenanet":false},{"pubDate":"2014-12-11T14:43:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-screen-monitoring-against-the-ToS-or-EULA/4618761","author":"Charismatic Harm.9683","body":"\n<p>I am working on an application for personal use, that I may want to distribute publicly at some point.  There are certain areas of the screen I would like to monitor for keys/triggers/icons/text/etc.</p>\n<p>The application would be an overlay and would require Guild Wars 2 to be run in Windowed Full Screen mode.</p>\n<p>The application would not read memory locations on my PC, nor would it hack into, modify, or in any other way interact with the physical gw2.exe file or any files provided with the installation of Guild Wars 2.</p>\n<p>The application WILL use ArenaNet provided API’s to acquire data via given and approved methods.</p>\n<p>I know this is a VERY vague description of what the app is, but since it’s still in early development and I’m unsure if it will be distributed publicly, I want to know whether or not I would be in violation of the ToS and/or EULA so that if I do decide distribute the application publicly, I will not be angering the GW2 gods.  :-)</p>\n<p>P.S.:  The only answer I will mark as an answer to this question would be an official response from an ANet representative.</p>","arenanet":false}]}