{"title":"Is the API really this limited?","pubDate":"2013-06-05T10:41:48.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-the-API-really-this-limited","comments":[{"pubDate":"2013-06-07T08:20:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-the-API-really-this-limited/2170568","author":"Samuraiken.9581","body":"\n<p>Thanks for clarifying!  That’s what I get for “assuming” ;-)</p>","arenanet":false},{"pubDate":"2013-06-05T23:08:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-the-API-really-this-limited/2162282","author":"Gilgamesh.2561","body":"\n<p>This is an HTTP API for making web applications.</p>\n<p>ArenaNet could create a lot less confusion if they put “WEB API” or “HTTP API” in the title of this forum and, really, all locations that the word “API” is listed.</p>","arenanet":false},{"pubDate":"2013-06-05T11:31:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-the-API-really-this-limited/2158719","author":"Healix.5819","body":"\n<p>The API is not for creating standard UI addons, it’s for making apps. An app for example would use items.json to create something like an item database, at which point you could then search for the item you wanted. Using items.json, this is done by grabbing all the items, then looking up their details to create a database. Adding in recipe information, you could create a crafting “addon” to help players level crafting the most efficient/cheapest way.</p>\n<p>Allowing player’s to create addons for the UI, like usual MMOs, is not something ArenaNet has plans for. Addons can make a big difference when you’re aiming to be an e-sport after all. Furthermore, since they never added addon support to GW1, chances are they’ll stick to their no addons stance. If the majority wants it though (as in constant spam of requests by thousands of different players), they’ll probably cave.</p>\n<p>Right now, the API is in its early phase. In the future, there will be more options, so doing something like retrieving what items you have equipped along with your character’s information may be possible.</p>\n<p>For any core UI modifications (multiple chat windows), you’ll need to make a suggestion.</p>","arenanet":false},{"pubDate":"2013-06-05T11:28:33.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-the-API-really-this-limited/2158712","author":"Snowcub.3206","body":"\n<p>I think you got the wrong impression here.<br>\nThis isnt an API like the LUA interfaces in WoW or LotRo.<br>\nYou arent supposed to make addons to the game itself.<br>\nThe GW2 Api is supposed to make ingame information avaiable from the outside, through websites or applications.<br>\nAlso the info is extra restricted right now, because they are still working on implementing authentification, so they can only give general info out.<br>\nGive it time, they only released the APIs about 2 weeks ago<img src=\"/include/images/smilies/smile.png\"></p>\n<p>edit: ninjaed<img src=\"/include/images/smilies/colondee.png\"> what ruhr said<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2013-06-05T11:27:54.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-the-API-really-this-limited/2158710","author":"Ruhrpottpatriot.7293","body":"\n<p>Api is still beta and in development, so you can expect to get more features as time goes on. However there won’t be any function in the api that is also in the game.</p>\n<p>What you can do with the current API?<br>\nWell more accurate and tamper proof dragon-timers, you could also get an Item by it’s name and then query the recipes api to get all recipes which use that particular item.</p>\n<p>There are already many possibilities, they just require the developers to work a bit.</p>","arenanet":false},{"pubDate":"2013-06-05T10:41:49.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Is-the-API-really-this-limited/2158548","author":"Samuraiken.9581","body":"\n<p>Obviously reading the API documentation is the way to go to get started with utilizing the API for GW2, but so far it doesn’t make much sense and seems extremely limiting.</p>\n<p>For example, looking at <a href=\"https://api.guildwars2.com/v1/items.json\">https://api.guildwars2.com/v1/items.json</a>, how is this called from within a program written in C# (as an example)?  It returns a list of item IDs, but what can we do with that?  Is it returned like as an object, with properties that we can access (item.Name, item.Type, item.minDPS, item.maxDPS, etc)?</p>\n<p>What if we want to search for a specific item?  According to this list of API documentation (<a href=\"https://forum-en.guildwars2.com/forum/community/api/API-Documentation/first#post2028044\">https://forum-en.guildwars2.com/forum/community/api/API-Documentation/first#post2028044</a>), there isn’t anything for gathering item IDs that a player may have equipped (say, if for some reason I wanted to retrieve my currently equipped weapon).</p>\n<p>There doesn’t seem anything in place to do something like parse the chat log, either.  I just re-joined the game after being gone since December, and it looks as if ArenaNet STILL has not added the option to have multiple chat windows up.  Yes, we can make new tabs, but for people who want to look at the combat log AND the chat log, our only option is to constantly pop back and forth between tabs, OR unfilter combat from the chat log (making it all a huge mess).</p>\n<p>I was rather hoping that at some point, we’d be able to create a small window in game, that read the contents of the combat log and redirected that information to the new window, thus working around the “boxed in” constraint that the game comes with (on top of the fact that, at high resolutions, the chat box is way too small and needs to have an option to resize it).</p>\n<p>In fact, it looks like there isn’t ANY documentation at all to support the idea that we’re allowed to “play around” with the interface, beyond WvW, guilds, and items/recipes.</p>\n<p>Perhaps I thought that there would be more available.  Other than tracking stats in WvWvW, beta Guild info, and listing all items and recipes (probably on a web site), what is there that’s available for someone who truly wants to make an addon for the game?</p>\n<p>Am I looking at this with expectations beyond what the intended  purpose of this feature is (the GW2 API)?</p>\n<p>Cheers!</p>","arenanet":false}]}