{"title":"Item API buff data","pubDate":"2013-08-30T10:22:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Item-API-buff-data","comments":[{"pubDate":"2013-08-31T20:46:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Item-API-buff-data/2742083","author":"Era.2930","body":"\n<p>thanks both for the reply, i guessed as much (the skill link being historic etc) just wondered if anyone know what or how to parse.  I am indeed just putting it in my db and ignoring at present, and just taking the following part which is generally the attributes.</p>\n<p>sad there is no skill api yet though, will see with time</p>\n<p>thanks for your replies though guys, appreciated</p>","arenanet":false},{"pubDate":"2013-08-30T13:00:27.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Item-API-buff-data/2733002","author":"poke.3712","body":"\n<p>Generally, as the name `skill_id` suggests, the ID there refers to a skill. A skill can be both a skill a player can use but also skills that are used by NPCs or possibly environmental objects.</p>\n<p>Unfortunately there is no API for skill data yet, and we also don’t really have a good list of skill ids. The chat link for that “skill” is <code>[&amp;B4A9AAA=]</code> and shows a nameless skill with just the buffs as the description. So it might be just a way for the game to construct the total attributes. You’re probably best of if you just try to interpret the information and sum the attribute values up. That’s what’s happening in the game after all too.</p>","arenanet":false},{"pubDate":"2013-08-30T12:50:12.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Item-API-buff-data/2732956","author":"Dr Ishmael.9685","body":"\n<p>The buff is indeed a “skill” that gives an additional effect to your character when the item is equipped (remember that “effects” and skills are all the same thing to the game engine).  The original need for this seems to have been Magic Find, presumably because it wasn’t set up as an “attribute” so they couldn’t stick it in the <em>attributes</em> array with power/precision/etc.</p>\n<p>I can’t really say why they reused this system for the “inherent upgrade component” on ascended items, though.</p>\n<p>You can parse it out into <em>attribute</em> and <em>modifier</em> values and merge them with the existing <em>attributes</em> list.</p>","arenanet":false},{"pubDate":"2013-08-30T10:22:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Item-API-buff-data/2732425","author":"Era.2930","body":"\n<p>Hi guys</p>\n<p>first time posting in the API section.  I have been working on some code involving retrieving item data for some time.  I notice that with some items (mostly ascended items) there is an additional array labelled “buff” in the infix_upgrade section of the JSON which is returned.</p>\n<p>A good example of this is item 39276.  Part of this is additional stats which makes sense, but there is another part labelled “skill_id” which is a number.</p>\n<p>Does anyone know what the stat is or if it can be translated to something meaningful? Couldn’t seem to find anything on here or the wiki.</p>\n<p>- Era</p>","arenanet":false}]}