{"title":"Keys still go invalid after patches?","pubDate":"2017-03-10T03:37:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Keys-still-go-invalid-after-patches","comments":[{"pubDate":"2017-03-14T17:59:10.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Keys-still-go-invalid-after-patches/6527565","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on March 11 2017 09:23PM\"><a href=\"/forum/community/api/Keys-still-go-invalid-after-patches/6524904\">Chaba.5410:</a></cite></div><div class=\"quotey\"><p>Edit: Your inbox is full (figures).  What’s the best way to send you the key?</p></div></blockquote>\n<p>orz, cleared out my inbox. You can PM me, or email to lawton@arena.net.</p>","arenanet":true},{"pubDate":"2017-03-11T21:23:24.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Keys-still-go-invalid-after-patches/6524904","author":"Chaba.5410","body":"\n<p>The error occurred when querying character data.</p>\n<p>“2017-03-10 00:35:31.429012 #~ GW2 Handler: [CharacterGet] Unable to load character data for Jeremy.6724. Bad API key or API key is not set to allow “character” queries.\"</p>\n<p>I don’t know what the actual response was from the API, but will try to find out.  Sending you what Jeremy says is the key he used in PM.  He didn’t make any key changes on the account site.</p>\n<p>Edit: Your inbox is full (figures).  What’s the best way to send you the key?</p>","arenanet":false},{"pubDate":"2017-03-10T18:23:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Keys-still-go-invalid-after-patches/6523888","author":"Lawton Campbell.8517","body":"\n<p>The patch last night shouldn’t have had any effect on the API stuff (but then again, distributed systems happy fun times).</p>\n<p>Do you happen to have the actual error string? Is it “invalid key” or “ErrBadData” or something else? There’s an <a href=\"http://i.imgur.com/26JTxor.png\">unexpected blip</a> around that time which would have generated ErrBadData — but that wouldn’t make keys go invalid permanently?</p>\n<p>I’ll spend some time rooting around to see if I can some idea about what could have caused this  :&lt;</p>\n<p>EDIT: Do you happen to still have the broken API keys? On Jeremy’s account I’m seeing what may be two broken keys? But want to verify that I’m looking at. They probably won’t be in the account site anymore — you’ll have to get them from whomever runs the TS verification bot.</p>\n<p>EDIT2: This story is becoming more and more terrifying.</p>","arenanet":true},{"pubDate":"2017-03-10T03:37:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Keys-still-go-invalid-after-patches/6523258","author":"Chaba.5410","body":"\n<p>Was there something odd about tonight’s patch that affected the API?</p>\n<p>After patch we had a bunch of Teamspeak users start to lose their access and the verification bot was shut off to stop it.</p>\n<p>From a Teamspeak log.  Time is in EST.  Tonight’s patch was about 10 minute earlier.</p>\n<p>&lt;19:35:28&gt; “G———-” was removed from server group “AutoVerified” by “HELPDESK”.<br>\n&lt;19:35:32&gt; “I———” was removed from server group “AutoVerified” by “HELPDESK”.<br>\n&lt;19:36:02&gt; “S———-” was removed from server group “AutoVerified” by “HELPDESK”.</p>\n<p>Here is the account name of one of the affected users: Jeremy.6724.  Would have been around 19:35:31 for this user.</p>\n<p>About a year and a half ago there was a problem with a bunch of keys suddenly going permanently “invalid” according to the API and this was tracked down to a patch.  Since that time I’ve seen users on a forum I run still experience the issue with the API returning “invalid” and, when contacted, the user says they didn’t delete their key.   I usually have them provide a new key.  After tonight though I wonder if there’s still some issue with patches that cause keys to go bad.</p>","arenanet":false}]}