{"title":"Let's talk about permissions","pubDate":"2015-08-06T23:57:02.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions","comments":[{"pubDate":"2015-12-20T07:07:36.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5868964","author":"bxt.7691","body":"\n<p>Hi,</p>\n<p>Apologise for the resurrection but this seems like the most recent relevant post.</p>\n<p>So I’ve been playing with the API and some of the more useful things for me, such as the members list, seem to be hidden behind a ‘guild leader only’ thing. How is that defined? Is that simply just the highest rank?</p>\n<p>My guild rank is ‘Guild Leader’ and has all the permissions but it is the second highest rank. The guild’s founder, who comes online perhaps every 6 months or so to check all is well, retains the highest rank. This isn’t a problem and seems to works really well for a large guild and I generally see it much like the Queen in the UK… for the most part is ceremonial but does have the power to resolve things if one day is needed. Useful for context but I digress.</p>\n<p>Anyway, is there some way to make it so it is dependant on a permission, maybe ideally a new one or if that isn’t possible something such as Edit Ranks or similar as for now I’m blocked from using useful APIs.</p>\n<p>Edit: Nevermind, just seen all the discussions at <a href=\"https://github.com/arenanet/api-cdi/pull/7\">https://github.com/arenanet/api-cdi/pull/7</a> so please ignore this. Have left it up in case anyone else has the same question.</p>","arenanet":false},{"pubDate":"2015-11-23T15:21:51.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5789739","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on November 19 2015 03:40PM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5776814\">Leablo.2651:</a></cite></div><div class=\"quotey\"><p>As far as the API is concerned, the big items here are the account and character names, which can be used to harass or track the player in-game or here on the forums, and all of which are exposed with very basic permissions. The account name isn’t really useful for the API itself but is exposed in virtually every key. Equally puzzling is that (mutable) character names are returned as the unique ID rather than a permanent and anonymous handle.</p></div></blockquote>\n<p>So, for the account names — you can already see the account name of everyone you see in-game. You just have to add ‘em to your block list and the block list will show you their account name in the mouseover. It’s how you whisper enemies in WvW and other shenanigans — I’m not sure why it’s like that, but given how easily you can reveal account names I didn’t see much reason to obscure them in the API.</p>\n<p>The character IDs are intentionally not provided for security reasons, and there’s nothing else in the character data that’s both immutable and uniquely identifies a character. It’s possible in the future (read: pretty far out) that we’ll fix this by providing an HMAC of the character ID or something, but it’s not really on the backlog. You can uniquely identify the characters within an account via the creation date (which I agree is backwards, but we’ve got worse warts).</p>\n<p>Anyway, RE: the permissions discussion; I agree that the end-user UX is sub-optimal but I don’t forsee it changing, sorry <img src=\"/include/images/smilies/sad.png\"></p>","arenanet":true},{"pubDate":"2015-11-22T08:38:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5786103","author":"DarkMagister.7429","body":"\n<p>hm, strange decision on their side, especially if all the “speciliality” is ?a=1,b=0,c=1,d=0<br>\nYet it gives us some insight into what they don’t want to do to help developers outside of pure API providing, and the answer to that questions is “anything”. So I’d forget about any “uploading a manifest” and “register our Apps with ANet” ((</p>","arenanet":false},{"pubDate":"2015-11-22T05:49:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5785895","author":"Pilot.6094","body":"\n<p>I agree DarkMaster however if you read the previous posts in the Dev forums ANet management made a decision that special links into their site will not be supported. For this reason a manifest is the only way to request any given set of permissions while addressing their concern. Very easy to implement, they just don’t seem to care.</p>","arenanet":false},{"pubDate":"2015-11-19T21:26:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5778010","author":"DarkMagister.7429","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 07 2015 01:31AM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5354626\">Pilot.6094:</a></cite></div><div class=\"quotey\"><p>1) We register our Apps with ANet and upload an XML manifest specifying the required permissions.</p>\n<p>We need a way to specify required permissions to allow as many end users to complete the process as possible.</p></div></blockquote>\n<p>That’s a nice goal with an awful implementation idea. I think that is done in a far more simple way:<br>\n1. User comes to your site. User is urged to create an API ;-key with the given link<br>\n2. The link lists needed permission (as headers, post, etc., doe not matter)<br>\n3. The link leads to the My Account page here, to the page with already set permissions, following the given list. <br>\n4. The user creates the API with the proposed permissions and goes back to your site.</p>\n<p>And it does not involve anet ding something but initial coding, which is vital if you want to see it in this life.</p>\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 07 2015 03:58AM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5354840\">Anonanon.5412:</a></cite></div><div class=\"quotey\"><p>I was just thinking the other day that more MMOs need to have a phone app that lets you chat with friends and guild mates</p></div></blockquote>\n<p>That exists and is called Team Speak.</p>","arenanet":false},{"pubDate":"2015-11-19T15:40:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5776814","author":"Leablo.2651","body":"\n<p>If it’s not too late to add some input: The way the permission system currently works feels more like we are managing read permissions on database tables, which might make sense to us as developers but not for the privacy and security of users. I don’t think that segmentation of data based on in-game topics of interest makes a useful analogy for real-world escalations of trust.</p>\n<p>The biggest issue with regard to privacy is personally identifying information. As far as the API is concerned, the big items here are the account and character names, which can be used to harass or track the player in-game or here on the forums, and all of which are exposed with very basic permissions. The account name isn’t really useful for the API itself but is exposed in virtually every key. Equally puzzling is that (mutable) character names are returned as the unique ID rather than a permanent and anonymous handle.</p>\n<p>As for security, the API is thus far read-only and does not itself present any attack vector so it seems almost irrelevant whether they can view minutiae about the user’s data once they’ve already been given a key with basic permissions and with it, the biggest hints for employing some other attack vector, e.g. social engineering, if that’s what they were after.</p>\n<p>As it currently stands I think you only need 2 permission sets: one for identifying information (i.e. account and character names, assuming the UID issue is addressed) and one for non-identifying information (everything else). I don’t really see any other significant gaps in trust or risk between a user and a third party they want to give a key to, though the bigger issue remains that there currently isn’t a meaningful separation in this regard.</p>\n<p>If the app further exposes individual information to the public, and the user has some specific qualms about that, it should also be the app’s responsibility to provide finer privacy controls to the user, and that provision is something the user should take into consideration when deciding how much they want to trust the app.</p>","arenanet":false},{"pubDate":"2015-08-25T15:45:15.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5414038","author":"MatHack.4316","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 25 2015 01:32AM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5412506\">Archomeda.6472:</a></cite></div><div class=\"quotey\"><p>True. But as it currently stands, <strong>progression</strong> does not only have account-bound stuff. The specialization unlock, world completion, story and selected order are all character-bound.</p>\n<p>But you have to keep in mind that having all of this categorized under one permission does not necessarily mean it will also be listed under one API endpoint. I think it’s perfectly reasonable to have it all under one <strong>progression</strong> permission.</p></div></blockquote>\n<p>Whoops, you’re totally right, I was thinking about endpoints instead of permissions… WAKE UP stupid brain!<br>\nBut yeah, it should be perfectly fine to put account and character progression under 1 permission, as long as it will be multiple endpoints.</p>","arenanet":false},{"pubDate":"2015-08-25T13:27:09.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5413712","author":"Cire Lionheart.5318","body":"\n<p>Hello! I have been getting into working with this API and it has been a blast so far. Wish I would have built up my tools 2 years ago lol! Anyway, I was wondering if there were endpoints for PvE map completion. I would like to create a tool that lists out each zone with all its spots and create a checklist for each character and what they have unlocked.</p>\n<p>I am also really looking forward to the guild endpoints so I can create tools to help me better manage my guild.</p>","arenanet":false},{"pubDate":"2015-08-25T01:32:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5412506","author":"Archomeda.6472","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 24 2015 08:24PM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5411743\">MatHack.4316:</a></cite></div><div class=\"quotey\"><p>Correct me if I’m wrong but stuff like recipe unlocks &amp; crafting disciplines are char bound, not account bound, right? I’m not sure it would make sense to list these under (account) unlocks and progression. I also think these should at least have the name of the associated character included somewhere.</p></div></blockquote>\n<p>True. But as it currently stands, <strong>progression</strong> does not only have account-bound stuff. The specialization unlock, world completion, story and selected order are all character-bound.</p>\n<p>But you have to keep in mind that having all of this categorized under one permission does not necessarily mean it will also be listed under one API endpoint. I think it’s perfectly reasonable to have it all under one <strong>progression</strong> permission.</p>","arenanet":false},{"pubDate":"2015-08-24T20:24:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5411743","author":"MatHack.4316","body":"\n<p>Correct me if I’m wrong but stuff like recipe unlocks &amp; crafting disciplines are char bound, not account bound, right? I’m not sure it would make sense to list these under (account) unlocks and progression. I also think these should at least have the name of the associated character included somewhere.</p>","arenanet":false},{"pubDate":"2015-08-24T19:47:44.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5411631","author":"rodadams.5963","body":"\n<p>I think I’m okay with having a larger number of permissions which someone can use to fine tune what they want to give out…. but there would need to be some easy to use packages or presets which would be good for most people, covering the most common cases. Thus,  site could tell people \"get a key with the Trader’s preset (or perms X, Y, Z, W, K, &amp; R)</p>","arenanet":false},{"pubDate":"2015-08-24T02:59:14.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5409681","author":"Archomeda.6472","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 23 2015 08:22PM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5408959\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p>Until we get a checkbox in the guild permission system only guild leaders will be able to use the authenticated /v2/guild endpoints.</p>\n<p><em>snip</em></p>\n<p>In any case, the chat stuff will take a significant effort to implement; as such we’ve got plenty of time to discuss the finer points of it. I think it would be best to start a new thread specifically for the implications of the chat endpoint.</p></div></blockquote>\n<p>Fair enough. I have a different opinion about it, but that’s a discussion for another time. I got a bit carried away, sorry about that.</p>\n<p>Looking over at</p>\n<blockquote><div class=\"quotey\"><p><strong>unlocks/wardrobe/fashion</strong> (name TBD)<br>\n<em>“Your wardrobe unlocks and currently equipped skins.”</em></p>\n<ul>\n\t<li>skin/dye/mail carrier/finisher/mini/etc unlocks</li>\n\t<li>maybe currently equipped skins?</li>\n\t<li>maybe recipe unlocks?</li>\n</ul>\n<p><strong>progression</strong> (name TBD)<br>\n<em>“Your account-bound unlocks, timers, and progress.”</em></p>\n<ul>\n\t<li>specialiation unlock progress</li>\n\t<li>mastery progress</li>\n\t<li>account achievements</li>\n\t<li>world completion progression</li>\n\t<li>daily dungeon/fractal reset progress</li>\n\t<li>story progress, selected order, etc</li>\n</ul></div></blockquote>\n<p><strong>unlocks/wardrobe/fashion</strong></p>\n<ul>\n\t<li>Seeing another post about moving <em>currently equipped skins</em> to <strong>character</strong>, I think that would be the best too. It is essentially a skinned item. By the way, don’t we already have access to a character’s equipment and to the current skin of an item? I think you mentioned the duplication as well.</li>\n\t<li>I think it’s best to have this dedicated to <strong>unlocks</strong> only. This means the <em>ones already listed</em> (except <em>equipped skins</em>) + <em>unlocked skins on your account</em> (which is essentially the wardrobe). It would also remove the ambiguity about this permission I think.</li>\n</ul>\n<p><strong>progression</strong></p>\n<ul>\n\t<li>I would say that the name is fine. Progression means both your account and character progression.</li>\n\t<li>I’m not really sure about this one, but the <em>crafting disciplines</em> are missing. Naturally I would say <strong>progression</strong>. But since <strong>unlocks</strong> holds the <em>recipe unlocks</em>, it can be under <strong>unlocks</strong> too. Especially since there’s also the <em>crafting discovery</em> in the game, which is again <strong>progression</strong>, but also a bit of an <strong>unlock</strong>.<br>\nI think that <em>recipe unlocks</em>, <em>crafting disciplines</em> and <em>crafting discoveries</em> should be together in a permission, as they are tightly related to each other. Maybe get all three under <strong>progression</strong> and keep <strong>unlocks</strong> for account-wide unlocks only?</li>\n</ul>","arenanet":false},{"pubDate":"2015-08-23T22:20:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5409207","author":"das Keks.5403","body":"\n<p>A nice thing for the <strong>inventories</strong> API would be a flag for each item’s binding.</p>\n<p>So you could calculate how much gold you could get if you’d sell all your items. Of course that doesn’t work with account bound or soul bound items so you’d need some flag to see if its already bound the the account.</p>","arenanet":false},{"pubDate":"2015-08-23T20:22:26.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5408959","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 23 2015 05:48AM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5407470\">Devilsown.9376:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on August 06 2015 11:57PM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5354500\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p><strong>guilds</strong><br>\n<em>“Guilds’ rosters, history, and MOTDs for all guilds you are a member of.”</em></p></div></blockquote>\n<p>That’s a little problematical, because it affects also other players. Every Guild Member has to trust every other Member that he/she don’t share his/her token with dubious webpages or archive every writen word to a DB, even he/she is offline.<br>\nThis should need something like a allow/disallow from a guildleader and the status should be displayed under /v2/guild/id or (much better) somewhere ingame.</p></div></blockquote>\n<p>That was a typo on my part. The description for the guilds permission actually reads “guilds you a a leader of”.</p>\n<p>Until we get a checkbox in the guild permission system only guild leaders will be able to use the authenticated /v2/guild endpoints.</p>\n<p>(EDIT: My previous response RE: chat permissions was not constructive enough; apologies)</p>\n<p>For the chat endpoint, I’m somewhat opposed to restricting its access behind a guild permission because it seems to be a technical solution to a social issue. I’d originally imagined the chat to be self-policing: if someone was abusing it (where “abuse” is defined by the guild), the guild can just kick them. Having an explicit whitelist seems a bit silly to me — the current state is that guild chat is an implicit grant. It makes much more sense for the /v2/guild endpoints whose functionality is not diminished by having only one person be able to access them.</p>\n<p>In any case, the chat stuff will take a significant effort to implement; as such we’ve got plenty of time to discuss the finer points of it. I think it would be best to start a new thread specifically for the implications of the chat endpoint.</p>","arenanet":true},{"pubDate":"2015-08-23T17:07:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5408498","author":"Archomeda.6472","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 23 2015 05:48AM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5407470\">Devilsown.9376:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on August 06 2015 11:57PM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5354500\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p><strong>guilds</strong><br>\n<em>“Guilds’ rosters, history, and MOTDs for all guilds you are a member of.”</em></p>\n<ul>\n\t<li>roster</li>\n\t<li>ranks</li>\n\t<li>event log</li>\n\t<li>upgrades</li>\n\t<li>motd</li>\n</ul>\n<p><strong>chat</strong><br>\n<em>“Read and write access to your guilds’ chat.”</em></p>\n<ul>\n\t<li>read/write access to guild chat</li>\n</ul></div></blockquote>\n<p>That’s a little problematical, because it affects also other players. Every Guild Member has to trust every other Member that he/she don’t share his/her token with dubious webpages or archive every writen word to a DB, even he/she is offline.<br>\nThis should need something like a allow/disallow from a guildleader and the status should be displayed under /v2/guild/id or (much better) somewhere ingame.</p></div></blockquote>\n<p>I agree. Although I’m pretty sure the devs are aware of this, it can’t hurt to reiterate it. Having access to the guild chat sounds really nice and it’s something that most people want (myself included). But it should be limited by new guild permissions. Maybe even separating the read and write access. If your account does not have sufficient permissions set by the guild leader, you’re out of luck.</p>\n<p>On a similar note, even though this is not correct place to ask, but if this will be (eventually) added, I would like to be able to create more than 10 ranks. If the API permission gets added, I can imagine that leaders want to have more different ranks to allow/disallow certain people, even though the rank itself might be similar.<br>\nAlso, “Admin Lower Ranks” should really be revisited (separate the ability to invite, promote/demote and kick for example). I really hope that the people who are responsible for the guild system are aware of this.</p>","arenanet":false},{"pubDate":"2015-08-23T05:48:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5407470","author":"Devilsown.9376","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 06 2015 11:57PM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5354500\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p><strong>guilds</strong><br>\n<em>“Guilds’ rosters, history, and MOTDs for all guilds you are a member of.”</em></p>\n<ul>\n\t<li>roster</li>\n\t<li>ranks</li>\n\t<li>event log</li>\n\t<li>upgrades</li>\n\t<li>motd</li>\n</ul>\n<p><strong>chat</strong><br>\n<em>“Read and write access to your guilds’ chat.”</em></p>\n<ul>\n\t<li>read/write access to guild chat</li>\n</ul></div></blockquote>\n<p>That’s a little problematical, because it affects also other players. Every Guild Member has to trust every other Member that he/she don’t share his/her token with dubious webpages or archive every writen word to a DB, even he/she is offline.<br>\nThis should need something like a allow/disallow from a guildleader and the status should be displayed under /v2/guild/id or (much better) somewhere ingame.</p>","arenanet":false},{"pubDate":"2015-08-07T17:35:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5356307","author":"MatHack.4316","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 07 2015 05:05PM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5356239\">Lawton Campbell.8517:</a></cite></div><div class=\"quotey\"><p>Hmm, the only bits I know of are your current WvW rank and chosen WvW masteries. I don’t know what our future plans are, but in the recent desert borderlands playtest I didn’t see anything new we’d expose via authenticated API, at least. If the current implementation stands (click a map icon to view upgrades) there’s a good case to be made for providing access current objective upgrades.</p>\n<p>I’ve been looking for a place to put the WvW rank though, and since we’ve already got permissions for PvE (progression) and PvP (pvp), it would be symmetrical to have one for WvW too. I dunno.</p></div></blockquote>\n<p>Just to clarify: I meant theoretical far future, not the coming stuff from HoT. I was speculating/theorizing there might be more account/character bound wvw stuff in the (far) future. This also ties in with what you are saying about splitting the playmodes into different permissions. Better to split it now, in case we might need it later.</p>","arenanet":false},{"pubDate":"2015-08-07T17:05:31.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5356239","author":"Lawton Campbell.8517","body":"\n<p>RE: Fixed permission sets.</p>\n<p>Previously I’ve felt that, with only four permissions, it probably wasn’t needed. Looking at this list though, I’m starting to change my opinion and agree that we do need some way to make this a bit more straightforward.</p>\n<p>Providing a standard request permissions like is strictly out (and I realize that most everyone already links to the API key page — which redirects through login), so I think the best we can do is either to provide a way to copy-paste permissions presets from a site, or to provide a way for sites to register presets somehow.</p>\n<p>Anyway, I don’t want to get too far off-topic; so let’s <em>table</em> this for now.</p>\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 07 2015 03:58AM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5354840\">Anonanon.5412:</a></cite></div><div class=\"quotey\"><p>So to add to your guild chat read/write capabilities, please extend that to the entirety of our contact lists. This includes choosing which /g chat to join (basically changing which guild to rep straight from the phone), being able to chat with guild mates, whispering users, whispering friends, contact adding, contact renaming, contact blocking, block list management.</p></div></blockquote>\n<p>That’s actually not a bad idea — now that I think about it, we can actually do read/write contact management stuff from the API. I kind of hesitate to put that under the “chat” permission (maybe “contacts” instead?).</p>\n<p>I’m definitely not going to allow whispering arbitrary users via API though. Gold sellers in HotM are already annoying. The best I can do is the ability to whisper people who have added you as a friend, and even that’s not a certainty (needs internal discussion). Personally, I think that would provide a reasonable balance.</p>\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 07 2015 05:35AM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5354967\">MatHack.4316:</a></cite></div><div class=\"quotey\"><p>I think the current equipped skins should be listed under <ins>characters</ins>, the current visual representation of a character would be something that is basic to a character.</p></div></blockquote>\n<p>Hmm, that seems pretty reasonable. It fixes the ambiguity problem wherein both “inventories” and “fashion/unlocks/skins” provided access to the same data.</p>\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 07 2015 05:35AM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5354967\">MatHack.4316:</a></cite></div><div class=\"quotey\"><p>WvW ranks would be under here as well, I guess? Or does this merit a new permission <ins>wvw</ins>? Would it make more sense if we split it up in advance in case there would every be more wvw related stuff bound to your account/characters?</p></div></blockquote>\n<p>Hmm, the only bits I know of are your current WvW rank and chosen WvW masteries. I don’t know what our future plans are, but in the recent desert borderlands playtest I didn’t see anything new we’d expose via authenticated API, at least. If the current implementation stands (click a map icon to view upgrades) there’s a good case to be made for providing access current objective upgrades.</p>\n<p>I’ve been looking for a place to put the WvW rank though, and since we’ve already got permissions for PvE (progression) and PvP (pvp), it would be symmetrical to have one for WvW too. I dunno.</p>","arenanet":true},{"pubDate":"2015-08-07T15:39:29.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5356037","author":"Pilot.6094","body":"\n<p>Passing in a bit mask would be preferred but ANet seems to have ruled that out as they don’t want us direct linked to the GW2 account site. I’m open to anything that will help end users and adoption.</p>","arenanet":false},{"pubDate":"2015-08-07T14:39:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5355925","author":"Nicsword.3956","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 07 2015 05:35AM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5354967\">MatHack.4316:</a></cite></div><div class=\"quotey\"><p><strong>progression</strong> (name TBD)</p>\n<ul>\n\t<li><ins>progression</ins> sounds like a good descriptive name, I think it’s a solid choice.</li>\n\t<li>WvW ranks would be under here as well, I guess? Or does this merit a new permission <ins>wvw</ins>? Would it make more sense if we split it up in advance in case there would every be more wvw related stuff bound to your account/characters?</li>\n</ul></div></blockquote>\n<p>I like the idea of the WvW ranks.  Have statistics that tell you how many of your guild mates mastered a particular trait.</p>","arenanet":false},{"pubDate":"2015-08-07T06:05:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5355019","author":"zeeZ.5713","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 07 2015 01:31AM\"><a href=\"/forum/community/api/Let-s-talk-about-permissions/5354626\">Pilot.6094:</a></cite></div><div class=\"quotey\"><p>We need a way to specify required permissions to allow as many end users to complete the process as possible.</p></div></blockquote>\n<p>That’s gonna be one hell of a dropdown menu :P Alternatively you could provide a way to generate some kind of string (like an encoded bitmask or json) that contains the permissions you’re asking for that the user can copy and paste to the key generation page to auto-select them.</p>","arenanet":false},{"pubDate":"2015-08-07T05:35:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5354967","author":"MatHack.4316","body":"\n<p>The list looks very solid and inclusive, here are the few comments I have:</p>\n<p><strong>unlocks/wardrobe/fashion</strong> (name TBD)</p>\n<ul>\n\t<li>I would suggest <ins>skins</ins> as the name, all the things listed are basicly skins for a certain item (armor skins, mini skins, mail carrier skin). Dyes are so tightly related to armor skins that I believe most users would assume this to be included with this permission, and should not warrant changing the name to refect dyes are also included in this permission.</li>\n\t<li>I think the current equipped skins should be listed under <ins>characters</ins>, the current visual representation of a character would be something that is basic to a character. It’s pretty much the first thing people see in-game when they look at a character.</li>\n\t<li>Recipe unlocks are kinda weird in this endpoint, the rest is all about visual ‘effects’, I think <ins>inventories</ins> would be a more logical endpoint. The main purpose for recipe unlocks I see at the moment would be checking what the user can do/craft with his/her accumulated materials. You would need the <ins>inventories</ins> permission for that anyway, so I would put recipe unlocks under there as well.</li>\n</ul>\n<p><strong>progression</strong> (name TBD)</p>\n<ul>\n\t<li><ins>progression</ins> sounds like a good descriptive name, I think it’s a solid choice.</li>\n\t<li>WvW ranks would be under here as well, I guess? Or does this merit a new permission <ins>wvw</ins>? Would it make more sense if we split it up in advance in case there would every be more wvw related stuff bound to your account/characters?</li>\n</ul>","arenanet":false},{"pubDate":"2015-08-07T03:58:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5354840","author":"Anonanon.5412","body":"\n<p>I was just thinking the other day that more MMOs need to have a phone app that lets you chat with friends and guild mates, on top of having basic “armory” functionality.</p>\n<p>So to add to your guild chat read/write capabilities, please extend that to the entirety of our contact lists. This includes choosing which /g chat to join (basically changing which guild to rep straight from the phone), being able to chat with guild mates, whispering users, whispering friends, contact adding, contact renaming, contact blocking, block list management.</p>\n<p>I think this is quite important to the game, it could prove to be very useful if something comes up in real life and you need to let your guild know ASAP that you’re going to be late for the guild mission reset<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2015-08-07T01:31:02.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5354626","author":"Pilot.6094","body":"\n<p>One thing I strongly urge you consider before expanding permissions is a means for 3rd party apps to specify a required set of privileges. As it is, our site has to display lengthy instructions for end users about how to create a key with the appropriate permissions. It is a challenge from the start because our end users don’t even know what API stands for. If privileges expand (as they tend to do), it is going to greatly hinder our growth without a system in place to manage it.</p>\n<p>We should be able to set the required permissions for our Apps to help users through the process. There are countless systems that do this today. I know an OAuth type model is out, due to ANet management preferences so how about a manifest model like Google Play, iTunes, Windows App Store, Overwolf etc. etc?</p>\n<p>1) We register our Apps with ANet and upload an XML manifest specifying the required permissions. <br>\n2) The ANet account key page would have a dropdown that allows the end user to choose the App from a list for which they want to generate a key.<br>\n3) ANet processes the manifest and checks the requested permission boxes, making them all read only. (Better yet let the manifest specify Required or Optional permissions)<br>\n4) The user can choose to accept or decline. The key is generated the key  if they accept, which they can copy it as usual.</p>\n<p>This would be a very simple fix, for a major adoption hindrance. The added benefit of this is that ANet can build up a list set of registered 3rd party Apps and track adoption.</p>\n<p>We need a way to specify required permissions to allow as many end users to complete the process as possible.</p>","arenanet":false},{"pubDate":"2015-08-06T23:57:04.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Let-s-talk-about-permissions/5354500","author":"Lawton Campbell.8517","body":"\n<p>Currently the API keys have only a few permissions — account, characters, inventories and tradingpost. The intent behind permissions is to allow users to withhold portions of their account data when interacting with third-party applications. The individual endpoints are grouped functionally into coarse-grain permissions to prevent information overload.</p>\n<p>We’ve got plans for quite a few more authenticated endpoints, and I wanted to get some opinions on some new scopes. The following are my rough notes for the API end-game (e.g., all permissions and authenticated endpoints we’ll ever have).</p>\n<p>I’m mostly looking for any kind of suggestions/feedback regarding which new endpoints require which scopes, and anything I’ve forgotten or left out. There’s a couple of oddities (recipe unlocks) which could fit into a handful of categories (inventories makes sense for e.g., legendary tracker, but semantically unlocks/progression makes more sense). And I’m not really yet happy with some of the new permission names.</p>\n<p>Anyway, the notes so far —</p>\n<p><strong>account</strong><br>\n<em>“Your account display name, ID, home world, and list of guilds. Required permission.”</em></p>\n<ul>\n\t<li>required</li>\n</ul>\n<p><strong>characters</strong><br>\n<em>“Basic information about your characters.”</em></p>\n<ul>\n\t<li>list characters</li>\n\t<li>view basic character info</li>\n</ul>\n<p><strong>inventories</strong><br>\n<em>“Your account bank, material storage, and character inventories.”</em></p>\n<ul>\n\t<li>account bank, material storage</li>\n\t<li>character inventories</li>\n\t<li>maybe recipe unlocks?</li>\n</ul>\n<p><strong>tradingpost</strong><br>\n<em>“Your Trading Post transactions.”</em></p>\n<ul>\n\t<li>transaction history</li>\n\t<li>current transactions</li>\n\t<li>gold/items available for pickup</li>\n</ul>\n<p><strong>unlocks/wardrobe/fashion</strong> (name TBD)<br>\n<em>“Your wardrobe unlocks and currently equipped skins.”</em></p>\n<ul>\n\t<li>skin/dye/mail carrier/finisher/mini/etc unlocks</li>\n\t<li>maybe currently equipped skins?</li>\n\t<li>maybe recipe unlocks?</li>\n</ul>\n<p><strong>mail</strong><br>\n<em>“Received in-game mail.”</em></p>\n<ul>\n\t<li>in-game mail</li>\n</ul>\n<p><strong>progression</strong> (name TBD)<br>\n<em>“Your account-bound unlocks, timers, and progress.”</em></p>\n<ul>\n\t<li>specialiation unlock progress</li>\n\t<li>mastery progress</li>\n\t<li>account achievements</li>\n\t<li>world completion progression</li>\n\t<li>daily dungeon/fractal reset progress</li>\n\t<li>story progress, selected order, etc</li>\n</ul>\n<p><strong>pvp</strong><br>\n<em>“Your PvP stats, match history, reward track progression, and custom arena details.”</em></p>\n<ul>\n\t<li>match history</li>\n\t<li>custom arena state</li>\n\t<li>reward track progression</li>\n</ul>\n<p><strong>guilds</strong><br>\n<em>“Guilds’ rosters, history, and MOTDs for all guilds you are a leader of.”</em></p>\n<ul>\n\t<li>roster</li>\n\t<li>ranks</li>\n\t<li>event log</li>\n\t<li>upgrades</li>\n\t<li>motd</li>\n</ul>\n<p><strong>builds</strong><br>\n<em>“Your currently equipped specializations, traits, skills and equipment for all game modes.”</em></p>\n<ul>\n\t<li>equipped specializations/traits</li>\n\t<li>equipped skills</li>\n\t<li>current equipment</li>\n</ul>\n<p><strong>wallet</strong><br>\n<em>“Your account’s wallet.”</em></p>\n<ul>\n\t<li>…wallet</li>\n</ul>\n<p>EDIT: scrap chat for now; that’s months away still.</p>\n<p><strong>contacts</strong><br>\n<em>“Read and write access to your contacts list.”</em></p>\n<ul>\n\t<li>read access to friends/blocks, maybe also write access.</li>\n</ul>\n<p><strong>wvw</strong><br>\n<em>“Your WvW level and mastery point assignments.</em></p>\n<ul>\n\t<li>puts wvw_level into the /v2/account response.</li>\n\t<li>grants access to /v2/characters/:id/wvw_masteries (or something along those lines).</li>\n</ul>","arenanet":true}]}