{"title":"Listings API returns account bound item id","pubDate":"2016-05-16T23:58:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Listings-API-returns-account-bound-item-id","comments":[{"pubDate":"2016-05-17T17:48:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Listings-API-returns-account-bound-item-id/6158766","author":"Lawton Campbell.8517","body":"\n<p>Thanks for that list, that’s super helpful. There’s a longstanding bug in one of the backend servers that causes it to erroneously return items it shouldn’t — in the meanwhile I’ve added those ids to the blacklist so they will stop appearing in the list.</p>","arenanet":true},{"pubDate":"2016-05-17T07:44:22.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Listings-API-returns-account-bound-item-id/6157679","author":"KirnDar.5498","body":"\n<p>Thanks for the fast reply.<br>\nHowever, a quick cross reference with the ids in commerce/listings with item ids that are flagged either “AccountBound” or “SoulbindOnAcquire” still yields some ids that shouldn’t be in listings. Here are my results:</p>\n<p>29236\tModniir Ward<br>\n30572\tExperimental Skritt Musket<br>\n8587\tDrottot’s Poached Egg<br>\n23358\tHunter’s Amulet</p>\n<p>As i said, I’ll be filtering AccountBound or SoulBound item ids from my requests so it’s not a big deal to me. Still I thought maybe you’d like to know…</p>","arenanet":false},{"pubDate":"2016-05-17T01:19:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Listings-API-returns-account-bound-item-id/6157289","author":"Lawton Campbell.8517","body":"\n<p>Yeppers, we just updated the trading post backend which fixed a longstanding bug that the API had been unwittingly abusing. I’m pushing out a fix that makes the API do the right thing. Here’s <a href=\"https://github.com/arenanet/api-cdi/issues/197\">a tracking issue</a>.</p>\n<p>EDIT: Deployed the API fix which <strong>should</strong> have corrected the issue. 19717 no longer shows up in the listings.</p>","arenanet":true},{"pubDate":"2016-05-16T23:58:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Listings-API-returns-account-bound-item-id/6157175","author":"KirnDar.5498","body":"\n<p>Hi,<br>\nCorrect me if I’m wrong but shouldn’t commerce/listing endpoint (<a href=\"https://api.guildwars2.com/v2/commerce/listings\">https://api.guildwars2.com/v2/commerce/listings</a> ) return only the item ids that are on the trading post? I have a basic app that reads the listings; it first reads all the listed item ids from commerce/listings, then batch-reads the details by fetching the commerce/listings?ids=&lt;comma_seperated_ids&gt;. However the ids list from commerce/listing endpoint contains the id “19717”, which is Sun Bead; an account bound item that shouldn’t be on TP at all. So when i try to fetch commerce/listings?ids=&lt;comma_seperated_ids&gt; with 19717 as one of the ids, i got a http 400 error as no tp details for Sun Beads exists. <br>\nEventually i’ll probably end up filtering account bound item ids from my batch-reads but shouldn’t those item ids be excluded from listings endpoints entirely? It’s the first time i’m having this problem so i thought maybe there’s some problem with the API that needs fixing.</p>","arenanet":false}]}