{"title":"Live information from client(e.g. health)?","pubDate":"2016-12-01T23:50:02.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Live-information-from-client-e-g-health","comments":[{"pubDate":"2016-12-05T18:03:26.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Live-information-from-client-e-g-health/6421037","author":"Lawton Campbell.8517","body":"\n<p>You can write a standalone program which reads the data without Mumble running. It’s just a shared memory page that you can map into your application.</p>","arenanet":true},{"pubDate":"2016-12-04T14:45:04.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Live-information-from-client-e-g-health/6419938","author":"RocketRacer.5491","body":"\n<p>Thank you for your answer! MumbleLink appears to have the ability to read the profession of the user, so that’s already something I wanted to implement. Is it built-in the Mumble client or is it possible to download it separately? Because while I do want the feature to read the character class I don’t want Mumble to be involved at all.</p>","arenanet":false},{"pubDate":"2016-12-02T00:32:48.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Live-information-from-client-e-g-health/6418008","author":"Lawton Campbell.8517","body":"\n<p>The HTTP API can’t get any live information — everything served from api.guildwars2.com is up to 5-minutes out-of-date. There is a <a href=\"https://wiki.guildwars2.com/wiki/Mumble\">mumble link API</a> available which provides some very basic information. Not planning on adding any additional fields to the mumble link API, so what’s there is all we’ll likely ever expose. That’s about as close as we can get with regards to official support, I’m afraid <img src=\"/include/images/smilies/sad.png\"></p>","arenanet":true},{"pubDate":"2016-12-01T23:50:02.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Live-information-from-client-e-g-health/6417978","author":"RocketRacer.5491","body":"\n<p>Hi, is it possible for the API to read live information from the client – profession of the character you are playing right now or health values? If that is possible it would work really with Corsair Utility Engine to make RGB lightning react to what is happening in the game or to see what my currently selected profession is and skillset chosen to make lights react to that. It appears that the API provided serves a completely different purpose, but I hope there is a workaround for this. Thank you.</p>","arenanet":false}]}