{"title":"Mobile &quot;armory&quot;","pubDate":"2015-01-23T15:32:55.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mobile-armory","comments":[{"pubDate":"2015-01-29T19:21:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mobile-armory/4746073","author":"Sariel V.7024","body":"\n<p>I can see why you want the API involved. The information you want is available, in pieces, across many sites and none of them (not even the wiki) has all of it. It’s difficult to put all of it together and still make it presentable. Worse still is keeping it updated, as some sources for items get removed from the game periodically, and others are added with almost every update.</p>","arenanet":false},{"pubDate":"2015-01-23T21:45:09.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mobile-armory/4719972","author":"StevenL.3761","body":"\n<p>Try Dulfy Database</p>\n<p><a href=\"http://db.dulfy.net/search/\">http://db.dulfy.net/search/</a></p>\n<p>It has some very well thought-out filter options. You can use it to find equipment with certain stat combinations. As an example, here’s a list of all lv 80 heavy boots of exotic rarity with Berserker’s stats: <a href=\"http://db.dulfy.net/search/0/80-80/armor-boots/exotic/0/power,precision,critdamage,heavy/0/0/\">http://db.dulfy.net/search/0/80-80/armor-boots/exotic/0/power,precision,critdamage,heavy/0/0/</a></p>","arenanet":false},{"pubDate":"2015-01-23T19:37:47.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mobile-armory/4719706","author":"Dr Ishmael.9685","body":"\n<p>The only way to “upgrade” a piece of equipment is to find one with a higher required level or a higher rarity.  That’s it.  All stats are directly related to those two properties.  (Except for leveling items, which have a lower required level than stat level, but the best stat level available on them is 74.)</p>","arenanet":false},{"pubDate":"2015-01-23T15:32:55.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mobile-armory/4719007","author":"Aenielida.4398","body":"\n<p>Ok.. so maybe this has been beaten to death several times since release.. but I’ve not seen mention of it.. so I just wanted to throw this out there in case perhaps.. it hadn’t…</p>\n<p>I think it would be great to have a mobile app that could allow you to see the armor sets, weapons, etc.. in the game.. with their stats.. and where they are available from (crafted, drops, what boss, etc)..</p>\n<p>I do NOT neccessarily feel that we need to have direct access to our toons from the app.. but at least be able to pull or look up their gear.. and then see WHAT upgrades can be had and from where.. I just hit my first level 80.. and it’s mess of trying to figure out what gear to get.. from where.. and when..</p>\n<p>I just thought an app like an “armory” would be helpful in that regard. The wiki is great.. and has all the info.. but I don’t think you can use it to find “upgrades” for particular slotted items.  if something DOES exist (web or app).. please share. =)</p>\n<p>Thanks<br>\nSee ya in Tyria!</p>","arenanet":false}]}