{"title":"More guild options?","pubDate":"2015-06-22T22:55:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/More-guild-options","comments":[{"pubDate":"2015-06-26T21:08:45.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/More-guild-options/5216881","author":"Apolo.5942","body":"\n<p>It would also help to have apis that help with guild Governance, like mail info, transaction history towards the guild vault (think taxes and deposits).</p>","arenanet":false},{"pubDate":"2015-06-22T23:11:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/More-guild-options/5190521","author":"Devata.6589","body":"\n<p>Not completely sure how you would then prevent anybody using the Api to see all information from any guild.</p>\n<p>Anyway, it’s great to know you guys are working on this functionality.</p>","arenanet":false},{"pubDate":"2015-06-22T23:03:14.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/More-guild-options/5190470","author":"Lawton Campbell.8517","body":"\n<p>Yep, I’m working against <a href=\"https://github.com/arenanet/api-cdi/pull/7\">this proposal</a>, mostly. I need to sit down and post the differences between my WIP implementation and his original proposal, but those endpoints are coming eventually.</p>\n<p>With respect to privacy, the conclusion was that the best solution is to have an in-game rank permission that grants API access. Since that’s going to take some time to implement, the initial release will be restricted to allow access only to guild leaders.</p>","arenanet":true},{"pubDate":"2015-06-22T22:55:41.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/More-guild-options/5190419","author":"Devata.6589","body":"\n<p>With all the new guild-stuff coming up are we maybe also going to see more options with the Api for guilds. Like seeing the roster or the MotD? There are obviously some privacy issues but I guess you could make a address white-list in-game to solve that issue.</p>\n<p>Same question in general, we we getting more options for guilds.</p>","arenanet":false}]}