{"title":"Mumble Data - how far are we allowed to go","pubDate":"2013-07-22T10:39:32.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mumble-Data-how-far-are-we-allowed-to-go","comments":[{"pubDate":"2013-07-23T03:03:44.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mumble-Data-how-far-are-we-allowed-to-go/2465339","author":"Bear on the job.6273","body":"\n<p>From what I understand this is allowed. At least I hope it is, as I’m pretty far along with a project of my own doings something similar. From the link shared above, I think Cliff is ok with most apps we come up with, as long as you don’t have bad intentions.</p>\n<p>I’m actually working on a mod that sounds very similar, specifically for WvW. The client application reports your position to a server, and plots it on a web-based map. The server allows you to place waypoints on the map with instructions (defend, attack, repair, etc), and players using the client application will be notified of the waypoint. When they are far away from the waypoint, it will appear as a directional marker at the top of their screen, but once they get close to it, the marker will be projected onto the player’s screen where it would exist in the game world (based on location and camera vectors…once the camera z-axis vector is fixed).</p>\n<p>I think the only things that would get you in trouble is if you performed some automated process, like macros and bots normally do (obviously not part of your plans), or if you revealed information about other players you shouldn’t. Like if you made a WvW app that tracked players, and reported them to opposing teams as well as your own.</p>","arenanet":false},{"pubDate":"2013-07-22T11:29:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mumble-Data-how-far-are-we-allowed-to-go/2460415","author":"smiley.1438","body":"\n<p>See: <a href=\"https://forum-en.guildwars2.com/forum/community/api/Another-live-WvW-Map-Checking-legality/first#post2388512\">https://forum-en.guildwars2.com/forum/community/api/Another-live-WvW-Map-Checking-legality/first#post2388512</a></p>","arenanet":false},{"pubDate":"2013-07-22T10:39:43.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Mumble-Data-how-far-are-we-allowed-to-go/2460205","author":"Firilion.3867","body":"\n<p>Hello fellow Developers</p>\n<p>currently i’m working a bit with those mumble position data. This is quite fun and a very powerful thing too.<br>\nI think that some use cases may extend the game in a way which arenanet did not want to see.</p>\n<p>So my question is, how far are we allowed to go? Since the policy is in rework and a lot of the solutions posted in this forum collide with the old policy but are allowed to use…where is the limit?</p>\n<p>Please take a look at this short video (excuse the bad quality and the german language).</p>\n<div class=\"youtube\"><div class=\"youtube_title\"><a href=\"http://www.youtube.com/watch?v=UjpVyvrRZPI\">http://www.youtube.com/watch?v=UjpVyvrRZPI</a></div><div class=\"youtube_video\"><object width=\"320\" height=\"240\"><param name=\"movie\" value=\"http://www.youtube.com/v/UjpVyvrRZPI&amp;hl=en&amp;fs=1&amp;\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"http://www.youtube.com/v/UjpVyvrRZPI&amp;hl=en&amp;fs=1&amp;\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"320\" height=\"240\"></object></div></div>\n<p>This is a quick example i wrote using mumble data for 3 things:<br>\n(Overlay Window using gw2 in FullScreen – Window Mode)</p>\n<p>1) calculate the range i have run to place my portal. The bar on the bottom shows in red how far i have run and the units spend (Portal – Reichweite means portal range) as well as the time till my portal will decay. After placing it, it shows the time till the portal will close. It is quite exact as you can see in the second example where the character is only a few units to far. It also takes into account that a player can jumpd down or run up in the z-axis</p>\n<p>2) It shows Mapobjects (here for example waypoints) within the camera-view. It shows their name, the distance (lower left corner) and the estimated time of travel in seconds (lower right corner). This could be used for anythin like events, capture objects in wvw or even player-locations within the map.<br>\n(this prototype does not use exact positioning for those information windows, e.g. does not move them into the right place on the screen, but this is just a small tweak to get it work. And when the camera delivers the z-axis, it would be even simplier to juggle them around)</p>\n<p>3) Not shown in the video, but also integrated is a function which allows players to put own objects to a map, like mining nodes or cool places or an enemy raid in wvw and so on. Therefore you use a 2D Map where you put those objects on. This is communicated to all other players who are using the tool and these objects appear within the Overlaywindow as well.</p>\n<p>I think, you can imagine what’s possible with something like that…</p>\n<p>How far are we allowed to go?<br>\nIs this allowed and should i continue development?<br>\nOr is this forbidden so that i stop development immediatly</p>\n<p>Greetings<br>\nFirilion</p>\n<p>please excuse my bad english, but i hope it was understandable</p>","arenanet":false}]}