{"title":"[MumleLink] Security questions","pubDate":"2013-09-16T22:13:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/MumleLink-Security-questions","comments":[{"pubDate":"2013-09-22T16:30:36.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/MumleLink-Security-questions/2892952","author":"Terrasque.8735","body":"\n<ol>\n\t<li>Register user</li>\n\t<li>Give user unique key</li>\n\t<li>Let user input that in the position program</li>\n\t<li>Players with admin right to relevant group(s) can add him via username</li>\n</ol>","arenanet":false},{"pubDate":"2013-09-21T12:47:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/MumleLink-Security-questions/2887088","author":"Gil.9346","body":"\n<p>Thank you for your answer. Heimdall has contacted me by PM also (I wrote back yesterday)</p>\n<p>The purpose of my overlay is exactly to view multiple groups/all groups on a map. Thus I just want the player to select a color and he/she is done. “Shared Keys” are a good solution for closed groups but not for my purpose I think.</p>\n<p>So the secret key is in my case the not so secret worldId + mapId. If I can have those two by the mumble always correct (no worldId in WvW/on Overflow) and I can asure it cannot be faked (my second point about the fingerprint) there would be no need to even interact with the overlay at all.</p>\n<p>Can I please ask a developer to look into those issues. As long as the worldId is not set everywhere or I can get the Home WorldId and as long as there is no way to verify the MumbleLink Data is actually really from GW2 I cannot release my overlay.</p>\n<p>Thank you and Greetings,<br>\nGil/Comes Mors</p>","arenanet":false},{"pubDate":"2013-09-16T22:47:58.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/MumleLink-Security-questions/2850866","author":"smiley.1438","body":"\n<p>Regarding security: If you use the concept of a “shared key”, “stealing” data is pretty impossible – this was also one of my concerns. Regarding maths’n’stuff, have a look at mine and Heimdall’s repos over here (<a href=\"https://forum-en.guildwars2.com/forum/community/api/Gw2-Location-Tracker/2379754\">or this thread too</a>):</p>\n<p><a href=\"https://gw2apicpp.codeplex.com/\">https://gw2apicpp.codeplex.com/</a> (C++ Mumble link part)</p>\n<p><a href=\"https://gw2apicpp.codeplex.com/SourceControl/latest#GW2API_Upload/Gw2Maps/Position.cpp\">https://gw2apicpp.codeplex.com/SourceControl/latest#GW2API_Upload/Gw2Maps/Position.cpp</a><br>\n</p><pre><code>\t//Avatar View\n\tsprintf_s(num, NUM_SIZE, \"%s%d,\", J_AVATAR_FRONT, mod((atan2(image.fAvatarFront[2], image.fAvatarFront[0])*180/PI), 360));\n</code></pre><p></p>\n<p><a href=\"https://github.com/codemasher/gw2api-tools/blob/master/examples/gw2location-receiver.php\">https://github.com/codemasher/gw2api-tools/blob/master/examples/gw2location-receiver.php</a> (receiver for the Mumble link data)<br>\n<a href=\"https://github.com/codemasher/gw2api-tools/blob/master/sql/gw2_player_pos.sql\">https://github.com/codemasher/gw2api-tools/blob/master/sql/gw2_player_pos.sql</a> (SQL database schema)<br>\n<a href=\"https://github.com/codemasher/gw2api-tools/blob/master/examples/gw2location.html\">https://github.com/codemasher/gw2api-tools/blob/master/examples/gw2location.html</a> (web frontend)<br>\n<a href=\"https://github.com/codemasher/gw2api-tools/blob/master/examples/gw2location-ajax.php\">https://github.com/codemasher/gw2api-tools/blob/master/examples/gw2location-ajax.php</a> (ajax part of the web frontend)</p>","arenanet":false},{"pubDate":"2013-09-16T22:13:36.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/MumleLink-Security-questions/2850709","author":"Gil.9346","body":"\n<p>Hi, <br>\nI’m creating an overlay right now using the API, MumbleLink and my own server.<br>\nI have the positions of WvW players on my server sent from the overlay client, doing some kind of grouping and send position information back (not all).</p>\n<p>I want to asure noone can get this informations without my overlay client and that the client cannot be compromized to reveal enemy players positions.</p>\n<p>Basicly I will use SSL for connection of course, I will also use client obfuscation and an encrypted data format to protect the data connection.</p>\n<p>But I also need two more things from the MumbleLink data to verify the sent information and authenticate the user.</p>\n<p>First I need the HomeWorldId. The worldId is currently not set when 1) on overflow 2) in WvW. I will ask the user to login to his homeworld when the client starts for the very first time to get the id, but this can be fooled by guesting on another server, switching back, logging into an overflow map and then join WvW via the portals in LA or directly for example. I simple don’t want to look after the worldId and save it to the registry or exclude players that are on a overflow map, so please add the HomeWorldId to the Players identity or make sure the correct worldId is set in WvW. That would be even easier<img src=\"/include/images/smilies/smile.png\"></p>\n<p>Second the MumbleLink Data itself can be manipulated by creating a little program, let GW2 run to bypass process check and write the data by yourself. As my overlay client cannot check for the vality of tha data and the game write to MumbleLink only when yours actually on a map this can be used to pretend another worldId and doesn’t even require to hack the overlay client.</p>\n<p>So can GW2 include some kind of fingerprint that then can be checked against the API to verify that a player is actually really on a map in game? I think that would be enough to protect the players positions. Correct me if I’m wrong.</p>\n<p>These are my basic concerns before I can release a serious overlay application into the wild that hopefully many will use to expand their WvW experience and noone can compromize (I hope).</p>\n<p>Please help me with those issues, thank you very much.</p>\n<p>Greetings,<br>\nGil/Comes Mors</p>\n<p>Elona Reach[DE]</p>\n<p>PS: I’m not good at math. Has someone a simple example how to get the direction the player is looking in degrees relative to the north (= 0°, South= 180°) from MumbleLink data (which field)? Cannot search the forum afaik. Thanks!</p>","arenanet":false}]}