{"title":"My API Wishlist","pubDate":"2015-09-24T18:27:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/My-API-Wishlist","comments":[{"pubDate":"2015-09-28T18:49:04.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/My-API-Wishlist/5540664","author":"smiley.1438","body":"\n<p>Hmm, weird, for me it’s always in that order. Maybe it’s a caching issue – i didn’t check immedeately after log-out. But yeah, it’d be perhaps usable with a 30s TTL like some of the AH APIs.</p>","arenanet":false},{"pubDate":"2015-09-28T18:04:27.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/My-API-Wishlist/5540496","author":"Nabrok.9023","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on September 28 2015 03:23PM\"><a href=\"/forum/community/api/My-API-Wishlist/5539912\">smiley.1438:</a></cite></div><div class=\"quotey\"><blockquote><div class=\"citey\"><cite title=\"Posted on September 28 2015 02:55PM\"><a href=\"/forum/community/api/My-API-Wishlist/5539833\">Nabrok.9023:</a></cite></div><div class=\"quotey\"><p>Most recently played character name</p></div></blockquote>\n<p>/v2/characters does actually return the character names ordered by last log in, the same way as in the character selection screen.</p></div></blockquote>\n<p>I thought this too at first, but it really doesn’t.  I tried it to determine the character being played, and it does <em>usually</em> come back in that order, but not always.  It’s not reliable.</p>\n<p>I had to abandon that idea and just give users a drop down to select which character they are on (it does default to the list order though, so most of the time they don’t need to change anything).</p>\n<p>Also, the 5 minute TTL is too long for this purpose.</p>","arenanet":false},{"pubDate":"2015-09-28T15:23:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/My-API-Wishlist/5539912","author":"smiley.1438","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on September 28 2015 02:55PM\"><a href=\"/forum/community/api/My-API-Wishlist/5539833\">Nabrok.9023:</a></cite></div><div class=\"quotey\"><p>Most recently played character name</p></div></blockquote>\n<p>/v2/characters does actually return the character names ordered by last log in, the same way as in the character selection screen.</p>","arenanet":false},{"pubDate":"2015-09-28T14:55:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/My-API-Wishlist/5539833","author":"Nabrok.9023","body":"\n<p>At the moment, my wish list is short …</p>\n<p><strong>Status</strong> – Most recently played character name (the current character if online now), possibly also with class/level though we could just query characters for that.  The online status (online/away/offline).  Current map if online.  Amount of wvw supply carried. Short TTL (1 minute maybe).</p>","arenanet":false},{"pubDate":"2015-09-24T20:51:24.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/My-API-Wishlist/5524015","author":"Lawton Campbell.8517","body":"\n<p><strong>Achievements</strong> should start coming out next week-ish. Only have support for daily achievements until some more backend support lands, but we’ll probably have per-achievement account progress of some form around next month.</p>\n<p><strong>Guilds</strong> aren’t coming out until post-HoT. I don’t have enough test cases for the code and I suspect it’s bitrotted a bit.</p>\n<p><strong>Leaderboards</strong>... I’m not sure why we haven’t exposed this data programmatically. It should be fairly straightforward to do.</p>\n<p><strong>Minis</strong> and <strong>WvW Rank</strong> are pretty straightforward; I just need to find the time to implement the backend support for ’em. Probably post-HoT as well.</p>","arenanet":true},{"pubDate":"2015-09-24T18:27:30.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/My-API-Wishlist/5523629","author":"Kuzzi.2198","body":"\n<p>I use the API to help with guild management/leaderboards, and there are a few things that I would like to see added at some point in the future. I know implementing new API paths is time consuming so I don’t really expect these anytime soon, but just want to spread awareness about what some casual users like myself might find useful.</p>\n<p>Already part of API but disabled:</p>\n<ul>\n\t<li><strong>Achievements</strong> – I would love to be able to access some binary flags for every achievement per account. Progress could also be nice, but just a list of completed achievement ids would be sufficient for me personally.</li>\n\t<li><strong>Guilds</strong> – In particular I’m interested in the list of members. This may be a looong shot, but I would love to be able to access members’ API keys through the guild API. This would probably require some kind of permission from the members to enable API access for guild leaders. It would be nice if this permission step could be entirely contained in-game, but I’d understand if this is not feasible.</li>\n\t<li><strong>Leaderboards</strong> – It would be nice to access leaderboards information without web scraping, so I am definitely interested in this feature. I also hope it allows me to view the achievements leaderboard for my guild through my API key. (either that or the achievements for any guild leaderboard through a guild API key)</li>\n</ul>\n<p>New API Paths:</p>\n<ul>\n\t<li><strong>Minis</strong> – I’m surprised I haven’t seen a suggestion for this. It would be a nifty feature similar to dye unlocks.</li>\n\t<li><strong>WvW</strong> – I would like to have API access to an account’s WvW rank. Per character WvW point distribution would also be nice, but not something I foresee needing personally.</li>\n</ul>","arenanet":false}]}