{"title":"Need help in Javascript (Google sheets)","pubDate":"2015-02-14T22:06:20.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Need-help-in-Javascript-Google-sheets","comments":[{"pubDate":"2015-02-20T14:45:40.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Need-help-in-Javascript-Google-sheets/4813080","author":"Kishar.3762","body":"\n<p>Hey Light !</p>\n<p>Thank you very much for your reply !  You did a great job<img src=\"/include/images/smilies/smile.png\"><br>\nI took a look on the source page, your javascript is “much clear” than mine, I prefer yours. The problem with mine is I’m asking to the API for each function I want, the best thing is to ask one time and get full informations, like yours. <br>\nI’ll so change my script to follow the base of what you did. Thanks again for your reply, you help me a lot ^^</p>","arenanet":false},{"pubDate":"2015-02-20T14:01:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Need-help-in-Javascript-Google-sheets/4812991","author":"Light.7493","body":"\n<p>Hey there. I created a webpage a few months back for calculating your bank worth:<br>\n<a href=\"http://pvp.guru/bank\">http://pvp.guru/bank</a></p>\n<p>I think the following web component has the stuff you need(look at the source):<br>\n<a href=\"http://pvp.guru/elements/paper-adder.html\">http://pvp.guru/elements/paper-adder.html</a></p>","arenanet":false},{"pubDate":"2015-02-15T13:53:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Need-help-in-Javascript-Google-sheets/4798179","author":"Kishar.3762","body":"\n<p>Thank you very much Darthmaim for your reply !<img src=\"/include/images/smilies/smile.png\"></p>\n<p>So Do I need to remove just “% 100” on the “var gold” or do I need to remove the full line and juste keep “var gold” ? :o (I’m sorry, my question is, I think, stupid, but I tried several times to remove some parts of this function and it doesn’t work…)</p>\n<p>And now, I have another problem, about my function “GetItemBuyValue”, I saw a lot of different code for this one, so I tried it all but, on the Google sheets, it’s written \"Error, can’t read “max_offer_unit_price” and what I don’t understand is, this the line that everybody use to get the item max offer. <br>\nSo Actually, I’m using the line which is on my pastebin. But I tried those lines too:</p>\n<p>function getItemBuyValue(itemID) {<br>\n  var myUrl = “<a href=\"https://api.guildwars2.com/v2/commerce/listings/\">https://api.guildwars2.com/v2/commerce/listings/</a>” + escape(itemID);<br>\n  var jsonData = UrlFetchApp.fetch(myUrl);<br>\n  var jsonString = jsonData.getContentText();<br>\n  var jsonObject = JSON.parse(jsonString);<br>\n  if (jsonObject.buys.length === 0) {<br>\n    return 0;<br>\n  }<br>\n  var adjustedValue = (jsonObject.buys[jsonObject.buys.length-1].unit_price / 100);<br>\n  return adjustedValue;<br>\n}</p>\n<p>And if I use those lines, on the Google sheet, I don’t get “Error, can’t read max_offer_unit_price” (of course, this is not written on the script that’s why) but it’s written false information like “0,01” for the max offer price for Volcanus for example.</p>\n<p>If someone could help me a little bit (again… &gt;_&lt;)</p>\n<p>See here the new pastebin: <a href=\"http://pastebin.com/Z4UygwSc\">http://pastebin.com/Z4UygwSc</a></p>\n<p>EDIT: I found my error but to have the full price in gold / silver / copper, thanks again Darthmaim !<br>\nBut I still have error the function to get the max offer… And now I have an error about the function to get item name with ID (but it was working yesterday so maybe an issue with gw2 server ?)</p>\n<p>EDIT 2: I found my second error after XXX hours on (to get max offer) ! Even if… now i can’t get item name with the get item function with the ID… But this function still working with gw2spidy.</p>","arenanet":false},{"pubDate":"2015-02-14T22:40:34.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Need-help-in-Javascript-Google-sheets/4796773","author":"darthmaim.6017","body":"\n<p>Don’t take the modulo 100 for the gold.</p>","arenanet":false},{"pubDate":"2015-02-14T22:06:20.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Need-help-in-Javascript-Google-sheets/4796724","author":"Kishar.3762","body":"\n<p>Hello !</p>\n<p>It’s the first time I use Javascript and I did it with the Google script editor (to link the script to a google sheet). In fact, on the same sheet, I’d like to have everything I need from Trading Post (max offer / sell value …) and some others things like: auto calculated profit / auto loading item name and his full information when i’m just giving the item ID. Later, I want a script, which be able to send me a voice alert to say “Hey, big profit on this weapon, wake up now !”</p>\n<p>I think I just did a small part of this work, just put the important steps (a lots found on the web, awesome community !) but I still having a problem.</p>\n<p>In fact, from my “GetItemSellValue”, I’d like to have it with “XXXXXXXg XXs XXc” so I used the function “FormatAsGold”. There, is the problem: if there is more of 2 numbers for the golds, I’ll see only the 2 last number of the golds and not the others.</p>\n<p>Easy example, a weapon sold for 1987 golds 34 silvers 55 coppers, in my “GetItemSellValue” column I will have: 19873455 and what I want to have in my \"FormatAsGold column “1987g 34s 55c”… But I will only have “87g 34s 55c”, so missing the two first number “19”… And there’s a big difference between 1987g and 87g…<img src=\"/include/images/smilies/smile.png\"><br>\nIf anyone could help me a little bit about this, it could be very nice !</p>\n<p>Just one thing, I know there is the GW2spidy API (really good one !) but I want to use only and only the official API (v2 so) and I know a lot of people put their jobs on the wiki but I still prefer do my own, even if, of course, I used a big part of the comunnity’s job to do mine, like I said, this is the first time I was using Javascript (and it’s hard because I never used any development languages…).</p>\n<p>See here my pastebin code: <br>\n<a href=\"http://pastebin.com/XuQ214vm\">http://pastebin.com/XuQ214vm</a></p>","arenanet":false}]}