{"title":"Orphaned skin IDs","pubDate":"2014-05-22T21:32:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Orphaned-skin-IDs","comments":[{"pubDate":"2014-06-13T13:57:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Orphaned-skin-IDs/4117256","author":"Sariel V.7024","body":"\n<p>After digging into some sites that truck in datamining, I’ve found that the Destroyer Scythe and the Worn Voltaic Spear both had PvP skins made. They’re not in the API. I suspect that they may have been dragon level rewards before anyone had dragon, and now there’s no way to get them.</p>","arenanet":false},{"pubDate":"2014-05-22T21:32:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Orphaned-skin-IDs/4049949","author":"Sariel V.7024","body":"\n<p>It’s been a busy couple of weeks.</p>\n<p>When I originally started making my skins guide, I figured I would have to visit every merchant in existence in order to track down where to get some of the lesser known skins cheaply. This would prove impossible, because as I discovered, even the wiki doesn’t list them all, and many only exist as merchants for a brief period of time. Fortunately, I stumbled upon this little community and was able to get access to a lot of information programmatically. It also led me to find some holes.</p>\n<p>Currently, there appear to be no items connected to the following skins:</p>\n<p>5040 Etched Short Bow  (there is ONE level 20 masterwork Etched Shortbow and a similar level 20 Etched Longbow that could be vendor items, but item ids on these two return errors). Note, the items in the trade post that do drop use skin 5112 Shaman’s  Etched Short Bow (now making them the hilariously named Shaman’s Shaman’s Etched Shortbow). No idea if this affects creation of Corrupted Shortbow.<br>\n4543 Guild Speargun. Doesn’t appear to be a PvP version either.<br>\n4987 Destroyer Scythe<br>\n4729 Reaper of Souls. No item id, yet someone has stats for it on wiki.<br>\n4854 Worn Voltaic Spear. Nothing even similar.<br>\n2371 Covert Charr backpack. Might be an issue with RNG. Wiki knows nothing about it.</p>","arenanet":false}]}