{"title":"owner_guild question","pubDate":"2013-05-21T11:16:55.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/owner-guild-question","comments":[{"pubDate":"2013-05-21T13:21:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/owner-guild-question/2067134","author":"hagop.1052","body":"\n<p>Well I can easily gather information about guilds on my server by just asking who claimed it and create additional custom map of keys and guild names. I think I will use it as temporary solution but it would be much better if we would have that information.</p>\n<p>I already read that thread, but I would like to know definite answer if arenanet will expose that information. I don’t think it is harmful to see guild names when we already have info about claimed objectives. If they have decided that info is not harmful, exposing guild names shouldn’t be harmful as well.</p>","arenanet":false},{"pubDate":"2013-05-21T11:55:55.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/owner-guild-question/2066773","author":"Yoone.9461","body":"\n<p>Cliff says new things will be implemented if the WvW API isn’t harmful for the gameplay:</p>\n<p><a href=\"https://forum-en.guildwars2.com/forum/community/api/WvW-API-and-how-it-may-affect-WvW-balance\">https://forum-en.guildwars2.com/forum/community/api/WvW-API-and-how-it-may-affect-WvW-balance</a></p>\n<blockquote>\n<p>You’re right that even the information we’re exposing now via the API could cause WvW balance to change. We’re watching to see whether the overall impact on the game is positive or negative. If it’s positive, then we’d definitely consider exposing more information via the APIs.</p>\n</blockquote>","arenanet":false},{"pubDate":"2013-05-21T11:16:55.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/owner-guild-question/2066627","author":"hagop.1052","body":"\n<p>Is it possible to decode owner_guild returned by wvw match_details currently? Or are you planing to provide us an api for guild names so we could match them to these keys?</p>\n<p>Great API btw, planning some days off so I could play with it and create couple of apps/web pages.</p>\n<p>Hagop</p>","arenanet":false}]}