{"title":"Pinch my high-res tiles, and new Plotty.","pubDate":"2017-02-18T11:07:09.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Pinch-my-high-res-tiles-and-new-Plotty","comments":[{"pubDate":"2017-02-18T11:07:10.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Pinch-my-high-res-tiles-and-new-Plotty/6499474","author":"ProperDave.7425","body":"\n<p>Hi all,<br>\nI’ve made further improvements to Plotty, now adding the game server IP recording to position data (this should support both existing IPv4 output from MumbleLink, but also IPv6 should Anet ever switch to it). I’ve switched the built-in web browser control from .NET’s godawful WebBrowser control to Mozilla Gecko (Firefox’s engine). The switch means that Plotty has had a size increase though – up from 8MB to 80MB for the inclusion of the new browser controls.<br>\nIf anyone wants a reliable MumbleLink exporter but doesn’t want the bloat now attached to Plotty, let me know. I’ll re-write the MumbleLinkAPI Interface into a reusable DLL or small console application.</p>\n<p>I’ve also overhauled GW2Maps a bit, and created a high-resolution tile endpoint. You’re welcome to pilfer my high-res tiles, but for the love of Iron show some respect for my bandwidth/cpu cycles and cache them your side.</p>\n<p>The high-res endpoint operates thusly:<br>\n1)  You request a tile (eg: <a href=\"http://www.gw2maps.com/tile/highres/1/1/5/10/10.jpg\">http://www.gw2maps.com/tile/highres/1/1/5/10/10.jpg</a> )<br>\n2)  GW2Maps first checks to see if it’s generated the tile in the last 24 hours, if it has, it returns the existing tile.<br>\n3)  If the site needs to generate your request, it initially checks for and downloads [if required] the current standard-resolution tile from the Tile Service API. This standard-res tile will be returned if there’s any errors generating the high-res one.<br>\n4) Your high-res tile request is then created from stitching together cached Zoom-level 7 tiles. If the site doesn’t have the tile it needs, it retrieves the required tile from the Tile Service API.</p>\n<p>Every request to the Tile Service API is cached for at least 24 hours (I’ve added variance to the caching to prevent multiple re-requests for tiles at once). So this caching prevents hitting Anet’s API excessively. <br>\nAfter all, we’re only going to see significant map changes when new maps are added, so we don’t need to spam the servers with requests constantly, and I can purge the cache on GW2Maps when new maps are released to rebuild the whole of Tyria/Mists.</p>\n<p>As a bootnote; I’m only providing high-res tiles for zoom layers 4, 5 and 6 – zoom level 7 is the regular tiles, and anything less than zoom level 3 is not noticeable detail, so my endpoint will just return standard tiles for those zooms.<br>\nbootnote2; I have DNS aliases too. tiles1,tiles2,tiles3,tiles4 <img src=\"/include/images/smilies/smile.png\"></p>\n<p>Feedback would be greatly appreciated. I think all this stuff is cool – but then I’m totally a geography nerd.</p>","arenanet":false}]}