{"title":"Play in-game instruments with MIDI keyboard!","pubDate":"2017-07-28T21:56:55.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Play-in-game-instruments-with-MIDI-keyboard","comments":[{"pubDate":"2017-08-02T18:02:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Play-in-game-instruments-with-MIDI-keyboard/6667498","author":"aeth.4892","body":"\n<p>If you have a MIDI keyboard, you can give my program a try. It works much better than anything I have tried so far and without latencies in general because it uses lowest level API possible which is native Windows API written in C. The only latency there is is the latency caused by the game.</p>","arenanet":false},{"pubDate":"2017-08-01T11:02:15.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Play-in-game-instruments-with-MIDI-keyboard/6662518","author":"Kellwan.7681","body":"\n<p>That is a BRILLIANT idea! The system for playing instruments in gw2 is terrible to say the least! Especially when one is playing the instrument in real life – it just seems so counter intuative. Being able to plug-in my midi keyboard would massivly improve the value of the musical instrument. <br>\nI don’t have to run a secoundary program to make it sound well, just plugin my keyboard and play – that would be amazing!</p>\n<p>I really hope that the devs see this and embrace it – perhaps develope it – it is a small change, but it would make the instruments a million times better. <br>\nAnd add a whole new level of immersion where musicians could actually stand around events and cities and play for real.</p>","arenanet":false},{"pubDate":"2017-07-28T21:56:55.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Play-in-game-instruments-with-MIDI-keyboard/6659128","author":"aeth.4892","body":"\n<p>Hello,<br>\nFirst of all, I’m not sure if it’s a good place to share this, but I will give it a try. I hope I won’t get banned for this…<br>\nI know about a single app that lets you play in-game instruments with MIDI controller keyboard, it’s written in C# and it’s really bugged. I spent like 1 hour trying to make it work but I failed. I wanted this feature really bad so I decided I will create my own app that does the same thing and I’d like to share it with everyone. So far it has no other features than reading default MIDI input device and translating keys pressed into keys in game for harp. It supports full 3 octaves. All you have to do is to have your MIDI controller set up as default MIDI device (it’s done by default in windows once you plug it in) and launch the app. It doesn’t matter whether you launch the app or the game first.</p>\n<p>Here is the link to the repository (I wrote it in C++, builds in VS2017 community)<br>\n<a href=\"https://github.com/aethersis/Gw2Midi\">https://github.com/aethersis/Gw2Midi</a></p>\n<p>And if you don’t want to bother with building it, you can just download the executable here:<br>\n<a href=\"https://github.com/aethersis/Gw2Midi/raw/master/Release/Gw2Midi.exe\">https://github.com/aethersis/Gw2Midi/raw/master/Release/Gw2Midi.exe</a></p>\n<p>Please let me know if you like it and if it works for you. I’m open for any constructive feedback and feature requests.</p>","arenanet":false}]}