{"title":"Possible for /wiki to not give up foreground?","pubDate":"2015-03-01T02:32:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Possible-for-wiki-to-not-give-up-foreground","comments":[{"pubDate":"2015-03-02T14:42:20.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Possible-for-wiki-to-not-give-up-foreground/4841590","author":"Archomeda.6472","body":"\n<p>Hmm… I’m not sure, but isn’t the Mac client using some sort of version of Wine or something similar? At least, that’s what I was told by someone who actually owns a Mac (I don’t). If this is true, I think it’s impossible for ArenaNet to do something like that, since this requires native calls to OSX while GW2 is effectively running in a “simulated” Windows environment on OSX.</p>\n<p>GW2 on OSX suffers the same problem with the Mumble Link API iirc.</p>","arenanet":false},{"pubDate":"2015-03-01T02:47:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Possible-for-wiki-to-not-give-up-foreground/4838562","author":"codechemist.7280","body":"\n<p>Hmm…&nbsp;I suspect this might be a function of the LaunchServices method the game calls, and not something the game does explicitly.</p>","arenanet":false},{"pubDate":"2015-03-01T02:32:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Possible-for-wiki-to-not-give-up-foreground/4838533","author":"codechemist.7280","body":"\n<p>I suspect the answer is “no” but wanted to check. My friend had an idea that it would be cool to use the /wiki command but have it load in an expandable overlay window (on OS X) instead of switching out to your browser.</p>\n<p>I have written a special browser app that can act as an overlay for Guild Wars 2. I have it working so that when you type “/wiki &lt;query&gt;” it will load the web page in my app which is currently overlaying the game. All of that is working.</p>\n<p>But Guild Wars still relinquishes its foreground status. I wonder if there is a way to have Guild Wars send the Apple Event to the browser without relinquishing its foreground status. Is there a config file somewhere with this (admittedly wishful thinking) setting? Or is it hard coded into the client?</p>\n<p>Thanks!<br>\ndan</p>","arenanet":false}]}