{"title":"Possible bug with PvP game end/start time","pubDate":"2017-01-03T02:20:21.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Possible-bug-with-PvP-game-end-start-time","comments":[{"pubDate":"2017-01-04T17:46:17.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Possible-bug-with-PvP-game-end-start-time/6454288","author":"Lawton Campbell.8517","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on January 04 2017 02:05AM\"><a href=\"/forum/community/api/Possible-bug-with-PvP-game-end-start-time/6453748\">Mushin.3928:</a></cite></div><div class=\"quotey\"><p>If this is fixed, do you know if it would take effect for old games?</p></div></blockquote>\n<p>Yeah, it’ll take effect for old games. The stored data is correct — there’s a date/duration for each game — the API frontend is just misinterpreting the date as the start date rather than the end date.</p>\n<p>Should have it fixed by the end of the week.</p>","arenanet":true},{"pubDate":"2017-01-04T02:05:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Possible-bug-with-PvP-game-end-start-time/6453748","author":"Mushin.3928","body":"\n<p>If this is fixed, do you know if it would take effect for old games?  I could implement a workaround right now that queries an old game and checks to see if it’s “ended” time is what I expect it should be.  If it isn’t, I can do my own date calculations based on end time and duration.  But this presupposes that its just a code bug or that the data the API uses will be refreshed with the correct values for all time.</p>\n<p>Thanks for the hard work on the API.  I dig it.</p>","arenanet":false},{"pubDate":"2017-01-03T17:51:57.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Possible-bug-with-PvP-game-end-start-time/6453347","author":"Lawton Campbell.8517","body":"\n<p>Could you provide some more data? Like, expected start/end, actual start/end for a match or two?</p>\n<p>EDIT: nm, Evan poked around in the code for me and you’re totally right; the date the API is reading is the end date, and it’s adding the duration to that. <a href=\"https://github.com/arenanet/api-cdi/issues/421\">Tracking issue</a>.</p>","arenanet":true},{"pubDate":"2017-01-03T02:20:22.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Possible-bug-with-PvP-game-end-start-time/6452856","author":"Mushin.3928","body":"\n<p>I have been taking screenshots of the end game leaderboard after a PvP match ends.  I have the game set to display the time in-game so I can see it on each screenshot.</p>\n<p>In the API response for a game, It appears that the “started” time actually is the end time.  The  time value in this field matches my screenshot.  The “ended” time is always later than the start time but I don’t know what it represents, since it is often much later than the actual end time (in one case I see that it is 12 minutes later).</p>\n<p>I know that the time on my PC is correct, because it is synced to the network and it matches other things like my phone.  I know I’m looking at the right game from the API too because the map and final score matches what is in my screenshot.</p>\n<p>The reason I’m looking at this is that I wrote a program to querymy games from the API and then organize screenshots/videos associated with each game.  Since the time values are off, my program isn’t matching up the media files correctly.</p>","arenanet":false}]}