{"title":"Question about russian localization","pubDate":"2016-06-12T12:29:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Question-about-russian-localization","comments":[{"pubDate":"2016-06-15T08:04:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Question-about-russian-localization/6203200","author":"Lich King.1524","body":"\n<p>Do you have any plans to make russian localisation for whole game?</p>\n<p>(other game vendors did it succesful via local partners, like BlackDesertOnline, Blade&amp;Soul, ArchAge, etc, etc)</p>","arenanet":false},{"pubDate":"2016-06-13T21:57:08.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Question-about-russian-localization/6200577","author":"Lawton Campbell.8517","body":"\n<p>I asked around. Our billing partner, Digital River, has a Russian localization. The button to switch languages for that form is on their side and they haven’t disabled it. That page is AFAIK the only place that has a Russian localization.</p>","arenanet":true},{"pubDate":"2016-06-13T17:00:48.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Question-about-russian-localization/6200164","author":"Sariel V.7024","body":"\n<p>Localizing the entire game would be a ridiculously massive undertaking. I think you have some idea of this. On top of all the dialogue, the item descriptions, attack names, skill descriptions, etc, you also have to get voice actors and rerecord most everything you’ve ever seen in-game. Every byte devoted to text or spoken word would need to be recreated. Russia would need to have a VERY significant player base to even justify looking at this, much less green-lighting it.</p>","arenanet":false},{"pubDate":"2016-06-12T12:29:01.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Question-about-russian-localization/6198675","author":"Reconder.7204","body":"\n<p>Hi, I returned to GW2 after some time of not playing it. I haven’t bought HoT(i think eventually i’ll do it<img src=\"/include/images/smilies/smile.png\"> ). I was really suprised when I found myself able to switch on russian language on page of HoT at Black Lion Market window(and only there).  As far as I know devs has already answered question about russian localization like 3 years ago. But here is my question, is there russian localization coming, or it’s only for HoT page?</p>","arenanet":false}]}