{"title":"Rate limit?","pubDate":"2013-11-01T14:47:51.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Rate-limit","comments":[{"pubDate":"2013-11-03T09:47:28.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Rate-limit/3142036","author":"Healix.5819","body":"\n<p>There is currently no rate limiting on the official API. However, you are meant to use it responsibly, else they will eventually enforce a limiter if too many people abuse it.</p>\n<p>For example, if you are requesting item data, request it once and then cache it, since it will rarely change. If you are requesting an event to track it, request it once every few seconds, rather than every few milliseconds, and don’t pull every single event if you only need one.</p>","arenanet":false},{"pubDate":"2013-11-02T21:34:33.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Rate-limit/3139516","author":"newline.4125","body":"\n<p>It appears to depend on which service you are requesting. Like Drakama, I have yet to reach a limit when requesting the official apis: api.guildwars2.com, render.guildwars2.com, tiles.guildwars2.com. However I have run into issues with the unofficial trading post api: tradingpost-live.ncplatform.net. After only a couple(25) requests, I start to get response code 500s from the server. I then have to wait about a minute before I start receiving response code 200s again. I have yet to find an acceptable rate to avoid these response code 500s.</p>","arenanet":false},{"pubDate":"2013-11-01T16:08:19.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Rate-limit/3131464","author":"Drakma.1549","body":"\n<p>I currently make about 15 calls per second and I have yet to be rate limited.</p>","arenanet":false},{"pubDate":"2013-11-01T14:47:51.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Rate-limit/3131048","author":"aelen.5673","body":"\n<p>Hi,</p>\n<p>I’m making something that could potentially cause a lot of calls to the API. Is there any kind of rate limit in place that I should be aware of, or can I just.. go ahead?</p>\n<p>Cheers,<br>\nAelen</p>","arenanet":false}]}