{"title":"Scope of IDs: definition or instance?","pubDate":"2013-05-31T17:21:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Scope-of-IDs-definition-or-instance","comments":[{"pubDate":"2013-05-31T18:13:46.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Scope-of-IDs-definition-or-instance/2129194","author":"Leablo.2651","body":"\n<p><del>On a related note, it seems that the missing events are also language-specific. English and French are slackers!<img src=\"/include/images/smilies/smile.png\"></del></p>\n<p>Scratch that, it was because these languages tend to use apostrophes… which weren’t being escaped. My bad.</p>","arenanet":false},{"pubDate":"2013-05-31T17:44:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Scope-of-IDs-definition-or-instance/2128970","author":"Healix.5819","body":"\n<p>The event’s ID is part of the event’s definition. It will never change.</p>\n<p>After a server reset, the event data is cleared and specific events will appear to be missing until the event has occurred at least once on the server. For example, if you request a list of event as the server resets, the returned data will be {\"events\":[]}, which would lead you to believe that no events exist.</p>","arenanet":false},{"pubDate":"2013-05-31T17:21:56.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Scope-of-IDs-definition-or-instance/2128796","author":"Leablo.2651","body":"\n<p>It wasn’t clear from the documentation whether new IDs are generated each time an event runs (identifying a unique instance of every event), or whether the same ID is applied to each instance of the same event, or something in between.</p>\n<p>Intuitively I had thought the ID was part of the event definition but unless I’ve been doing it wrong this seems not to be the case.</p>\n<p>EDIT: Having a browse through the forums it looks like my problem could be the “missing events” issue reported by others. I would still like confirmation one way or the other. Basically I am seeing a lot of “new” event IDs turn up every few minutes.</p>","arenanet":false}]}