{"title":"Suggestions","pubDate":"2017-08-17T16:08:07.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Suggestions","comments":[{"pubDate":"2017-08-19T15:31:42.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Suggestions/6707690","author":"Trista.4095","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on August 19 2017 05:33AM\"><a href=\"/forum/community/api/Suggestions/6706387\">Mystic.5934:</a></cite></div><div class=\"quotey\"><p>not really the correct place.  <a href=\"https://forum-en.guildwars2.com/forum/game/gw2\">general discussions</a> is where this goes</p>\n<p>API Development is more for, well, API stuff.  API bugs, how to use it, API suggestions.  The API is used to get in-game data from outside the game (such as map tiles, event timers, item prices, etc.)</p></div></blockquote>\n<p>Thank you it was posted to the right area..<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2017-08-19T05:33:16.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Suggestions/6706387","author":"Mystic.5934","body":"\n<p>not really the correct place.  <a href=\"https://forum-en.guildwars2.com/forum/game/gw2\">general discussions</a> is where this goes</p>\n<p>API Development is more for, well, API stuff.  API bugs, how to use it, API suggestions.  The API is used to get in-game data from outside the game (such as map tiles, event timers, item prices, etc.)</p>","arenanet":false},{"pubDate":"2017-08-17T16:08:08.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Suggestions/6702139","author":"Trista.4095","body":"\n<p>I believe this is the correct place to post all of this…</p>\n<p>My hubby and I have been talking about different ideas to add to the game. I know will be more difficult to do and some might not be such GREAT ideas.</p>\n<p>1) Would it be possible to add in what was done in GW1 where you could see what enemies on the lower map marked with RED dots and other players marked with Blue and your guilds in a different color?</p>\n<p>2) when in your story getting through the tougher parts there are some players that don’t want to help through the first story Especially in some Guilds who are not so helpful.  Would be amazing if you could hire HEROES or Henchman in the big cities that can help you when no one else is available. I understand we have helpers in our story but they really don’t help all that much. Actually, most of them stand around like a lost glitch!</p>\n<p>3)  The purpose of continually finding low level loot is restraining when you are level 80. It would be beneficial to be able to receive higher level loot in places meant for higher level characters. It’s one thing when you are helping someone in a low level area. However, a group battle against a massive boss for example and you receive medium armor gloves for a level 20 and you happen to be level 80 and wear light armor and out on the prowl for crafting materials or salvage off some awesome runes. If you are making ascended armor, spending hours searching and finding a batch of loot that ends up yielding a small batch of cotton and iron can be frustrating. I hate buying the materials. That what salvage kits are for!</p>\n<p>4)Remember the Xunai chest in guild wars 1??? It was great! Yes I know having to buy extra slots in the bank makes arena net $$ so I get that. However, in your home instance it would be so nice to be able to drop a set amount of the most important sould bound weapons in a xunai style chest in your home instance. Perhaps not for crafting components but just for  soul bound weapons, accessories… wearable items. That way the bank is for money, crafting materials, and everything else.</p>","arenanet":false}]}