{"title":"Tile_service API &amp; GW2 updates","pubDate":"2014-01-05T09:55:11.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Tile-service-API-GW2-updates","comments":[{"pubDate":"2014-01-20T03:45:07.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Tile-service-API-GW2-updates/3520302","author":"Nekonome.9076","body":"\n<p>You mean that a change in the image is somewhat detectable in the HTTP header ?</p>","arenanet":false},{"pubDate":"2014-01-18T01:07:16.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Tile-service-API-GW2-updates/3511708","author":"Kegsay.7068","body":"\n<p>You could probably do this in a low bandwidth setting by prodding build.json for a change in version. If there is a change in the version, enumerate all map tiles with an HTTP HEAD at a given zoom level (too far in is pointless, too far out may miss subtle changes like Kessex). You could further optimise this by prioritising user-visible tiles.</p>\n<p>Of course, this isn’t going to be quick, but you’ll make significant bandwidth savings over time by just HEADing for changes in Last-Modified or the ETag.</p>","arenanet":false},{"pubDate":"2014-01-06T22:05:23.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Tile-service-API-GW2-updates/3460733","author":"smiley.1438","body":"\n<p>Oh, i see, i just checked on minimum zoom and Kessex didn’t look if it has been changed at all.</p>\n<p>The script is just intended as a simple (and hopefully understandable) example which could basically ported to any other language<img src=\"/include/images/smilies/wink.png\"></p>","arenanet":false},{"pubDate":"2014-01-06T21:36:10.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Tile-service-API-GW2-updates/3460635","author":"Nekonome.9076","body":"\n<p>The modification I was speaking of were in Kessex. And as you can see on the following image, they are put on the map :<br>\n!<a href=\"https://tiles.guildwars2.com/1/1/7/41/57.jpg\">https://tiles.guildwars2.com/1/1/7/41/57.jpg</a>!</p>\n<p>Sweet work you’ve done !</p>\n<p>The difference is that my app is local (but that is not the subject<img src=\"/include/images/smilies/wink.png\"> )<br>\nIn the app i handle the tiles individually, so that’s not a problem.</p>","arenanet":false},{"pubDate":"2014-01-05T16:35:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Tile-service-API-GW2-updates/3455546","author":"smiley.1438","body":"\n<p>As far as i remember, there was only one significant update of the continent map tiles yet: when the ruins were added to WvW. Temporary content has never been added to the continents maps (not even the toxic stuff in kessex, which is already there for over 3 months or so?) and i doubt this will happen in near future. However, instance maps are usually added with their respective game updates.</p>\n<p>Also, unfortunately Anet doesn’t seem to bother to tell us if there were map tile updates, so you’ll need to check manually if something has changed. You might want to check out a script i wrote to get a portion of the map:</p>\n<p><a href=\"https://gist.github.com/codemasher/75d8e1a24b2363cabebf\">https://gist.github.com/codemasher/75d8e1a24b2363cabebf</a></p>\n<p>Demo over here: <a href=\"http://gw2.chillerlan.net/examples/gw2staticmaps.php\">http://gw2.chillerlan.net/examples/gw2staticmaps.php</a></p>","arenanet":false},{"pubDate":"2014-01-05T09:55:12.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Tile-service-API-GW2-updates/3454628","author":"Nekonome.9076","body":"\n<p>Hello everybody<br>\nAs this is my first post here, I wanted to thanks everybody for their works and questions and explanations that allowed me to not drown in the API and their usage.</p>\n<p>So my question is :<br>\nI created a little map program : <a href=\"https://sites.google.com/site/cerisecode/gw2_guild_app/Minimap.zip\">Minimap</a><br>\nIt works in windowed mode for the moment.</p>\n<p>This use a cache method for the map, because my goal is to make a tool with low bandwidth usage, and quick at display.</p>\n<p>The problem is, when an update is made in the map of gw2, how can I know which tiles must be re-downloaded ?<br>\nI thought about deleting them at each change of version, but it’s not the best way since all the tiles will have to be downloaded again.</p>\n<p>Is there a way I didn’t see ? or if not, is it possible to have in the future some information about the tile version (a new API ?) ?</p>\n<p>Thanks you in advance</p>","arenanet":false}]}