{"title":"Troulbe getting data to display","pubDate":"2016-03-09T19:33:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Troulbe-getting-data-to-display","comments":[{"pubDate":"2016-03-12T04:06:16.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Troulbe-getting-data-to-display/6037679","author":"Neural.1824","body":"\n<p>Displaying the response as text is a good idea.  I’ll see what I can get out of that.  I suspect that it’s just not getting the data, but will see what turns up.  Thx.</p>","arenanet":false},{"pubDate":"2016-03-11T14:07:24.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Troulbe-getting-data-to-display/6036361","author":"DarkMagister.7429","body":"\n<p>I’d say that EVE API is a very different thing, at least in those parts I worked with it<img src=\"/include/images/smilies/smile.png\"><br>\nWhat access point do you use for testing?<br>\nMy drill for initial testing was:<br>\n1. Copy the link from wiki and open in my brower<br>\n2. Generate the link I needed in the program, copy it and check in the browser that it works fine.<br>\n3. Show the downloaded JSON as text<br>\n4. Try to interpret the JSON.</p>\n<p>This will at least allow you to see the stage you have a problem at.</p>","arenanet":false},{"pubDate":"2016-03-09T19:33:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Troulbe-getting-data-to-display/6032929","author":"Neural.1824","body":"\n<p>I’m very new to using JSON, but have do have some limited experience with API’s (worked with the Eve Online API in the past).</p>\n<p>So far I have successfully pulled static data off of a file on my hard drive, and displayed it.  I have also successfully gone through tutorials on pulling API data from an external source, but when I move to use the GW2 API, things go blank.</p>\n<p>Is there some additional code needed to get the data from the GW2 API?  Are there any tutorials specific to the GW2 API?  It just seems odd that things work fine until I use the sample URL from the wiki.</p>","arenanet":false}]}