{"title":"upgrade list on website","pubDate":"2017-02-16T20:49:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/upgrade-list-on-website","comments":[{"pubDate":"2017-02-27T20:03:50.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/upgrade-list-on-website/6512123","author":"Abominable Snowman.2036","body":"\n<p>It automatically gets the upgrades your guild has, the items it requires and the items your guild has. You have to manually tell the app what you’re currently working towards.</p>\n<p>The list displays all of the items your guild has in the treasury and in your guild bank, but yeah, it could make sense to filter that to only the items needed for the upgrades you’re currently working on.</p>\n<p>The page you see in the screenshot is from <a href=\"http://upgrades.hackedd.nl/guild/bb\">my personal bank guild</a>. You can log in as a member with the password fe2CMM42OQ. As a member you can see the upgrades and materials, but you can’t make any changes.</p>\n<p>Let me know if you’ve got any other questions.</p>","arenanet":false},{"pubDate":"2017-02-23T22:05:14.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/upgrade-list-on-website/6507499","author":"Daiki.6237","body":"\n<p>Not sure he’ll let me send his API out just yet. How exactly does your table work? Does it give you a list that you have to upgrade or is the item entered manually and then it pulls the info? Can you only have it show what upgrade you are working on and the mats, cause the pic you posted shows other mats as well. Do you have a link to it so i can actually see what it looks like overall?</p>","arenanet":false},{"pubDate":"2017-02-19T10:46:53.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/upgrade-list-on-website/6500443","author":"Abominable Snowman.2036","body":"\n<p>I’ve built something very similar to what you want for my own guild, which you could use for your guild as well. Just PM me your guild’s name and an API key (has to be created by the guild leader) if you want to try it out.</p>","arenanet":false},{"pubDate":"2017-02-16T20:49:03.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/upgrade-list-on-website/6497567","author":"Daiki.6237","body":"\n<p>The guild I’m in has a decent website we use to keep everybody up to date on what is happening in the guild. We even have a little window off to the side that shows what current upgrade we are trying to finish for the week. As the main scribe in the guild and having the upgrades and material handling fall on me, I always did the whole c/p from the wiki with the mats we need and subtract what ever we had in the treasury for it.</p>\n<p>I might have missed this in searching but is there a way to pull the API and show the upgrade we are working on as well as displaying a live accounting of the materials for it?<br>\n <br>\nFrom what I was pointed to at first and am starting to read on was this, <a href=\"https://wiki.guildwars2.com/wiki/API:2/guild/upgrades\">https://wiki.guildwars2.com/wiki/API:2/guild/upgrades</a>. Now is there a list of what the ids for the upgrades are?</p>\n<p>And not having worked with API’s before but I am researching on how to use them as well, can anyone guide me on how to use them to display the correct info that I want?</p>","arenanet":false}]}