{"title":"Use the new API for your Leaderboards!","pubDate":"2013-05-20T21:40:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Use-the-new-API-for-your-Leaderboards","comments":[{"pubDate":"2013-05-20T22:13:27.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Use-the-new-API-for-your-Leaderboards/2063827","author":"Rising Dusk.2408","body":"\n<p>Simple, really. Because an official and appropriately detailed leaderboard is something that should be supported by a company that encourages competition in its formats. Besides, I don’t think the team developing the API are the same guys that develop the leaderboards, so working on one using the developments of the other shouldn’t impede any of the API enhancements that they plan on doing.</p>","arenanet":false},{"pubDate":"2013-05-20T21:54:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Use-the-new-API-for-your-Leaderboards/2063694","author":"famfamfam.9137","body":"\n<p>The leaderboard programming crew’s priority should be making the current leaderboard information available via the API.</p>\n<p>If sites like MoS (and many others in the coming weeks) are competing on finding the best way to display these things, the best additional features, and feeding feature requests back to ArenaNet, we will end up with much better resources for the community. Why would we want ArenaNet to spend its time competing against its community in providing services that the community now has the (excellent) tools to provide?</p>","arenanet":false},{"pubDate":"2013-05-20T21:40:52.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Use-the-new-API-for-your-Leaderboards/2063616","author":"Rising Dusk.2408","body":"\n<p>Oh man, this is super exciting. This is one of those things that when a company comes out with it, it’s like candy. There is so much opportunity here, and I want to personally thank you all for your contributions, ANet. You guys deserve every bit of praise you get.</p>\n<p>That said, I really want to see one thing. Take a look at <a href=\"http://mos.millenium.org/na/\">this</a> website, and then take a look at your guys’ WvW leaderboards. They’ve already updated to take into account your new API, and look at how much useful information there is! I’d love nothing more than to see you guys implement a similar interface displaying in real time the current situation on any given WvW map for any given WvW match-up. I think this should be a priority for the Leaderboard programming crew, because I really don’t like the idea of having to use an external website to the GW2 website for this sort of information, and right now the current way the WvW leaderboards are set u kitten everely lacking in meaningful information.</p>\n<p>Either way, great job, and I look forward to what your plans are for the API.</p>","arenanet":false}]}