{"title":"Work-in-progress: GW2 Event Explorer","pubDate":"2013-05-25T01:35:15.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Work-in-Progress-GW2-Event-Explorer","comments":[{"pubDate":"2013-05-25T01:35:15.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/Work-in-Progress-GW2-Event-Explorer/2088082","author":"das moran fool.1072","body":"\n<p>Short summary: GW2 Event Explorer is a desktop GUI program for viewing the events on a server. The current release is bare-bones and is not terribly good, but it will be enhanced later to include desktop/smartphone/tablet notifications for events. Unfortunately, it’s for advanced users only, as it’s a ruby script. It should work on windows, OS X, and linux, although it’s only been tested on windows.</p>\n<p>This is not intended to replace the GW2 event timer sites. In fact, if you want event timer information, I recommend <a href=\"http://www.gw2stuff.com/\">the awesome GW2Stuff.com site.</a></p>\n<p>Screenshot: <a href=\"http://i.imgur.com/Scalggh\">Imgur</a><br>\n“Farming view” screenshot of only the active/failed events in Cursed Shore: <a href=\"http://i.imgur.com/20XzaxR\">Imgur</a></p>\n<p><a href=\"https://github.com/darrylo/GW2EventExplorer\">Get it from github (current release is 0.1).</a> See the README.md for usage info.</p>\n<p>NOTE: when starting this program, nothing may happen for 10-15 seconds. Please be patient. Also see the README.md file for more information.</p>\n<p>Current minimal features:</p>\n<ul>\n\t<li>Seeing the available events on a given server. You can choose from any of the available servers.</li>\n\t<li>You can see all events on a server, or you can limit the events to a particular map.</li>\n\t<li>You can filter the display by event status: active, failed, success, warmup, or preparation (I’ve yet to see any event in the “preparation” state, though).</li>\n\t<li>The events automatically update every 5 minutes (this will be configurable in a future version).</li>\n\t<li>Your settings are automatically saved when you quit the program, and are automatically restored when you restart.</li>\n\t<li>The settings and the event database are stored in the current directory (the directory from which you started the program).<br>\nI’ve written this program for my own needs. If others find this useful, great. I’m open to suggestions.</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n\t<li>Ruby 1.9 or later, with the “tk” extension (e.g., “require ‘tk’” must work).<br>\nWindows users can download the latest <a href=\"http://rubyinstaller.org/downloads/\">Ruby 1.9 rubyinstaller</a> (“Ruby 1.9.3-p429” as of May 24, 2013.)</li>\n\t<li>You must have installed the following gems: <br>\n<pre><code>        gem install ruby-growl\n        gem install sqlite3</code></pre></li>\n\t<li>(Windows) You need to obtain the SQLite DLL. Go to the <a href=\"https://www.sqlite.org/download.html\">sqlite download page</a> and download the ZIP archive that contains the SQLite DLL. Open the ZIP archive and copy the contents to the “bin” directory of your Ruby 1.9 installation. Example: if you have installed Ruby1.9 in “C:\\Ruby193”, copy the SQLite DLLs to the “C:\\Ruby193\\bin” directory.</li>\n</ul>\n<p>Technical info:</p>\n<ul>\n\t<li>Config files and the event database are stored in the current directory.</li>\n\t<li>Yes, “database”. The backend uses sqlite to store the event data, and can store arbitrary amounts of historical event data. Data mining, anyone? The GUI, however, periodically trims and vacuums the database, as the GUI has no real need for historical data, except for the previous event snapshot.</li>\n\t<li>In the future, notifications will be handled by sending growl messages, which means:<br>\n      * You need a program to handle growl messages, and you might have to buy such a program. On windows, you need <a href=\"http://www.growlforwindows.com/\">Growl for Windows</a> (free). On OS X, you need to <a href=\"http://growl.info/\">buy Growl.</a>  Linux users are on their own, although <a href=\"http://sourceforge.net/projects/mumbles\">mumbles</a> might work.<br>\n      * For smartphone or tablet notifications, you have to buy one of the apps supported for growl message forwarding (this is supported only for windows and OS X). See the above websites for Growl for Windows or OS X Growl for supported apps.</li>\n\t<li>NOTE: while it is possible to convert this script into a windows .exe, there are no plans to do so. This is because the resulting executable is often incorrectly flagged as a virus, trojan, or other malware, due to the ruby script to .exe conversion methods.</li>\n</ul>","arenanet":false}]}