{"title":"World Boss daily kills?","pubDate":"2017-04-08T16:20:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/World-Boss-daily-kills","comments":[{"pubDate":"2017-04-11T20:21:06.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/World-Boss-daily-kills/6551608","author":"SlippyCheeze.5483","body":"\n<p>Thanks for the explanation of why.  In my head I naively assumed there was something like a hidden achievement used to track “has killed today” that got reset at daily time.  (Guess that WoW implementation detail was stuck in my head, and I didn’t realise it until now.  Since those are account-wide but kills are per-character, that doesn’t make sense in GW2 universe.)</p>\n<p>Note: I’m specifically thinking “have I killed this yet”, for an automated checklist sort of system, rather than “when is it up”, etc, sort of data.  That is, I use gw2timer.com to track when they spawn and things, and I can manually check off a boss on kill.  I’d like that “remember to click” bit to be automated by pulling from the API or whatever.<img src=\"/include/images/smilies/smile.png\"></p>","arenanet":false},{"pubDate":"2017-04-11T17:40:29.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/World-Boss-daily-kills/6551467","author":"Lawton Campbell.8517","body":"\n<p>Created a <a href=\"https://github.com/arenanet/api-cdi/issues/487\">tracking issue</a> for this, but it’s can of worms. The cats/nodes/SAB/etc are a bit simpler since they’re totally disconnected systems, whereas a world boss endpoint would want the event data, the spawn timers, etc. Which isn’t infeasible, it’s just more work to thread everything through the needle.</p>","arenanet":true},{"pubDate":"2017-04-08T16:20:35.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/World-Boss-daily-kills/6549111","author":"SlippyCheeze.5483","body":"\n<p>Is there any chance the API could export which world bosses have been killed that day, in the same way that, eg, dungeon completion, etc, are trackable?</p>","arenanet":false}]}