{"title":"WvW API and how it may affect WvW balance","pubDate":"2013-05-21T01:24:54.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/WvW-API-and-how-it-may-affect-WvW-balance","comments":[{"pubDate":"2013-05-21T09:27:27.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/WvW-API-and-how-it-may-affect-WvW-balance/2066275","author":"poke.3712","body":"\n<p>I don’t think logging would help that much. The WvW matches are so different every week due to commanders and players constantly changing. While individual commanders might have some tactics they will repeat over and over, the mix of the commanders and the different situations they will be in will make it hard to track that information and assign it accordingly.</p>\n<p>But of course this kind of balance discussion is much more suited for the WvW forum.</p>","arenanet":false},{"pubDate":"2013-05-21T05:38:25.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/WvW-API-and-how-it-may-affect-WvW-balance/2065606","author":"The Talcmaster.7391","body":"\n<p>It’s true that good information and communication can be huge deciding factors in the outcome of a battle, but I think the release of the information will have fairly minor effects.  The main reasons being that the primary people who are interested in this information can already receive most of that in the map, and people who are not in the map are not in much of a position to act on it in a timely manner anyways.  Having more information available outside of the game or WvW proper will likely not cause people who are not interested in WvW to suddenly jump in and start playing.  All the servers are still faced with the same population caps and the same information available.  Even if people have the information, it still takes skill to draw good conclusions, devise a strategy, and somehow get the people on the server to work together long enough to carry it out.  If someone manages to do that, I’d say they’ve earned their victory.</p>","arenanet":false},{"pubDate":"2013-05-21T05:08:18.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/WvW-API-and-how-it-may-affect-WvW-balance/2065498","author":"TimeBomb.3427","body":"\n<blockquote><div class=\"citey\"><cite title=\"Posted on May 21 2013 04:55AM\"><a href=\"/forum/community/api/WvW-API-and-how-it-may-affect-WvW-balance/2065452\">anzenketh.3759:</a></cite></div><div class=\"quotey\"><p>I don’t think with the information out there now compromises tactics too much. Perhaps a delay would be in order on the query of the data. Reason being It only displays what we have captured after we have captured it. Any active WvW player can get the same amount of data. Planners are contently looking at the maps. Reporting what is/is not taken so we already have this information.</p>\n<p>On the other hand what is captured and what is not is extremely useful for Map completer and frees up slots in WvW for people just watching the map waiting for areas to be taken small vary true but there are some.</p>\n<p>I do not think they should release any more data in WvW however. For exactly the reasons you stated. This includes what is/is not under attack.</p></div></blockquote>\n<p>The problem isn’t so much what could be discovered in real-time, but what could be gathered by logging and analyzing sizable chunks of data over a certain time span.</p>","arenanet":false},{"pubDate":"2013-05-21T04:55:08.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/WvW-API-and-how-it-may-affect-WvW-balance/2065452","author":"anzenketh.3759","body":"\n<p>I don’t think with the information out there now compromises tactics too much. Perhaps a delay would be in order on the query of the data. Reason being It only displays what we have captured after we have captured it. Any active WvW player can get the same amount of data. Planners are contently looking at the maps. Reporting what is/is not taken so we already have this information.</p>\n<p>On the other hand what is captured and what is not is extremely useful for Map completer and frees up slots in WvW for people just watching the map waiting for areas to be taken small vary true but there are some.</p>\n<p>I do not think they should release any more data in WvW however. For exactly the reasons you stated. This includes what is/is not under attack.</p>","arenanet":false},{"pubDate":"2013-05-21T01:24:54.000Z","guid":"http://forum-en.guildwars2.com/forum/community/api/WvW-API-and-how-it-may-affect-WvW-balance/2064741","author":"TimeBomb.3427","body":"\n<p>I sent this by PM to Cliff and got a great response, though he recommended that I post this publicly, of which I think would also be a good idea.</p>\n<p>My message to him:</p>\n<blockquote><div class=\"quotey\"><p>Hi Cliff. Thanks a lot for all the work you have done.</p>\n<p>I noticed that you expressed concern in regards to the WvW API affecting balance of WvW.</p>\n<p>While the WvW API doesn’t give us access to information we don’t already know, it does give us easier always-accurate access to that information.</p>\n<p>I’ve started a discussion thread on my server’s forum, but appears to be very possible to log all of the currently available data on a per-minute interval. That data would be logged to an ideally well-designed relational database, and then that data could be conveyed as useful statistics and information via charts and what-not.</p>\n<p>If all goes smoothly, this information could be analyzed by any intelligent person to figure out not just coverage weaknesses and strengths of every single server (identifying PPT of any server at any time), but also insight into the server’s strategy (or lack thereof) by looking at which objectives are taken in what order at what time. This may be just the peak of the iceberg.</p>\n<p>You seemed to express an unsure attitude towards releasing more specific information about WvW, specifically the actual real-time events. Releasing this information would make recording and analyzing statistics not just helpful, but dangerously effective.</p>\n<p>All in all, I was surprised to see how much details you provide us in the current WvW API. Furthermore, I would argue that the WvW API is already too potentially game-changing in its current form. Giving us much of anything more than just the current score is dangerous, as anyone, such as myself, with the know-how to log and analyze this data could potentially change the game.</p>\n<p>That’s my two cents. Once again, I appreciate all the work you’ve done, and look forward to seeing more. I’d love to hear your feedback on what I’ve just gone over. Thanks again, for everything.</p></div></blockquote>\n<p>Cliff’s response:</p>\n<blockquote><div class=\"quotey\"><p>Hi,</p>\n<p>First off, I’d recommend posting these types of things in the public forum than by private message. If I answer there, I answer the question for anyone who might have it.</p>\n<p>When I said that we are being careful with the information we release for WvW, that’s what I meant. That wasn’t a deflection saying we wouldn’t release the stuff you’re suggesting – in fact I think that it would be really cool to release that information.</p>\n<p>You’re right that even the information we’re exposing now via the API could cause WvW balance to change. We’re watching to see whether the overall impact on the game is positive or negative. If it’s positive, then we’d definitely consider exposing more information via the APIs.</p>\n<p>Thanks for your thoughts.</p></div></blockquote>","arenanet":false}]}